{
    "Bonaparte's Gull": [
        "shape: A small, ternlike gull, with slender bill, rather narrow, pointed wings, and slim body",
        "size: Larger than a Common Tern, smaller than a Ring-billed Gull crow-sized",
        "color: Breeding adults have black heads, red legs, and large white triangles in the wingtips that contrast with the gray wings. Nonbreeding birds are mostly white with grayish upperwings, white primaries (edged in black), and a gray spot on the cheek. Immatures are similar to nonbreeding adults but upperwing is edged in dark gray, and the tail is tipped in black",
        "habitat: Numerous aquatic habitats during migration and the nonbreeding season, from rivers to lakes, bays to open ocean. Breeding birds in the far north nest in trees and forage over taiga forest, tundra, and open waters of rivers, lakes, and bays"
    ],
    "Mew Gull": [
        "shape: Slender and streamlined body shape with pointed wings and a medium-sized bill.",
        "size: Medium-sized gull with an average length of around 18-20 inches (46-51 cm).",
        "color: White plumage with a light gray back, black wingtips, and a yellow bill.",
        "habitat: Coastal wetlands and estuaries."
    ],
    "Caspian Tern": [
        "shape: A large, heavy-bodied seabird (and largest of all terns), with a large head; thick, straight, pointed bill; and shallowly forked tail. The long, pointed wings are broad for a tern",
        "size: The largest tern species. Larger than a Ring-billed Gull, smaller than a Herring Gull crow-sized",
        "color: White overall, with pale gray upperwings. From below, the outer primaries in the wing are dark gray. Breeding adults have a black crown; winter adults and juveniles have a partially black crown with grayish speckling. The bill is coral red with a dusky tip. Feet and legs are blackish",
        "habitat: Breeds in open flat areas along coastlines, beaches, or on islands, very near freshwater or saltwater. Migrates through interior of continent and along coastlines, using rivers, reservoirs, lagoons, estuaries, and ocean waters. Winters mostly in coastal zones near saltwater, less often on interior lakes or rivers"
    ],
    "Black Tern": [
        "shape: A small and delicately built seabird with a thin, pointed bill; long, pointed wings; a shallowly forked tail; and short legs",
        "size: Larger than a Least Tern, smaller than a Common Tern between robin and crow",
        "color: Adults in breeding plumage are dark gray above with black heads and black underparts. The underwings and undertail coverts are pale. Nonbreeding adults are gray above, whitish below, with a dusky crown, ear-patch, and mark at the side of the breast. Juveniles are similar to nonbreeding adults but with a brown scaled pattern to the upperparts",
        "habitat: Nests in freshwater marshes and bogs; winters in coastal lagoons, marshes, and open ocean waters. Migrants may stop over in almost any type of wetland"
    ],
    "Common Tern": [
        "shape: Common Terns have long, narrow, angular wings and pointed wingtips. Unlike gulls, this tern has a straight, slender bill. The tail is forked and the legs are short",
        "size: Larger than a Least Tern, smaller than a Caspian Tern between robin and crow",
        "color: Common Terns are pale gray overall with a black cap. Breeding birds have a fully black cap that extends to the back of the neck and a gray belly. They also have an orange bill tipped in black and orange legs. Nonbreeding birds have a white forehead, a partial black cap, and black legs and bill. They also have a black bar across the shoulder known as a carpal bar and dark trailing edges on the wingtips as seen in flight",
        "habitat: Common Terns nest on rocky islands, barrier beaches, and saltmarshes and forage over open waters including inlets, lakes, and marine waters. During the breeding season they frequent both salt and freshwater, but during the winter they tend to stick to marine environments"
    ],
    "Forster's Tern": [
        "shape: A slender, long-tailed, long-winged seabird with a long, pointed bill and short legs. When perched, the long tail streamers extend past the end of the wings",
        "size: Larger than a Black Tern, smaller than a Bonaparte’s Gull between robin and crow",
        "color:  Breeding adults are gray above and white below, with a black cap and orange bill with black tip. The wingtips are silvery gray and the legs are orange. Nonbreeding adults are ghostly pale overall, with a dark bill, white crown, and thick blackish eye patch. Juveniles are similar to nonbreeding adults but have tan feathers on the upperparts, a pale base to the bill, and a shorter tail",
        "habitat:  Breeds in marshes, including freshwater and saltwater, usually in areas with extensive open water, sometimes with small islands or patches of floating vegetation. Winters mostly in oceans, bays, and estuaries, usually close to the coast. Some winter inland near the Gulf of Mexico and in northern Mexico"
    ],
    "Royal Tern": [
        "shape: A large tern, slender and long winged. The head is fairly large and often has a ragged crest at the back. Royal Terns have a substantial body, a long, forked tail, and short legs. The bill is long and daggerlike",
        "size: Larger than a Ring-billed Gull (but with shorter legs), smaller than a Caspian Tern crow-sized",
        "color: Breeding adults are gray below and white above, with a black crest and bright orange bill. Nonbreeders have a white forehead with black only at the rear of the crest. The outer primaries of the wing are blackish and the legs are black. Juveniles are similar but with tan feathers in upperparts, duskier upperwings, and a paler bill",
        "habitat: Warm, shallow waters of oceans and adjacent bays and rivers, usually close to shore. Nests and rests on barrier beaches, sandy islands, and artificial islands such as those created from dredging. Occasionally found inland after strong storms such as hurricanes"
    ],
    "Black Skimmer": [
        "shape: A medium-sized ternlike seabird with very long wings and an outsized bill in which the lower mandible is much longer than the upper",
        "size: Larger than a Laughing Gull, slightly smaller than a Royal Tern (but with longer wings) crow-sized",
        "color: Starkly black above and white below, with black-and-red bill and orange-red legs. Juveniles are brownish above, with pale-edged wing covert feathers",
        "habitat: Coastal beaches and islands near oceans or Gulf of Mexico; occasionally seen inland, especially in sites such as Salton Sea, California, and Palm Beach County, Florida"
    ],
    "Greater White-fronted Goose": [
        "shape: A medium-sized, heavy-bodied goose with a small bill, thick legs, and a short neck",
        "size: Larger than a Ross's Goose, smaller than a Canada Goose goose-sized or larger",
        "color: Adults are mostly brown with white feathering around the base of a pinkish-orange bill. Black barring marks the belly and the undertail is white. In flight a white \"U\" at the base of the tail is visible. At rest, a thin white line stretches across their sides. Juveniles lack the belly banding and white feathering around the bill. Both juveniles and adults have orangish legs",
        "habitat: Breeds in the tundra near wetlands, rivers, and ponds. Winters in agricultural fields, marshes, bays, and lakes. During migration forages in wet sedge meadows, tidal mudflats, lakes, ponds, and wetlands"
    ],
    "Brant": [
        "shape: A compact, small goose with a stubby bill and a relatively short neck compared to most geese",
        "size: Larger than a Mallard, smaller than a Canada Goose goose-sized or larger",
        "color: Adults have a black head, neck, and breast with variable white neck markings. They have, brown wings, white undertail, and pale flanks and belly that can vary from pale brown (in eastern North America) to blackish (in the West). Juveniles have pale fringes on the wing coverts and little or no white on the neck",
        "habitat: Breeds in the Arctic on marshlands, islands, and tundra. Stops over in similar habitats to molt before migrating south. Winters on lagoons, estuaries, mudflats, and saltmarshes near sand spits, barrier beaches, and ocean shores"
    ],
    "Cackling Goose": [
        "shape: A compact, small goose, with short neck, rounded crown, rather long wings, and short legs. The small bill is short and meets the forehead at a steep angle",
        "size: Slightly larger than a Brant, smaller than most Canada Geese goose-sized or larger",
        "color: Brown overall with black neck and head, white cheek and throat (\"chinstrap\"), white under the tail, and blackish bill, legs, and feet. Brown coloration varies from dark to pale brown among the subspecies",
        "habitat: Cackling Geese nest in arctic tundra, typically on islands in small lakes or marshes (and one subspecies occurs on islands in the Bering Sea). They forage year-round in wetlands and meadows. During migration and on the wintering grounds they forage in agricultural fields. At night they roost with other geese on lakes, reservoirs, or wetlands"
    ],
    "Canada Goose": [
        "shape: Canada Geese are big waterbirds with a long neck, large body, large webbed feet, and wide, flat bill",
        "size: Larger than a Mallard, smaller than a Mute Swan goose-sized or larger",
        "color: Canada Geese have a black head with white cheeks and chinstrap, black neck, tan breast, and brown back",
        "habitat: Just about anywhere near lakes, rivers, ponds, or other small or large bodies of water, and in yards, park lawns, and farm fields"
    ],
    "Mute Swan": [
        "shape: Mute Swans are very large waterfowl. They have heavy bodies, short legs, and a long, slender neck habitually held in a graceful S. The large, flat bill has a bulging knob at the base",
        "size: Among the largest of waterfowl: more than double the size of a Snow Goose and about the same size as a Trumpeter Swan goose-sized or larger",
        "color: Mute Swans are entirely white with a bill that is orange with a black base. Young swans (cygnets) may be dusky brown-gray all over, with a gray-black bill",
        "habitat: Look for Mute Swans in city-park ponds, as well as rivers, lakes, and estuaries"
    ],
    "Trumpeter Swan": [
        "shape: Trumpeter Swans are immense waterfowl with heavy bodies and long necks typically held straight both on the water and in flight. The large bill slopes gradually down from the forehead",
        "size: The largest waterfowl species in North America; slightly larger than a Mute Swan and considerably larger than a Tundra Swan goose-sized or larger",
        "color: Adult Trumpeter Swans are entirely white with a black bill and black legs. Immatures are gray-brown",
        "habitat: Trumpeter Swans breed in open habitats near shallow water bodies. They winter on estuaries, large lakes, and rivers that remain at least partially ice-free year-round. They sometimes forage in fields"
    ],
    "Tundra Swan": [
        "shape: Tundra Swans are very large waterfowl with heavy bodies and long necks. The bill slopes gently away from the head",
        "size: Larger than a Snow Goose; smaller than a Mute Swan or Trumpeter Swan goose-sized or larger",
        "color: Tundra Swans have entirely white plumage. The bill is mostly black and usually has a yellow spot at the base. The legs and feet are black. Immature birds are gray-tinged on the wings, head, and neck",
        "habitat: Tundra Swans nest on arctic tundra. Look for Tundra Swans during winter on estuaries and coastal waters, and some inland lakes. On migration and in winter, they may leave the water to feed in agricultural fields"
    ],
    "American Black Duck": [
        "shape: American Black Ducks are large ducks with a profile nearly identical to Mallards. They have rounded heads, thick bills, and bulky bodies. Like other dabbling ducks they sit high in the water with their tails high",
        "size: About the same size as a Mallard; slightly larger than a Gadwall between crow and goose",
        "color: American Black Ducks have very dark brown bodies with pale gray-brown heads and yellow-green bills. Females tend to be slightly paler than males, with duller olive bills. In flight, the underwings are bright white. The secondaries (speculum) are iridescent purple without white borders",
        "habitat: American Black Ducks nest in eastern wetlands including freshwater and saltmarshes. During migration and winter, they rest and forage in protected ponds, marshes, and bays"
    ],
    "Mottled Duck": [
        "shape: A relatively large duck, similar in size to a Mallard, with a sturdy body, short neck, short tail, and moderately long bill",
        "size: Larger than a Blue-winged Teal, smaller than a Common Merganser between crow and goose",
        "color: Both sexes are mostly brown and buff, like a female Mallard but richer with a yellow bill and a black patch at the opening of the bill (the gape). The very buffy face and throat lack fine streaking. The back (scapulars) and sides are rich brown streaked with buff. Males have intensely yellow bills; females have greenish yellow to orangeish, with or without dark markings. White in the tail is an indication that the individual has some Mallard genes: a pure Mottled Duck has a dark tail",
        "habitat: Freshwater wetlands including marshes, lakes, ponds, ditches, impoundments, flooded fields (including rice fields), stormwater collection areas, mosquito control reservoirs, and sewage treatment plants"
    ],
    "Scaled Quail": [
        "shape: A compact chickenlike bird with a small head and a distinctive short crest. It has a plump body, short tail, and short, strong legs",
        "size: Slightly larger than a Northern Bobwhite; about the same size as a Gambel’s Quail between robin and crow",
        "color: Adults are pale brownish with elegant dark scaling on the underparts. The head is plain brown with a buffy accent on the crest. The back is bluish gray and the wings are brown stippled with buff. Juveniles are similar but have a shorter crest, and the upperwing has a more ornate pattern",
        "habitat: Desert grasslands and sparsely vegetated shrublands with plants like yucca, cholla, mesquite, skunkbush sumac, prickly pear, sandsage, pinyon, and juniper"
    ],
    "Northern Bobwhite": [
        "shape: Bobwhite are small quail with rounded bodies, small heads, rounded wings, and short tails",
        "size: between robin and crow",
        "color: They are intricately patterned in brown, rufous, buff, and black. Males have a bold black-and-white head pattern. Females have a buffy throat and eyebrow",
        "habitat: Northern Bobwhites live in open pine forests, overgrown fields, shrubby areas, and grasslands. They respond well to areas managed with prescribed fire, which helps to maintain an open, grassy ground layer"
    ],
    "Ruffed Grouse": [
        "shape: Ruffed Grouse are fairly small grouse with a short, triangular crest and a long, fan-shaped tail. They have short legs and often look slimmer than other grouse species",
        "size: About the size of an American Crow; distinctly smaller than a Wild Turkey crow-sized",
        "color: Ruffed Grouse are intricately patterned with dark bars and spots on either a reddish-brown or grayish background. Dark bars down the side of the neck continue and widen on the belly. The tail is finely barred, with one wide, black band near the tip",
        "habitat: Ruffed Grouse usually occupy mixed deciduous and coniferous forest interiors with scattered clearings. They also live along forested streams and in areas growing back from burning or logging"
    ],
    "Wild Turkey": [
        "shape: Wild Turkeys are very large, plump birds with long legs, wide, rounded tails, and a small head on a long, slim neck",
        "size: One of our largest and heaviest birds; smaller than a Trumpeter Swan; about twice the size (and four times as heavy) as a Ring-necked Pheasant goose-sized or larger",
        "color: Turkeys are dark overall with a bronze-green iridescence to most of their plumage. Their wings are dark, boldly barred with white. Their rump and tail feathers are broadly tipped with rusty or white. The bare skin of the head and neck varies from red to blue to gray",
        "habitat: Wild Turkeys live in mature forests, particularly nut trees such as oak, hickory, or beech, interspersed with edges and fields. You may also see them along roads and in woodsy backyards. After being hunted out of large parts of their range, turkeys were reintroduced and are numerous once again"
    ],
    "Pied-billed Grebe": [
        "shape: Pied-billed Grebes are small, chunky swimming birds. They have compact bodies and slender necks, with relatively large, blocky heads and short, thick bills. They have virtually no tail",
        "size: Smaller than an American Coot; about the size of a Green-winged Teal between robin and crow",
        "color: These are brown birds, slightly darker above and more tawny-brown on the underparts. During spring and summer, the crown and nape are dark and the throat is black. While breeding, the bill is whitish with a black band (“pied’), but otherwise is yellow-brown. Juveniles have striped faces",
        "habitat: Look for Pied-billed Grebes on small, quiet ponds and marshes where thick vegetation grows out of the water. In winter they occur on larger water bodies, occasionally in large groups"
    ],
    "Western Grebe": [
        "shape: A large, slender waterbird with a very long neck, a large head that may show a peak, and a long, slender, pointed bill",
        "size: Larger than a Mallard, smaller than a Common Loon crow-sized",
        "color: Western Grebes are crisp black and white, with a sharp transition between black and white extending down the neck. The head and most of the face are black, with white below the eye. The bill is yellowish or greenish yellow and the eye is red at close range",
        "habitat: Breeding birds use freshwater lakes; nonbreeding birds are found in both freshwater and saltwater environments, though never far from shore in oceans"
    ],
    "Clark's Grebe": [
        "shape: A large waterbird with a very long, slender neck, a fine, straight bill, and a relatively small body",
        "size: Larger and more slender than a Mallard, much smaller and slighter than a Common Loon crow-sized",
        "color: A neat combination of blackish above and white below. The face is white up to and around the eye, where it meets the black cap. The bill is vivid orange or orange-yellow, and at close range the eye is red",
        "habitat: Western Grebes are rarely found away from aquatic habitats. Breeding birds use freshwater lakes; nonbreeding birds are found in both freshwater and along saltwater coasts"
    ],
    "Wood Stork": [
        "shape: Wood Storks are hefty wading birds with football-shaped bodies perched atop long legs. They have a long neck and a long, thick bill that is curved at the tip. They fly with their neck and legs outstretched but tend to perch with the neck drawn in, giving them a humpbacked appearance",
        "size: Larger than a Great Egret, smaller than a Great Blue Heron between crow and goose",
        "color: Wood Storks are entirely white save for their black flight feathers and tail. The head is unfeathered and scaly-looking",
        "habitat: Wood Storks breed in fresh and brackish forested wetlands. They forage in wetlands, swamps, ponds, and marshes, especially those with an open canopy"
    ],
    "Brandt's Cormorant": [
        "shape: A large, heavy-bodied seabird with a long neck, and a fairly long bill with a hooked tip. It has a medium-length tail, short legs, and large, webbed feet",
        "size: Larger than a Double-crested Cormorant, smaller than a Brown Pelican between crow and goose",
        "color: Adults in breeding plumage are mostly blackish, with blue eyes, vivid blue throat skin surrounded by a buffy band, and whiskery white feathers on the head, neck, and shoulders. Nonbreeding adults are uniformly black. Juveniles are brownish overall, with the throat skin surrounded by buffy plumage",
        "habitat: Nests on rocky islands and cliffs. Forages in littoral (nearshore) ocean areas where upwelling brings nutrients toward the surface and attracts fish. Feeds less often in estuaries and lagoons. Seldom found more than 10 miles from shore unless making migratory movements"
    ],
    "Neotropic Cormorant": [
        "shape: A slim waterbird, small for a cormorant, with a long neck, a rather long tail, and a fairly thin, straight bill with a hooked tip. It has broad wings and large webbed feet",
        "size: Larger than a Black-crowned Night-Heron, smaller than a Double-crested Cormorant between crow and goose",
        "color: Adults are black birds with orange skin on the throat, bordered with a thin white line. At close range and in good light, there is a faint olive sheen to the wings. In breeding plumage, adults have a small white tuft of feathers near ear. Juveniles are similar but the head, neck, and breast are pale brownish",
        "habitat: Nests in trees or on bare ground next to water, often on barrier islands or small islands in lakes. Forages in almost any sheltered body of water, from calm coastal bays to marshes, swamps, rivers, ponds, reservoirs, and fish farms inland"
    ],
    "Pelagic Cormorant": [
        "shape: A large seabird with a long, thin neck, a long tail, and a narrow, small head. Breeding adults have short crests on the front of the crown and the hindcrown. Pelagic Cormorants are smaller and slenderer than other cormorant species of the Pacific",
        "size: Larger than a Snowy Egret, notably smaller and slenderer than a Double-crested Cormorant between crow and goose",
        "color: Breeding adults are blackish, with green or purple gloss. They have a small patch of red skin around the bill, and square white patches on the flanks. Nonbreeding adults are similar but less glossy, with dull facial skin and without the white flank patches. Juveniles are uniformly dark brown",
        "habitat: Nests on rocky islands, cliffs, and shorelines of the Pacific; forages in waters adjacent to nesting areas, rarely more than a few miles from land. Nonbreeding birds use similar habitats"
    ],
    "Anhinga": [
        "shape: Anhingas are large and slender waterbirds with long fanlike tails that resemble a turkey's tail. They have a long S-shaped neck and a daggerlike bill. In flight, Anhingas look like a flying cross; the wings are held out flat and the neck and tail stick straight out. They have slim bodies and look rather flattened in flight",
        "size: Larger than an American Coot, smaller than a Double-crested Cormorant between crow and goose",
        "color: Adult male Anhingas are black with silvery to white streaks on the back and wings. Females and immatures have a pale tan head, neck, and breast. The bill, legs, and feet are yellowish orange",
        "habitat: Year-round, Anhingas inhabit shallow freshwater lakes, ponds, and slow-moving streams with branches or logs near the water for drying and sunning themselves. They also use brackish bays and lagoons along the coast, but they generally don't use areas with extensive open water"
    ],
    "American White Pelican": [
        "shape: A huge waterbird with very broad wings, a long neck, and a massive bill that gives the head a unique, long shape. They have thick bodies, short legs, and short, square tails. During the breeding season, adults grow an unusual projection or horn on the upper mandible near the tip of the bill",
        "size: One of our largest flying birds: considerably larger than a Bald Eagle; smaller than a California Condor goose-sized or larger",
        "color: Adult American White Pelicans are snowy white with black flight feathers visible only when the wings are spread. A small patch of ornamental feathers on the chest can become yellow in spring. The bill and legs are yellow-orange. Immatures are mostly white as well, but the head, neck, and back are variably dusky",
        "habitat: American White Pelicans typically breed on islands in shallow wetlands in the interior of the continent. They spend winters mainly on coastal waters, bays, and estuaries, or a little distance inland"
    ],
    "Brown Pelican": [
        "shape: Brown Pelicans are huge, stocky seabirds. They have thin necks and very long bills with a stretchy throat pouch used for capturing fish. Their wings are very long and broad and are often noticeably bowed when the birds are gliding",
        "size: Huge. Slightly smaller than an American White Pelican; much larger than a Herring Gull goose-sized or larger",
        "color: Adult Brown Pelicans are gray-brown birds with yellow heads and white necks. In breeding plumage, the back and sides of the neck turn a rich, dark reddish-brown. Immatures are gray-brown above (including the head and neck) with pale whitish belly and breast",
        "habitat: Brown Pelicans live along southern and western sea coasts and are rarely seen inland (except at the Salton Sea in California, where they are regular in large numbers). They nest in colonies, often on isolated islands free of land predators"
    ],
    "Great Blue Heron": [
        "shape: Largest of the North American herons with long legs, a sinuous neck, and thick, daggerlike bill. Head, chest, and wing plumes give a shaggy appearance. In flight, the Great Blue Heron curls its neck into a tight “S” shape; its wings are broad and rounded and its legs trail well beyond the tail",
        "size: Taller and much heavier than a Great Egret; smaller and much less bulky than a Sandhill Crane goose-sized or larger",
        "color: Great Blue Herons appear blue-gray from a distance, with a wide black stripe over the eye. In flight, the upper side of the wing is two-toned: pale on the forewing and darker on the flight feathers. A pure white subspecies occurs in coastal southern Florida",
        "habitat: Look for Great Blue Herons in saltwater and freshwater habitats, from open coasts, marshes, sloughs, riverbanks, and lakes to backyard goldfish ponds. They also forage in grasslands and agricultural fields. Breeding birds gather in colonies or “heronries” to build stick nests high off the ground"
    ],
    "Great Egret": [
        "shape: Great Egrets are tall, long-legged wading birds with long, S-curved necks and long, dagger-like bills. In flight, the long neck is tucked in and the legs extend far beyond the tip of the short tail",
        "size: Smaller than a Great Blue Heron; larger than a Snowy Egret goose-sized or larger",
        "color: All feathers on Great Egrets are white. Their bills are yellowish-orange, and the legs black",
        "habitat: You’ll find Great Egrets in both freshwater and saltwater habitats. They are colonial nesters, typically placing stick nests high in trees, often on islands that are isolated from mammalian predators such as raccoons"
    ],
    "Snowy Egret": [
        "shape: These are medium-sized herons with long, thin legs and long, slender, bills. Their long, thin neck sets the small head well away from the body",
        "size: Smaller than a Great Egret; larger than a Cattle Egret between crow and goose",
        "color: Adult Snowy Egrets are all white with a black bill, black legs, and yellow feet. They have a patch of yellow skin at the base of the bill. Immature Snowy Egrets have duller, greenish legs",
        "habitat: They are most common along the coast, though they do breed patchily in inland wetlands. Snowy Egrets nest colonially, usually on protected islands, and often with other small herons. They concentrate on mudflats, beaches, and wetlands, but also forage in wet agricultural fields and along the edges of rivers and lakes"
    ],
    "Tricolored Heron": [
        "shape: A medium-sized, delicate and slim heron with a long, daggerlike bill. Its long thin neck curves up to its small head",
        "size: Larger than a Snowy Egret, smaller than a Great Blue Heron between crow and goose",
        "color: A colorful heron with a mix of blue-gray, lavender, and white. Unlike other dark herons, they have a white belly. Breeding birds have small white plumes extending from the back of the head, a bright blue patch of skin around the bill, and pink legs. Nonbreeding birds lack the flourishes of breeding birds and have yellowish legs. Juveniles have a rusty neck and rusty edged feathers",
        "habitat: Found in coastal estuaries, saltmarshes, mangroves, and lagoons during the breeding season. Outside of the breeding season they use coastal areas as well as freshwater marshes, lake edges, canals, and ditches"
    ],
    "Cattle Egret": [
        "shape: Compared with other herons, Cattle Egrets are noticeably small and compact. They have relatively short legs and a short thick neck. The straight, daggerlike bill is shorter and thicker than other herons. They have medium-length, broad, rounded wings",
        "size: Smaller and stockier than a Snowy Egret; larger than a Rock Pigeon between crow and goose",
        "color: Adult Cattle Egrets are all white with a yellow bill and legs. In breeding plumage they have golden plumes on their head, chest, and back. Juveniles have dark legs and bill",
        "habitat: They forage in flocks in upland areas such as pastures and fields, generally focusing on drier habitats than other species of white herons"
    ],
    "Green Heron": [
        "shape: Compared with most herons, Green Herons are short and stocky, with relatively short legs and thick necks that are often drawn up against their bodies. They have broad, rounded wings and a long, daggerlike bill. They sometimes raise their crown feathers into a short crest",
        "size: About the size of an American Crow; smaller than a Black-crowned Night-Heron crow-sized",
        "color: From a distance Green Herons look all dark. In better light they are deep green on the back with a rich chestnut breast and neck. The wings are dark gray. Juveniles are browner, with pale streaking on the neck and spots on the wings",
        "habitat: Green Herons live around wooded ponds, marshes, rivers, reservoirs, and estuaries"
    ],
    "Glossy Ibis": [
        "shape: A medium-sized wading bird with compact body, long neck, long legs, and long, curved bill",
        "size: Larger than a Cattle Egret, slightly smaller than a night-heron between crow and goose",
        "color: The plumage appears dark, almost blackish, at a distance or in poor light. At close range, much of the body is maroon, with the wing coverts showing metallic green, bronze, and violet tones",
        "habitat: Glossy Ibises frequent almost any wetland environment with shallow water or exposed mud and also readily feeds in farm fields or open areas where soils are moist"
    ],
    "White-faced Ibis": [
        "shape: A medium-sized, long-legged wading bird with a long, strongly curved bill. It has a thick, oval-shaped body and a long neck. The wings are broad and fairly rounded",
        "size: Larger than a Cattle Egret, smaller than a Great Egret crow-sized",
        "color: White-faced Ibises look dark, almost blackish, at a distance. Close up and in good light, breeding adults are glossy maroon with metallic green and bronze tones on the wing. They typically have red eyes with pink legs and facial skin. The face is highlighted by a narrow band of white, absent in Glossy Ibis. Immature and nonbreeding adults are more matte brown, without the white facial outline and with duller legs",
        "habitat: White-faced Ibises frequent almost any wetland environment with shallow water or exposed mud and also readily feed in farm fields or open areas where soils are moist"
    ],
    "Roseate Spoonbill": [
        "shape: Roseate Spoonbills are medium-sized waterbirds with a football-shaped body and long legs. The long bill that is flattened into a spoon at the end protrudes from their small head. They fly with their long necks outstretched and often rest with it curled into an S",
        "size: Larger than a White Ibis, smaller than a Great Blue Heron goose-sized or larger",
        "color: Roseate Spoonbills are pale pink birds with brighter pink shoulders and rump. They have a white neck and a partially feathered, yellowish green head from which their red eyes shine. Juveniles are paler pink and have a completely feathered head for 3 years until they attain adult breeding plumage",
        "habitat: Roseate Spoonbills forage in the shallows of fresh, brackish, and marine waters including bays, mangroves, forested swamps, and wetlands. They nest and roost in trees and shrubs along the water's edge"
    ],
    "Black Vulture": [
        "shape: Black Vultures are large raptors. In flight, they hold their broad, rounded wings flat and angled slightly forward. The tail is very short and rounded. They have small, bare heads and narrow but strongly hooked bills",
        "size: Slightly smaller than a Turkey Vulture; slightly larger than a Red-tailed Hawk goose-sized or larger",
        "color: These birds are uniform black except for white patches or “stars” on the underside of their wingtips (this can be hard to see in strong light or from far away). The bare skin of the head is black",
        "habitat: Look for Black Vultures in open areas within forested landscapes. They typically nest and roost in wooded areas and soar above open areas to seek their food. Black Vultures have substantially increased their range northward in recent decades"
    ],
    "Turkey Vulture": [
        "shape: Turkey Vultures are large dark birds with long, broad wings. Bigger than other raptors except eagles and condors, they have long \"fingers\" at their wingtips and long tails that extend past their toe tips in flight. When soaring, Turkey Vultures hold their wings slightly raised, making a ‘V’ when seen head-on",
        "size: Smaller than an eagle; larger than a Red-tailed Hawk goose-sized or larger",
        "color: Turkey Vultures appear black from a distance but up close are dark brown with a featherless red head and pale bill. While most of their body and forewing are dark, the undersides of the flight feathers (along the trailing edge and wingtips) are paler, giving a two-toned appearance",
        "habitat: Turkey Vultures are common around open areas such as roadsides, suburbs, farm fields, countryside, and food sources such as landfills, trash heaps, and construction sites. On sunny days, look for them aloft as early as 9 a.m.; in colder weather and at night they roost on poles, towers, dead trees, and fence posts"
    ],
    "Osprey": [
        "shape: Ospreys are very large, distinctively shaped hawks. Despite their size, their bodies are slender, with long, narrow wings and long legs. Ospreys fly with a marked kink in their wings, making an M-shape when seen from below",
        "size: Smaller than a Bald Eagle; larger and longer-winged than a Red-tailed Hawk goose-sized or larger",
        "color: Ospreys are brown above and white below, and overall they are whiter than most raptors. From below, the wings are mostly white with a prominent dark patch at the wrists. The head is white with a broad brown stripe through the eye. Juveniles have white spots on the back and buffy shading on the breast",
        "habitat: Look for Ospreys around nearly any body of water: saltmarshes, rivers, ponds, reservoirs, estuaries, and even coral reefs. Their conspicuous stick nests are placed in the open on poles, channel markers, and dead trees, often over water"
    ],
    "Swallow-tailed Kite": [
        "shape: Swallow-tailed Kites are large but slender and buoyant raptors. They have long, narrow, pointed wings, slim bodies, and a very long, deeply forked tail. The bill is small and sharply hooked",
        "size: About the same overall length but less than half as heavy as a Red-tailed Hawk between crow and goose",
        "color: Swallow-tailed Kites are a sharp contrast of bright-white head and underparts and gleaming black wings, back, and tail. From below, the wing linings are white and the flight feathers are black",
        "habitat: Look for Swallow-tailed Kites over swamps, marshes, and large rivers of the southeastern U.S., particularly in Florida. At the end of summer, all the Swallow-tailed Kites in the U.S. leave and migrate south to South America"
    ],
    "White-tailed Kite": [
        "shape: A small to medium-sized raptor with narrow, pointed wings and a long tail. When perched, it looks rather big-headed with a long and skinny body",
        "size: Larger than an American Kestrel, smaller than a Northern Harrier between crow and goose",
        "color: A largely pale raptor easily identified by its entirely white tail and black shoulder patches. Note the white head and red eyes (visible at close range). Sexes are similar",
        "habitat: Found in grasslands, open woodlands, savannas, marshes, and cultivated fields"
    ],
    "Mississippi Kite": [
        "shape: Mississippi Kites are slender, fairly small raptors with long, pointed wings. The tail is fairly long and square-tipped. The strongly hooked bill is small and delicate",
        "size: Larger than a Rock Pigeon; smaller than a Peregrine Falcon between crow and goose",
        "color: Mississippi Kites are an inky mix of gray and black, lightening to pale gray-white on the head and in the secondaries of the wings. The wingtips and tail are black. Juveniles are streaky, with brownish chests and underwings, and banded tails",
        "habitat: They live in bottomland hardwood forests of the Southeast and in tree-lined areas of the southern prairies including windbreaks, shelterbelts, parks, and urban areas"
    ],
    "Harris's Hawk": [
        "shape: Harris's Hawks are large and lanky raptors with long legs and fairly long tails. They fly on broad, rounded wings. Females weigh nearly twice as much as males",
        "size: Larger than a Cooper's Hawk, smaller than a Golden Eagle crow-sized",
        "color: Harris's Hawks are dark brown overall with reddish brown feathers on the wings and thighs. The tail is mostly dark with a white rump and white terminal band. From below, the inner wings are reddish brown. Immature birds show patches of white on the belly and wings, and have a narrower white band across the bottom of the tail. They also have fine barring on the underwings and tail",
        "habitat: Harris's Hawks occur in semiopen desert lowlands—often among mesquite, paloverde, saguaro, and organ pipe cactus. They also frequent urban and suburban areas because these areas offer easy access to water and food (pigeons)"
    ],
    "Crested Caracara": [
        "shape: The Crested Caracara is a medium-sized, bulky raptor with long legs. Its flat head is topped with a shaggy crest. In flight, note its long, straight wings and diamond-shaped tail. The bill is heavy with a sharp tip",
        "size: Larger than a Peregrine Falcon, smaller than a Turkey Vulture between crow and goose",
        "color: Crested Caracaras are black and white with yellow-orange legs and yellow-orange skin around the bill. Their black cap contrasts strongly with their white neck and cheeks. In flight the undertail and outer flight feathers are white. Juveniles are brown and white and lack the adult's yellow-orange legs and facial skin",
        "habitat: Crested Caracaras inhabit open country including pastures, cultivated areas, deserts, scrub, and savannas. They perch on scattered trees, poles, and fences that offer a good view of the surroundings"
    ],
    "Merlin": [
        "shape: Merlins are small falcons with a powerful build that is broader and stockier than the slightly smaller American Kestrel. Merlins have sharply pointed wings, a broad chest, and a medium length tail",
        "size: Slightly larger than an American Kestrel; less bulky than a Rock Pigeon between robin and crow",
        "color: Merlins are generally dark and streaky, though their coloration varies geographically and by gender. Adult male Merlins are slaty gray to dark gray; females and immatures are browner. The chest is usually heavily streaked and the underwings are dark. The dark tail has narrow white bands, and the face often lacks a prominent malar or “mustache” stripe",
        "habitat: Merlins nest in forested openings, edges, and along rivers across northern North America. They have also begun nesting in towns and cities. During migration and winter, be on the lookout for Merlins in open forests, grasslands, and especially coastal areas with flocks of small songbirds or shorebirds"
    ],
    "Prairie Falcon": [
        "shape: Prairie Falcons are large falcons about the size of a peregrine. They have pointed wings and medium-long tails",
        "size: Larger than a Merlin; smaller than a Swainson's Hawk between crow and goose",
        "color: Prairie Falcons are brown above and pale with brown markings on the breast and belly. From below, they show dark under the wing from the \"armpit\" to the wrist. From above, the tail is paler and contrasts with the back and wings. They have a pale stripe above the eye and a brown mustache stripe",
        "habitat: They occur in wide-open habitats of the West, including sagebrush, desert, prairie, agricultural fields, and alpine meadows up to about 11,000 feet elevation. They nest on ledges on sheer rocky cliffs"
    ],
    "American Coot": [
        "shape: The American Coot is a plump, chickenlike bird with a rounded head and a sloping bill. Their tiny tail, short wings, and large feet are visible on the rare occasions they take flight",
        "size: About two-thirds the size of a Mallard between robin and crow",
        "color: Coots are dark-gray to black birds with a bright-white bill and forehead. The legs are yellow-green. At close range you may see a small patch of red on the forehead",
        "habitat: Look for American Coots at ponds in city parks, in marshes, reservoirs, along the edges of lakes, and in roadside ditches, sewage treatment ponds, and saltwater inlets or saltmarshes"
    ],
    "Sandhill Crane": [
        "shape: Sandhill Cranes are very large, tall birds with a long neck, long legs, and very broad wings. The bulky body tapers into a slender neck; the short tail is covered by drooping feathers that form a “bustle.” The head is small and the bill is straight and longer than the head",
        "size: About the same size, but considerably bulkier, than a Great Blue Heron. Smaller than a Whooping Crane goose-sized or larger",
        "color: These are slate gray birds, often with a rusty wash on the upperparts. Adults have a pale cheek and red skin on the crown. Their legs are black. Juveniles are gray and rusty brown, without the pale cheek or red crown",
        "habitat: Sandhill Cranes breed and forage in open prairies, grasslands, and wetlands. Outside of the breeding season, they often roost in deeper water of ponds or lakes, where they are safe from predators"
    ],
    "Semipalmated Plover": [
        "shape: A small, compact shorebird with a short, stubby bill, a round head, and large eyes. The body is plump, with a short neck and medium-length legs",
        "size: Larger than a Least Sandpiper, smaller than a Killdeer between sparrow and robin",
        "color: Adults are brown above, white below, with one black band on the breast. Black around the eye, with white marks above eye and bill and a white band above the black collar. The short orange bill has a black tip. Juveniles have brown instead of black on the face, and a brown breast band that is sometimes incomplete. Legs are yellow-orange",
        "habitat: Nests in arctic tundra. Forages in mudflats, agricultural fields, river margins, sewage ponds, and lakeshores. Roosts in marshes or on beaches"
    ],
    "Killdeer": [
        "shape: Killdeer have the characteristic large, round head, large eye, and short bill of all plovers. They are especially slender and lanky, with a long, pointed tail and long wings",
        "size: Similar in size to American Robin, but with longer legs and wings robin-sized",
        "color: Brownish-tan on top and white below. The white chest is barred with two black bands, and the brown face is marked with black and white patches. The bright orange-buff rump is conspicuous in flight",
        "habitat: Look for Killdeer on open ground with low vegetation (or no vegetation at all), including lawns, golf courses, driveways, parking lots, and gravel-covered roofs, as well as pastures, fields, sandbars and mudflats. This species is one of the least water-associated of all shorebirds"
    ],
    "American Oystercatcher": [
        "shape: A large, thickset shorebird with a long, stout bill, a large head, robust neck, and long, thick legs",
        "size: Larger than a Willet, smaller than a Herring Gull crow-sized",
        "color: American Oystercatchers look black-and-white from a distance, with a bright orange-red bill. At closer range, the back and wings are brown, with a black head and breast, white underparts, yellow eye, and red eyering. In flight, look for a white wingbar and white tail base",
        "habitat: Barrier islands and beaches, saltmarshes, and shellfish reefs"
    ],
    "Black Oystercatcher": [
        "shape: A large, heavyset shorebird with a very long, thick straight bill. The neck is heavy and the legs are long and thick",
        "size: Larger than a Willet, smaller than a Long-billed Curlew crow-sized",
        "color: Adults are blackish with a brilliant orange-red bill and yellow eye ringed with red. At close range the wings, tail, and back are dark brown. Juveniles are brownish overall, with outer portion of bill dusky",
        "habitat: Nests on islands, headlands, and beaches. Forages in adjacent rocky shorelines and tidepools, sometimes on open tidal flats, rarely in grassy areas"
    ],
    "Black-necked Stilt": [
        "shape: A tall but small-bodied shorebird with very long legs, a long neck, small head, and thin, straight bill",
        "size: Smaller than a Willet, larger than a Lesser Yellowlegs between robin and crow",
        "color: These birds are black above and white below, with white around the eye and rosy pink legs. In females and immatures the black areas can be brownish",
        "habitat: Black-necked Stilts are almost always seen near shallow water, including both salt and fresh water, especially mudflats, salt pans, saltmarshes, and many human-modified habitats such as sewage ponds, evaporation pools, and flooded fields"
    ],
    "American Avocet": [
        "shape: Large, slender shorebird with a long, upturned bill, a long neck, and a round head. Its oval body sits atop long legs",
        "size: Larger than a Black-necked Stilt, smaller than a Snowy Egret between robin and crow",
        "color: Breeding birds have a chic rusty head and neck that turns grayish white after breeding. A black patch on the back and black-and-white wings mark its largely white body. The legs are bluish gray",
        "habitat: Found in wetlands including shallow fresh and saltwater wetlands, salt ponds, impoundments, and evaporation ponds. Forages in open water generally less than 8 inches deep. During winter also uses intertidal mudflats, tidal lagoons, brackish impoundments, sewage ponds, rice fields, and flooded pastures"
    ],
    "Solitary Sandpiper": [
        "shape: A small, slender shorebird with a somewhat long neck and long bill. It has fairly long wings and legs",
        "size: Slightly larger than a Spotted Sandpiper, smaller than a Lesser Yellowlegs robin-sized",
        "color: Dark olive-brown above with a white eyering; pale below. In breeding plumage, the head and breast show dark stippling and the upperparts are neatly spotted with white. In nonbreeding plumage the back is mostly unspotted and the breast is washed with brown. The legs are olive. Dark underwings contrast sharply with white belly in flight",
        "habitat: Solitary Sandpipers nest in arctic muskeg bogs. Migrating and wintering birds use wooded swamps, river edges, bogs, lakes, ponds, ditches, pastures, rice fields, and wet meadows"
    ],
    "Greater Yellowlegs": [
        "shape: Large and lanky for a shorebird, with very long legs, a long neck, and a thick-based, slightly upturned bill",
        "size: About 50% larger than a Lesser Yellowlegs, smaller than a Marbled Godwit between robin and crow",
        "color: In breeding plumage the Greater Yellowlegs is a striking bird, with dense, dark bands on the breast and neck. Most of the year, the pattern is more subdued: a black and white checkerboard of speckling on the back, with a finely streaked neck and head. There is usually some barring on the flanks and a bright, white eyering. Bill is dark. In all plumages, legs are appropriately bright yellow, occasionally orange in spring",
        "habitat: The Greater Yellowlegs occurs in a wide variety of wetland habitats in migration and winter, from tidal flats to sewage ponds to flooded fields. They are able to use wetlands with taller vegetation than other shorebirds can use, owing to their larger size. In summer, they breed throughout the boreal zone in boggy sloughs with small wooded islands and coniferous forests with wet clearings"
    ],
    "Willet": [
        "shape: Willets are large, stocky shorebirds with long legs and thick, straight bills considerably longer than the head. Their wings are broader and rounder than those of many shorebirds and the tail is short and squared off at the base",
        "size: A large shorebird with a pigeon-sized body on long legs crow-sized",
        "color: Willets are gray or brown birds that, when flying, display a striking white and black stripe along each wing. In summer, Willets are mottled gray, brown, and black; in winter they are a more consistent plain gray. The legs are bluish gray",
        "habitat: In winter, Willets feed on beaches and rocky coasts, as well as mudflats and marshes. During breeding season the western population moves far inland to nest in grasslands and prairies near freshwater. Eastern Willets breed in coastal saltmarshes and on barrier beaches and islands"
    ],
    "Lesser Yellowlegs": [
        "shape: A slender and elegant, medium-sized shorebirds with long legs and a long neck. The bill is straight and thin, only slightly longer than the bird's head (shorter and straighter than Greater Yellowlegs' bill)",
        "size: Larger than a Dunlin, smaller than a Greater Yellowlegs between robin and crow",
        "color: Breeding Lesser Yellowlegs are grayish brown birds with vivid yellow legs. They have fine, gray streaking across the head and neck, a white eyering, and white spots on the back and wings. Nonbreeding birds are more subdued gray-brown with less streaking and spotting. Bill is entirely dark",
        "habitat: Wetland habitats ranging from tidal flats to sewage ponds to flooded fields; often in the company of other shorebird species. Breeds in open forests and meadows interspersed with marshes and bogs"
    ],
    "Whimbrel": [
        "shape: A robust, large shorebird with a very long, curved bill and relatively long neck and legs. The wings are long and pointed; the tail is short",
        "size: Larger than a Willet, smaller than a Long-billed Curlew crow-sized",
        "color: Mostly brownish above, with pale feather edges, tan below, with neat dark stippling. The crown is dark brown with a pale central stripe, and most show a narrow dark eyeline",
        "habitat: Arctic tundra during the nesting season; saltmarshes, mudflats, beaches, small islands during migration and winter. They are sometimes found inland after being grounded by storms, taking refuge in farm fields, airports, lakeshores, or other open environments"
    ],
    "Long-billed Curlew": [
        "shape: Large, long-legged shorebird with a very long, thin curved bill. It has a heavy football-shaped body, a long neck, and a small round head",
        "size: Larger than a Whimbrel, smaller than a Great Egret crow-sized",
        "color: Speckled and barred in browns above with a pale cinnamon wash throughout and a plain cinnamon belly. The head and neck are pale with faint streaks and the lower bill is pink at the base. In flight, the upper and lower wings are strongly cinnamon",
        "habitat: Breeds in areas with sparse, short grasses, including shortgrass and mixed-grass prairies as well as agricultural fields. Outside of the breeding season, found in wetlands, tidal estuaries, mudflats, flooded fields less than 6 inches deep, and beaches"
    ],
    "Marbled Godwit": [
        "shape: Large, long-legged shorebird with an extremely long, slightly upturned bill. A small round head sits atop a thin neck. In flight its legs stick out beyond the tail",
        "size: Larger than a Willet, smaller than a Long-billed Curlew crow-sized",
        "color: Barred above and below in brown, white, and cinnamon during the breeding season. They look similar during the nonbreeding season, but have unbarred cinnamon-washed underparts. In flight, note the cinnamon underwings year-round. The bill is bicolored: black at the tip and orange at the base during breeding or pink during the nonbreeding season",
        "habitat: Breeds in shortgrass prairies near wetlands. During migration and on the wintering grounds, found on mudflats, salt ponds, beaches, estuaries, and wetlands"
    ],
    "Ruddy Turnstone": [
        "shape: The Ruddy Turnstone is a short, stocky, and oval-shaped shorebird. They have a stout and slightly upturned bill",
        "size: Larger than a Spotted Sandpiper, smaller than a Willet robin-sized",
        "color: Breeding males have unique black-and-white markings on the head and throat and a chestnut and black variegated (calico catlike) pattern on the back. Breeding females are paler than males. Nonbreeding adults have brown ghosting of the breeding plumage pattern. Juveniles look similar to nonbreeding birds, but have rusty edges to the feathers. All Ruddy Turnstones have orange legs, but they are brighter during the breeding season. In flight, Ruddy Turnstones show a unique color pattern: white stripe down the back, black tail stripe, white rump, and white stripe down the wings",
        "habitat: Ruddy Turnstones breed in the tundra of northern North America. But many nonbreeding birds also hang around the coastal shores in the lower 48 even in the summer. During migration they use freshwater shorelines, mudflats, rocky shorelines, and sandy beaches. On the wintering grounds they occur along coastal areas with mudflats, sandy beaches, and rocky shores"
    ],
    "Black Turnstone": [
        "shape: A small, stout shorebird with a short neck, a short, slightly upturned bill, and rather short legs",
        "size: Larger than a Sanderling, smaller than a Wandering Tattler robin-sized",
        "color: A dark blackish-brown bird with a neat white belly and a bold black-and-white pattern in flight. Breeding adults have a white spot next to the bill and white breast speckling. Nonbreeding adults are similar but with less white (mostly limited to wings, tail, and belly). Juveniles are similar but more brownish than blackish. The striking flight pattern features two white stripes on each wing, a white back stripe, and a mostly white tail with a thick black band near the tip",
        "habitat: Nests in coastal sedge meadows in the arctic, often on little islands in ponds or rivers near the coast. Outside breeding season, forages along rocky Pacific coastlines (including jetties and breakwaters) and adjacent beaches or flats"
    ],
    "Surfbird": [
        "shape: A stout shorebird with a short, thick bill, short neck, short tail, and short, thick legs",
        "size: Larger than a Black Turnstone, smaller than a Black-bellied Plover robin-sized",
        "color: Breeding adults are stippled light, dark, and rufous above. The head and underparts are white, neatly marked with black streaks and arrowhead-shaped markings on the breast and belly. Nonbreeding plumage is muddy brownish gray with whitish chin, white belly with some streaking. The tail is white at the base, with a bold black tip. Legs are greenish yellow; base of bill is yellow. Juveniles are paler than nonbreeding adults, with feathers above showing narrow pale edges",
        "habitat: Nests in high slopes of rocky alpine tundra in interior Alaska. Winters along Pacific coast in rocky environments, sometimes foraging also on mudflats or beaches"
    ],
    "Semipalmated Sandpiper": [
        "shape: A very small, plump shorebird with a thin, straight, tubular bill. When folded, the wings are about the same length as the tail. The bill usually does not droop or turn downwards at the tip",
        "size: Smaller than a Dunlin, slightly larger than a Least Sandpiper between sparrow and robin",
        "color: Breeding adults are dappled in brown, black, gold, and rufous above, with pale underparts and dark legs. The head, nape, and breast are stippled or streaked with brown, but the flanks are white. Nonbreeding adults are much plainer, mousy grayish brown above, pale below, with weak supercilium (pale line over eye). Juveniles are similar to nonbreeding adult but the upperparts show a neat, scaly pattern",
        "habitat: Breeds on arctic tundra; forages in mudflats, wet and plowed agricultural fields, river margins, sewage ponds, and estuaries"
    ],
    "Western Sandpiper": [
        "shape: A small, portly shorebird with a long, thin bill with a slightly curved tip. It has long, pointed wings, a short tail, and medium-length legs for its size. Females tend to be larger and have longer bills than males",
        "size: Larger than a Least Sandpiper, smaller than a Dunlin between sparrow and robin",
        "color: Breeding adults have black, brown, rufous, and gold upperparts, with white underparts marked with extensive dark arrow-shaped streaks. They have a rufous crown and ear patch, and dark legs and bill. Nonbreeding adults are pale gray above, whitish below. Juveniles are similar to nonbreeding adults but the upperparts are more vivid in the wings, showing gold and rufous edges to feathers",
        "habitat: Nests in tundra. Forages in mudflats, wet and plowed agricultural fields, river margins, lakeshores, sewage ponds, estuaries, lagoons"
    ],
    "Least Sandpiper": [
        "shape: Least Sandpipers are tiny sandpipers with round bodies and relatively short, pointed wings. They have thin-tipped, slightly decurved bills and slim, medium-length legs",
        "size: Tiny (our smallest shorebird); Slightly larger than a sparrow, slightly smaller than a Semipalmated Sandpiper between sparrow and robin",
        "color: They have brown upperparts and white underparts. Their bills are black, and their legs are yellowish-green (this can be obscured by mud at times). Juveniles have crisp plumage that is rustier than that of adults. In flight, Least Sandpipers show whitish rumps bisected by a longitudinal black line",
        "habitat: Least Sandpipers feed on mudflats and the edges of water bodies. They tend to favor muddier shores and estuaries than other sandpipers, and are not common on ocean beaches. They breed in wet tundra and interrupted boreal forest across much of northern North America"
    ],
    "Short-billed Dowitcher": [
        "shape: A chunky, medium-sized shorebird with a long, straight bill and moderately long legs",
        "size: Larger than a Lesser Yellowlegs, smaller than a Greater Yellowlegs robin-sized",
        "color: Breeding adults have brown, black, and gold upperparts and are pale orange with darker speckling below (colors limited to the neck and upper breast in eastern subspecies). Nonbreeding adults are quite plain, grayish brown above and pale below, with some speckling on breast and sides. Juveniles in fresh plumage have orange breast and dark feathers with striking gold edges above",
        "habitat: Breeds in boreal wetlands near treeline. Winters largely in saltwater estuaries and lagoons. Migrating birds utilize almost any freshwater or saltwater wetland with shallow water, as well as flooded agricultural fields and sewage ponds"
    ],
    "Wilson's Snipe": [
        "shape: Wilson’s Snipes are medium-sized, pudgy shorebirds with short, stocky legs. The bill is straight and very long (several times the length of the head). The head is rounded and the tail is short",
        "size: About the size of a Killdeer, but heavier-bodied and less lanky robin-sized",
        "color: These birds are intricately patterned in buff and brown stripes and bars. The dark head has prominent buffy to whitish stripes. The dark back has three long buffy streaks, one running down each edge, one down the center. The buff chest is streaked and spotted with brown; the sides are heavily barred with black. In flight, the wings are dark above and below",
        "habitat: Wilson’s Snipe live in muddy pond edges, damp fields, and other wet, open habitats. Typically these contain thick, low vegetation into which these well-camouflaged birds can disappear"
    ],
    "American Woodcock": [
        "shape: American Woodcocks are plump, short-legged shorebirds with very long, straight bills. Their large heads, short necks, and short tails give them a bulbous look on the ground and in flight. The wings are broad and rounded compared to most other shorebirds",
        "size: Bigger and plumper than a Killdeer; slightly smaller than a Rock Pigeon robin-sized",
        "color: They are well camouflaged in light brown, black, buff, and gray-brown tones. The face is buffy, the crown blackish. They are light gray across the neck and back, with dark-and-light patterned shoulders and brown wings. The underparts are buffy to almost orange",
        "habitat: Look for American Woodcock in forests, forest edges, old fields, and wet meadows of eastern North America"
    ],
    "Rock Pigeon": [
        "shape: Larger and plumper than a Mourning Dove, Rock Pigeons are tubby birds with small heads and short legs. Their wings are broad but pointed wings and the tail is wide and rounded",
        "size: Larger than a Mourning Dove; smaller than a crow between robin and crow",
        "color: Variable in color, but most birds are bluish gray with two black bands on the wing and a black tip to the tail. Most birds have iridescent throat feathers. Wing patterns may include two bars, dark spots, or can be plain. The tail is usually dark tipped",
        "habitat: Pigeons are familiar birds of cities and towns. You'll also see them around farmland and fields, as well as in their archetypal habitat, rocky cliffs"
    ],
    "Band-tailed Pigeon": [
        "shape: Band-tailed Pigeons are large, stocky pigeons with small heads, long, rounded tails, and thick-based, pointed wings",
        "size: Slightly larger than a Rock Pigeon; smaller than an American Crow crow-sized",
        "color: They are soft blue-gray above and purplish-gray below, with a white crescent on the back of the neck. The upper half of the tail is gray, fading to a pale gray band at the tip. The wings are unmarked pale gray with dark wingtips noticeable in flight. The bill and feet are yellow",
        "habitat: Band-tailed Pigeons live in mature coniferous forests in Western mountains, damp forests of the West Coast, and conifer-oak woodlands. They also visit forested suburban parks, fields, orchards, and backyard birdfeeders to forage"
    ],
    "Eurasian Collared-Dove": [
        "shape: Eurasian Collared-Doves have plump bodies, small heads, and long tails. They’re larger than Mourning Doves but slimmer and longer-tailed than a Rock Pigeon. The wings are broad and slightly rounded. The broad tail is squared off at the tip, rather than pointed like a Mourning Dove’s",
        "size: A large dove, larger and heftier than a Mourning Dove but smaller than a Rock Pigeon between robin and crow",
        "color: Eurasian Collared-Doves are chalky light brown to gray-buff birds with broad white patches in the tail. The bird’s collar is a narrow black crescent around the nape of the neck. In flight and when perched, the wingtips are darker than the rest of the wing",
        "habitat: Eurasian Collared-Doves live in urban and suburban areas throughout much of the U.S. except the Northeast. In rural settings look for them on farms and in livestock yards where grain is available. In cooler months, flocks may roost together in large trees"
    ],
    "White-winged Dove": [
        "shape: White-winged Doves are plump, square-tailed doves with relatively long, thin bills and small heads",
        "size: Smaller than a Eurasian Collared-Dove; larger than a Mourning Dove robin-sized",
        "color: White-winged Doves are brown overall, with a dark line on the cheek. A white stripe at the edge of the folded wing becomes, as the bird takes flight, a bright flash in the middle of a dark wing. The tail is tipped in white and set off with black stripes from the gray underside. Their faces are ornately marked with a black streak on the cheek, and blue skin around the red eyes",
        "habitat: Look for White-winged Doves in desert habitat in the Southwest and in cities and suburbs of Texas and the coastal Southeast. They often visit backyards, especially those with birdbaths and feeders. Individuals wander widely and irregularly across the continent after the breeding season ends"
    ],
    "Mourning Dove": [
        "shape: Plump-bodied and long-tailed, with short legs, small bill, and a head that looks particularly small in comparison to the body. The long, pointed tail is unique among North American doves",
        "size: Smaller, slenderer than Rock Pigeon robin-sized",
        "color: Mourning Doves often match their open-country surroundings. They’re delicate brown to buffy-tan overall, with black spots on the wings and black-bordered white tips to the tail feathers",
        "habitat: You can see Mourning Doves nearly anywhere except the deep woods. Look for them in fields or patches of bare ground, or on overhead perches like telephone wires"
    ],
    "Inca Dove": [
        "shape: The Inca Dove is a small and slender dove with a long, square-tipped tail and small head. It has a thin and slightly drooping bill and short legs",
        "size: Slightly larger than a Common Ground-Dove, smaller than a Mourning Dove between sparrow and robin",
        "color: The Inca Dove is the color of desert sands. Its tan feathers are edged in dark brown creating a scaly pattern over the entire body. Its underparts and face are paler than its back. In flight, the underwings flash a rich chestnut and the outer tail feathers flash white",
        "habitat: Inca Doves frequent areas near people including cities, towns, parks, and farms. In these areas, they use open areas with sparse shrub cover and scattered trees such as palo verde and oak"
    ],
    "Common Ground-Dove": [
        "shape: Common Ground-Doves are tiny doves with short, round wings, short tails, and short, thin bills. They are stocky, with short legs, and they shuffle as they walk",
        "size: About the same size as a House Sparrow; slightly smaller than an Inca Dove between sparrow and robin",
        "color: Common Ground-Doves are sandy brown overall, with large, dark spots on the wing coverts. In flight the wings show rich rufous patches. Males have a pinkish wash on the head, neck, and chest, and bluish crowns; females are duller. Both sexes have fine, dark scaling on the neck and chest, and pinkish-red bills with a dark tip",
        "habitat: Common Ground-Doves live in open or shrubby areas with tall grasses or groves of trees, including riparian corridors and open savannas. They also live in towns and suburbs, where they frequent yards and hedges"
    ],
    "Monk Parakeet": [
        "shape: A fairly small parakeet with a long, pointed tail and fairly narrow, pointed wings. Like other parakeets, they have large heads and large, hooked bills",
        "size: Larger than a European Starling; smaller than a Rock Pigeon between robin and crow",
        "color: Monk Parakeets are green with a gray face and breast. The bill is pale pink. In flight, the primary and outer secondary flight feathers are blue",
        "habitat: In their native South America, Monk Parakeets live in dry, open habitats. In the U.S. they live in urban and suburban settings, where they feed on ornamental fruit trees and often nest on human structures such as power transformers. They are established in many U.S. cities including San Diego, Phoenix, Dallas, San Antonio, Houston, New Orleans, Chicago, New York, Providence, Miami, and St. Petersburg"
    ],
    "Yellow-billed Cuckoo": [
        "shape: Yellow-billed Cuckoos are fairly large, long, and slim birds. The bill is almost as long as the head, thick and slightly downcurved. They have a flat head, thin body, and very long tail. Wings appear pointed and swept back in flight",
        "size: Longer, but slighter, than American Kestrel; about the size of a Blue Jay or Western Scrub-Jay between robin and crow",
        "color: Yellow-billed Cuckoos are warm brown above and clean whitish below. They have a blackish mask across the face and a yellow eyering. In flight, the outer part of the wings flash rufous. From below, the tail has wide white bands and narrower black ones. The bill is mostly yellow",
        "habitat: They live mainly among the canopies of deciduous trees; look for them in woodland patches with gaps and clearings. In the West, this species is rare and restricted to the cottonwood-dominated forests that line larger rivers running through arid country"
    ],
    "Black-billed Cuckoo": [
        "shape: Cuckoos are slender, dove-sized birds with a longer slightly curved bill and a very long tail. When perched it often has a hunchbacked posture",
        "size: Larger than a Baltimore Oriole, smaller than an American Crow between robin and crow",
        "color: Black-billed Cuckoos are plain brown above without cinnamon tones and white below with a red ring around the eye and a black bill. From below, note the small white tips on the tail feathers",
        "habitat: Black-billed Cuckoos breed in dense woodlands and thickets with deciduous and evergreen trees, often near water. During migration they forage in thickets, woodlands, orchards, gardens, and scrublands. On the wintering grounds they also use thickets, woodlands, and scrub"
    ],
    "Greater Roadrunner": [
        "shape: Greater Roadrunners are large cuckoos with a distinctive shape: long legs, a very long, straight tail, and a long neck. The head has a short crest and the bill is long, heavy, and slightly downcurved",
        "size: Larger than a Rock Pigeon; about the size (but more slender than) a Common Raven crow-sized",
        "color: They are tan or brown with extensive blackish streaking on the upperparts and chest. The crown is black with small, pale spots, and they have a patch of bare, blue skin behind the eye. The wings are dark with white highlights",
        "habitat: Greater Roadrunners are characteristic birds of the hot, shrubby expanses of the Desert Southwest. They aren’t restricted to deserts, though: look for them in open country with patches of shrubs or small trees almost as far east as the Mississippi River"
    ],
    "Barn Owl": [
        "shape: These medium-sized owls have long, rounded wings and short tails, which combine with a buoyant, loping flight to give them a distinctive flight style. The legs are long and the head is smoothly rounded, without ear tufts",
        "size: Larger than a screech-owl, but smaller than a Great Horned Owl crow-sized",
        "color: Barn Owls are pale overall with dark eyes. They have a mix of buff and gray on the head, back, and upperwings, and are white on the face, body, and underwings. When seen at night they can appear all white",
        "habitat: Barn Owls require large areas of open land over which to hunt. This can either be marsh, grasslands, or mixed agricultural fields. For nesting and roosting, they prefer quiet cavities, either in trees or man-made structures such as barns or silos"
    ],
    "Western Screech-Owl": [
        "shape: Western Screech-Owls are small owls with stocky bodies. They have somewhat square heads, almost no neck, and conspicuous ear tufts. The tail is short",
        "size: robin-sized",
        "color: They are superbly camouflaged birds with a base color that can be grayish, brownish, or reddish-brown (rufous). The upperparts are flecked with white; the breast and belly are pale with dark, spidery streaks. The face is pale, outlined with dark arcs. The eyes are yellow",
        "habitat: They live in forests (particularly among deciduous trees) at elevations up to about 6,000 feet. They are fairly tolerant of people and may be found in suburbs or parks, or attracted to forested backyards with a nest box"
    ],
    "Eastern Screech-Owl": [
        "shape: The Eastern Screech-Owl is a short, stocky bird, with a large head and almost no neck. Its wings are rounded; its tail is short and square. Pointed ear tufts are often raised, lending its head a distinctive silhouette",
        "size: A small owl, slightly larger and considerably bulkier than a European Starling robin-sized",
        "color: Eastern Screech-Owls can be either mostly gray or mostly reddish-brown (rufous). Whatever the overall color, they are patterned with complex bands and spots that give the bird excellent camouflage against tree bark. Eyes are yellow",
        "habitat: Trees define the Eastern Screech-Owl’s habitat. This owl is fairly common in most types of woods (evergreen or deciduous; urban or rural), particularly near water. It shuns treeless expanses of mountains or plains"
    ],
    "Great Horned Owl": [
        "shape: These are large, thick-bodied owls with two prominent feathered tufts on the head. The wings are broad and rounded. In flight, the rounded head and short bill combine to create a blunt-headed silhouette",
        "size: Slightly larger than a Red-tailed Hawk between crow and goose",
        "color: Great Horned Owls are mottled gray-brown, with reddish brown faces and a neat white patch on the throat. Their overall color tone varies regionally from sooty to pale",
        "habitat: Look for this widespread owl in woods, particularly young woods interspersed with fields or other open areas. The broad range of habitats they use includes deciduous and evergreen forests, swamps, desert, tundra edges, and tropical rainforest, as well as cities, orchards, suburbs, and parks"
    ],
    "Snowy Owl": [
        "shape: Snowy Owls are very large owls with smoothly rounded heads that rarely show ear tufts. The body is bulky, with dense feathering on the legs that makes the bird look wide at the base when sitting on the ground",
        "size: About the size of a Great Horned Owl crow-sized",
        "color: Snowy Owls are white birds with varying amounts of black or brown markings on the body and wings. On females this can be quite dense, giving the bird a salt-and-pepper look. Males tend to be paler and become whiter as they age. The eyes are yellow",
        "habitat: In winter, look for Snowy Owls along shorelines of lakes and the ocean, as well as on agricultural fields and airport lands. Snowy Owls breed in the treeless arctic tundra"
    ],
    "Northern Pygmy-Owl": [
        "shape: The Northern Pygmy-Owl is small and compact, with a large, circular head that lacks ear tufts. The tail is long and the wings are fairly short and rounded",
        "size: Smaller but plumper than a Mountain Bluebird; larger than an Elf Owl robin-sized",
        "color: Northern Pygmy-Owls are brown with fine white speckles on the head and white spots on the back. The back of the neck features two dark patches that look like eyespots. The eyes and bill are yellow",
        "habitat: They occupy montane forests of western North America, typically among conifers. Look for them in towns, especially during winter when they move to lower elevations"
    ],
    "Burrowing Owl": [
        "shape: Burrowing Owls are small owls with long legs and short tails. The head is rounded and does not have ear tufts",
        "size: About the same length/height as an American Robin but much bulkier; slightly smaller than a Western Screech-Owl between robin and crow",
        "color: Adults are brown birds mottled with sandy-pale spots on the upperparts. The breast is spotted, grading to dark brown bars on the belly. They have a bold white throat and eyebrows, and yellow eyes. The brown juveniles are less mottled than adults, with buffy-yellow underparts and wing patch",
        "habitat: Burrowing Owls live in open habitats with sparse vegetation such as prairie, pastures, desert or shrubsteppe, and airports. In parts of their range they are closely associated with prairie dogs and ground squirrels, whose burrows they use for nests"
    ],
    "Barred Owl": [
        "shape: Barred Owls are large, stocky owls with rounded heads, no ear tufts, and medium length, rounded tails",
        "size: Smaller than a Great Horned Owl; larger than a Barn Owl between crow and goose",
        "color: Barred Owls are mottled brown and white overall, with dark brown, almost black, eyes. The underparts are mostly marked with vertical brown bars on a white background, while the upper breast is crossed with horizontal brown bars. The wings and tail are barred brown and white",
        "habitat: Barred Owls live in large, mature forests made up of both deciduous trees and evergreens, often near water. They nest in tree cavities. In the Northwest, Barred Owls have moved into old-growth coniferous forest, where they compete with the threatened Spotted Owl. In 2021, a disjunct population of Barred Owls in Mexico, long considered to be a subspecies of Barred Owl, was split and named Cinereous Owl (Strix sartorii)"
    ],
    "Northern Saw-whet Owl": [
        "shape: These are very small owls with large, rounded heads that lack ear tufts",
        "size: Slightly heavier (but more compact) than a Hairy Woodpecker; smaller than an Eastern Screech-Owl robin-sized",
        "color: Northern Saw-whet Owls are mottled brown birds with a whitish facial disk and white-spotted head. Their eyes are yellow. Juveniles are dark brown with creamy yellow breast and belly",
        "habitat: Northern Saw-whet Owls are forest birds. They breed in extensive forests across northern North America, also sometimes using more open habitats such as the shrubsteppe of the West as long as there are nest sites available. They winter in dense forests across the central and southern U.S"
    ],
    "Common Nighthawk": [
        "shape: Common Nighthawks are medium-sized, slender birds with very long, pointed wings and medium-long tails. Only the small tip of the bill is usually visible, and this combined with the large eye and short neck gives the bird a big-headed look",
        "size: Slightly smaller than an American Kestrel; larger than a Purple Martin between robin and crow",
        "color: Common Nighthawks are well camouflaged in gray, white, buff, and black. The long, dark wings have a striking white blaze about two-thirds of the way out to the tip. In flight, a V-shaped white throat patch contrasts with the rest of the bird’s mottled plumage",
        "habitat: Common Nighthawks are most visible when they forage on the wing over open areas near woods or wetlands. They nest on the ground in open areas such as gravel bars, forest clearings, coastal sand dunes, or sparsely vegetated grasslands"
    ],
    "Chimney Swift": [
        "shape: Chimney Swifts are very small birds with slender bodies and very long, narrow, curved wings. They have round heads, short necks, and short, tapered tails. The wide bill is so short that it is hard to see",
        "size: About the same size as a Cliff Swallow between sparrow and robin",
        "color: They are dark gray-brown all over, slightly paler on the throat. At distance and when backlit against they sky they can appear to be all black",
        "habitat: Chimney Swifts nest in chimneys and on other vertical surfaces in dim, enclosed areas, including air vents, wells, hollow trees, and caves. They forage over urban and suburban areas, rivers, lakes, forests, and fields"
    ],
    "Vaux's Swift": [
        "shape: A small-bodied bird with long, very narrow swept-back wings that curve along both leading and trailing edges",
        "size: Larger than an Anna’s Hummingbird, smaller than a Barn Swallow between sparrow and robin",
        "color: Brownish overall, with throat, chest, and uppertail a slightly paler brownish gray",
        "habitat: Nests and roost in large hollow trees in mature and old-growth coniferous and mixed forests. Forages over forest, rivers, lakes, fields, and gaps in forest, such as burned areas. Flocks preparing for migration roost in trees and also in chimneys, including in urban areas"
    ],
    "White-throated Swift": [
        "shape: A fairly large swift with a long, slim body and very long, narrow wings that curve like a scimitar. The overall slim outline can make it appear small, especially at a distance",
        "size: Larger than a Vaux’s Swift, smaller and slenderer than a Purple Martin between sparrow and robin",
        "color: A blackish brown bird with a white throat and a white strip down the center of the breast and belly. Upperparts are blackish with white flanks and a white trailing edge to the secondaries (the inner part of the wing)",
        "habitat: Nests in natural crevices on rocky cliffs or canyon walls, from sea level to high mountain peaks. Forages over virtually any terrestrial habitat that features small aerial insects. Sometimes nests in buildings, bridges, and overpasses, sometimes in cities"
    ],
    "Belted Kingfisher": [
        "shape: Belted Kingfishers are stocky, large-headed birds with a shaggy crest on the top and back of the head and a straight, thick, pointed bill. Their legs are short and their tails are medium length and square-tipped",
        "size: Smaller than an American Crow; larger than a Hairy Woodpecker robin-sized",
        "color: These kingfishers are blue-gray above with fine, white spotting on the wings and tail. The underparts are white with a broad, blue breast band. Females also have a broad rusty band on their bellies. Juveniles show irregular rusty spotting in the breast band",
        "habitat: Kingfishers live near streams, rivers, ponds, lakes, and estuaries. They nest in burrows that they dig into soft earthen banks, usually adjacent to or directly over water. Kingfishers spend winters in areas where the water doesn’t freeze so that they have continual access to their aquatic foods"
    ],
    "Acorn Woodpecker": [
        "shape: Acorn Woodpeckers are medium-sized woodpeckers with straight, spike-like bills and stiff, wedge-shaped tails used for support as the birds cling to tree trunks",
        "size: Smaller than a Northern Flicker; larger than a Downy Woodpecker robin-sized",
        "color: These striking birds are mostly black above with a red cap, creamy white face, and black patch around the bill. In flight, they show three patches of white: one in each wing and one on the rump. Females have less red on the crown than males",
        "habitat: These woodpeckers live in oak and mixed oak-evergreen forests on slopes and mountains in the Southwest and West Coast. They’re tolerant of humans, and you can find them in towns where there are acorns and suitable places to store them"
    ],
    "Gila Woodpecker": [
        "shape: A medium-sized woodpecker with a long, pointed bill",
        "size: Larger than a Ladder-backed Woodpecker, smaller than a Gilded Flicker between robin and crow",
        "color: Gila Woodpeckers are grayish brown birds with brilliant black-and-white barring on the wings, back, and tail. In flight, the outer wings are black with a crescent-shaped white patch at the base of the primary feathers. Males have a red patch in the center of the crown",
        "habitat: Stands of saguaro cactus, desert scrub, arroyos and washes, and small towns"
    ],
    "Golden-fronted Woodpecker": [
        "shape: A robust, medium-sized woodpecker with a long, pointed bill",
        "size: Larger than a Downy Woodpecker, smaller than a Northern Flicker between robin and crow",
        "color: Golden-fronted Woodpeckers have grayish brown heads and bodies, golden napes and nasal tufts, black-and-white barred wings, and black tails. Males have a red central crown. The yellow in the lower belly can be difficult to see",
        "habitat: Brushlands and dry woodlands, especially with mesquite, oaks, and cottonwoods; fairly common in well-wooded suburbs and urban parks"
    ],
    "Red-bellied Woodpecker": [
        "shape: A sleek, round-headed woodpecker, about the same size as a Hairy Woodpecker but without the blocky outlines",
        "size: Same size as Hairy Woodpecker; three-quarters the size of a Northern Flicker between robin and crow",
        "color: Often appears pale overall, even the boldly black-and-white striped back, with flashing red cap and nape. Look for white patches near the wingtips as this bird flies",
        "habitat: Red-bellied Woodpeckers are common in many Eastern woodlands and forests, from old stands of oak and hickory to young hardwoods and pines. They will also often venture from forests to appear at backyard feeders"
    ],
    "Yellow-bellied Sapsucker": [
        "shape: Yellow-bellied Sapsuckers are fairly small woodpeckers with stout, straight bills. The long wings extend about halfway to the tip of the stiff, pointed tail at rest. Often, sapsuckers hold their crown feathers up to form a peak at the back of the head",
        "size: Larger than a Downy Woodpecker; slightly smaller than a Hairy Woodpecker robin-sized",
        "color: Yellow-bellied Sapsuckers are mostly black and white with boldly patterned faces. Both sexes have red foreheads, and males also have red throats. Look for a long white stripe along the folded wing. Bold black-and-white stripes curve from the face toward a black chest shield and white or yellowish underparts",
        "habitat: Yellow-bellied Sapsuckers live in both hardwood and conifer forests up to about 6,500 feet elevation. They often nest in groves of small trees such as aspens, and spend winters in open woodlands. Occasionally, sapsuckers visit bird feeders for suet"
    ],
    "Red-naped Sapsucker": [
        "shape: The Red-naped Sapsucker is a medium-sized woodpecker with a slight peak to the back of the head. It clings vertically to trees giving it an elongated appearance. The bill is stout and sharply pointed",
        "size: Larger than a Downy Woodpecker, smaller than a Northern Flicker robin-sized",
        "color: Red-naped Sapsuckers are black and white overall with a red cap, nape, and throat. They have a long white bar on the folded wing. A black stripe through the eye is bordered by white stripes. The belly is mottled black and white, with a dingy or yellowish cast. Female Red-naped Sapsuckers have a white patch on the chin while males have entirely red chins. Juveniles have a brown cap and an overall brown wash on their belly and head",
        "habitat: Red-naped Sapsuckers breed in mixed forests of willow, aspen, birch, ponderosa pine, juniper, or Douglas-fir. They tend to avoid oak or pine-oak forests during the breeding season, but use them during migration and winter, along with orchards and woodlands near streams"
    ],
    "Red-breasted Sapsucker": [
        "shape: A medium-sized woodpecker with a long body, large, rounded head, and a chisel-like bill",
        "size: A medium-sized woodpecker. Larger than a Downy Woodpecker, smaller than a Northern Flicker robin-sized",
        "color: Both male and female Red-breasted Sapsuckers have a red head and breast with a white spot between the eye and the bill. The back is mottled black and white and the wings are black with a large vertical white patch. Underparts are mostly white, with dark streaks on the side and a yellowish wash on the belly",
        "habitat: Red-breasted Sapsuckers breed in coniferous forests, often with some deciduous trees, as well as orchards and second-growth woodlands. In the winter, they move to wooded areas, including parks and suburbs, in coastal areas and at lower elevations"
    ],
    "Ladder-backed Woodpecker": [
        "shape: Ladder-backed Woodpeckers are small woodpeckers with a square head, short neck, and stiff tail that they lean against for support. The bill is rather small but straight and chisel-like",
        "size: Larger than a Downy Woodpecker, smaller than a Hairy Woodpecker between sparrow and robin",
        "color: Ladder-backed Woodpeckers are black-and-white above, with neat stripes like ladder rungs on the back, and a more checkered pattern on the wings. The underparts are buffy white or grayish, stippled with black. The buffy white face is broken by black lines that extend from the bill and eye and join at the neck. Males have mostly red crowns; females have blackish crowns",
        "habitat: Ladder-backed Woodpeckers live in very dry habitats such as deserts, desert scrub, thorn forest, and pinyon-juniper woodlands"
    ],
    "Nuttall's Woodpecker": [
        "shape: The Nuttall's Woodpecker is a small woodpecker with a chisel-shaped bill. It has a small rounded head, a flat back, and an elongated appearance",
        "size: Slightly larger than a Downy Woodpecker, smaller than a Hairy Woodpecker between sparrow and robin",
        "color: Nuttall's Woodpeckers are black-and-white striped birds. Males have a red patch on the back of their heads and both sexes have 2 narrow white stripes across their cheeks. The back has narrow black-and-white horizontal bars with a solid black patch on the upper back. The underparts are whitish with spotting and barring on the flanks. Juveniles have more grayish or buffy underparts than adults, and juveniles of both sexes have some red on the crown",
        "habitat: Nuttall's Woodpeckers live in oak woodlands year-round. They also use wooded suburban areas and woodlands near streams with cottonwoods, willows, and sycamores"
    ],
    "Downy Woodpecker": [
        "shape: Downy Woodpeckers are small versions of the classic woodpecker body plan. They have a straight, chisel-like bill, blocky head, wide shoulders, and straight-backed posture as they lean away from tree limbs and onto their tail feathers. The bill tends to look smaller for the bird’s size than in other woodpeckers",
        "size: About two-thirds the size of a Hairy Woodpecker between sparrow and robin",
        "color: Downy Woodpeckers give a checkered black-and-white impression. The black upperparts are checked with white on the wings, the head is boldly striped, and the back has a broad white stripe down the center. Males have a small red patch on the back of the head. The outer tail feathers are typically white with a few black spots",
        "habitat: You’ll find Downy Woodpeckers in open woodlands, particularly among deciduous trees, and brushy or weedy edges. They’re also at home in orchards, city parks, backyards and vacant lots"
    ],
    "Hairy Woodpecker": [
        "shape: A medium-sized woodpecker with a fairly square head, a long, straight, chisel-like bill, and stiff, long tail feathers to lean against on tree trunks. The bill is nearly the same length as the head",
        "size: About a third again larger than a Downy Woodpecker robin-sized",
        "color: Hairy Woodpeckers are contrastingly black and white. The black wings are checkered with white; the head has two white stripes (and, in males, a flash of red toward the back of the head). A large white patch runs down the center of the black back",
        "habitat: Hairy Woodpeckers are birds of mature forests across the continent. They’re also found in woodlots, suburbs, parks, and cemeteries, as well as forest edges, open woodlands of oak and pine, recently burned forests, and stands infested by bark beetles"
    ],
    "Pileated Woodpecker": [
        "shape: The Pileated Woodpecker is a very large woodpecker with a long neck and a triangular crest that sweeps off the back of the head. The bill is long and chisel-like, about the length of the head. In flight, the wings are broad and the bird can seem crowlike",
        "size: Nearly the size of an American Crow crow-sized",
        "color: Pileated Woodpeckers are mostly black with white stripes on the face and neck and a flaming-red crest. Males have a red stripe on the cheek. In flight, the bird reveals extensive white underwings and small white crescents on the upper side, at the bases of the primaries",
        "habitat: Pileated Woodpeckers are forest birds that require large, standing dead trees and downed wood. Forests can be evergreen, deciduous, or mixed and are often old, particularly in the West. In the East they live in young forests as well and may even be seen in partially wooded suburbs and backyards"
    ],
    "Black-bellied Whistling-Duck": [
        "shape: The Black-bellied Whistling-Duck is a large, gooselike duck with a long neck, long legs, and short tail. In flight, look for their broad wings, long neck, and hunched back",
        "size: About the size of a Cattle Egret; slightly larger than a Fulvous Whistling-Duck between crow and goose",
        "color: Black-bellied Whistling-Ducks are dark overall: a chestnut breast and black belly are set off by a bright-pink bill and legs, grayish face, and broad white wing stripe, also visible in flight. Immatures are duller than adults, with a dark bill, pale breast, and mottled black belly",
        "habitat: Black-bellied Whistling-Ducks roam edges of shallow ponds, golf courses, city parks, and schoolyards. They also frequent agricultural fields, particularly flooded rice fields. They seem to readily adopt human-altered habitats, and this has helped them move north into the southern U.S. in recent decades"
    ],
    "Ross's Goose": [
        "shape: A small goose with stocky body, a rather short neck, and a stubby bill that is neatly triangular in shape",
        "size: Slightly larger than a Mallard, smaller than a Canada Goose goose-sized or larger",
        "color: Adults are white with black wingtips. The bill is pink and lacks the broad black edges of the bill (known as a “grinning patch”) that Snow Geese show. Rare “blue” morphs have mostly dark bodies and wings, with a white face. Immatures are white tinged with gray and have a dark bill",
        "habitat: Ross’s Geese nest in low arctic tundra, especially on islands; they forage in wetlands, meadows, and agricultural fields. At night, wintering birds roost with other geese on lakes, reservoirs, or wetlands"
    ],
    "Northwestern Crow": [
        "shape: Medium-sized, sturdy body with rounded wings and a strong, thick bill.",
        "size: Medium-sized crow with an average length of about 16-18 inches (41-46 cm).",
        "color: Black feathers with a glossy sheen and a dark bill.",
        "habitat: Urban and suburban areas, including parks and cityscapes."
    ],
    "Fish Crow": [
        "shape: Fish Crows fit the standard crow shape: hefty, well-proportioned birds with heavy bills, sturdy legs, and broad wings. At rest, Fish Crows’ wings fall short of their medium-length, square tails",
        "size: Very slightly smaller than an American Crow crow-sized",
        "color: Fish Crows are all black. Immatures are less glossy and can become brownish as their feathers wear in their first year",
        "habitat: Fish Crows live along the coasts and inland along major freshwater rivers and lakes. You may find Fish Crows in a wide variety of habitats near water, often in towns and cities near parks, docks, and landfills. They share many habitats with American Crows"
    ],
    "Chihuahuan Raven": [
        "shape: A large-bodied, thick-necked bird with a heavy, straight bill. The wings are fairly long and often show “fingers” at the tips. The tail is long with a slight wedge or diamond shape",
        "size: Larger than an American Crow, smaller than a Common Raven crow-sized",
        "color: Sleek black overall, including bill, legs, and feet. The nape feathers have white bases, but these are usually not visible except when the birds display or during high winds",
        "habitat: Nests in deserts and grasslands with scattered trees and shrubs, as well as in shortgrass prairie. Occasionally uses pinyon-juniper hills and stream corridors with cottonwood or sycamore. Also winters in these habitats but also moves into areas with agriculture, landfills, and cattle operations"
    ],
    "Common Raven": [
        "shape: Not just large but massive, with a thick neck, shaggy throat feathers, and a Bowie knife of a beak. In flight, ravens have long, wedge-shaped tails. They're more slender than crows, with longer, narrower wings, and longer, thinner “fingers” at the wingtips",
        "size: About half again larger than an American Crow or Chihuahuan Raven crow-sized",
        "color: Common Ravens are entirely black, right down to the legs, eyes, and beak",
        "habitat: Common Ravens live in open and forest habitats across western and northern North America. This includes deciduous and evergreen forests up to treeline, as well as high desert, sea coast, sagebrush, tundra, and grasslands. They do well around people, particularly rural settlements but also some towns and cities"
    ],
    "Horned Lark": [
        "shape: Horned Larks are small, long-bodied songbirds that usually adopt a horizontal posture. They have short, thin bills, short necks, and rounded heads—the shape sometimes broken by two small “horns” of feathers sticking up toward the back of the head",
        "size: Larger than a Savannah Sparrow; smaller than an Eastern Meadowlark sparrow-sized or smaller",
        "color: Male Horned Larks are sandy to rusty brown above, with a black chest band, a curving black mask, and head stripes that extend to the back of the head (sometimes raised into tiny “horns”). The face and throat are either yellow or white (see Regional Differences). The underparts are white. Females have similar head and breast patterns but are less crisply defined",
        "habitat: The barer the ground, the more Horned Larks like it. Look for them in open country with very short or no vegetation, including bare agricultural fields. They breed in short grassland, short-stature sage shrubland, desert, and even alpine and arctic tundra"
    ],
    "Tree Swallow": [
        "shape: Tree Swallows are streamlined small songbirds with long, pointed wings and a short, squared or slightly notched tail. Their bills are very short and flat",
        "size: Smaller than a Purple Martin; slightly larger than a Bank Swallow sparrow-sized or smaller",
        "color: Adult males are blue-green above and white below with blackish flight feathers and a thin black eye mask; females are duller with more brown in their upperparts, and juveniles are completely brown above. Juveniles and some females can show a weak, blurry gray-brown breast band",
        "habitat: Tree Swallows breed in open habitats such as fields and wetlands, usually adjacent to water. They nest in artificial nest boxes as well as tree cavities. Foraging flocks are frequently seen over wetlands, water, and agricultural fields"
    ],
    "Violet-green Swallow": [
        "shape: Violet-green Swallows are small sleek birds with long pointed wings and slightly forked tails. Their wingtips extend beyond their short tail—especially noticeable when perched",
        "size: About the same size as a Bank Swallow, but smaller than a Barn Swallow sparrow-sized or smaller",
        "color: On first look, Violet-green Swallows appear dark above and crisp white below. In good light, the greenish-bronze back and iridescent violet rump come to life. All individuals have white bellies that wrap around to the upper side of the rump, creating \"saddlebags.\" Males have white cheek patches while females and juveniles have dusky cheeks. Juveniles have grayish-brown backs and crowns",
        "habitat: Violet-green Swallows breed in open woodlands including deciduous, evergreen, and mixed species woodlands, especially where old cavity-filled trees occur. They also frequent lakes and streams where they forage for flying insects"
    ],
    "Northern Rough-winged Swallow": [
        "shape: Small, long-bodied bird with a small head and bill. Flies on long and relatively broad, pointed wings. Note square tail",
        "size: Larger than Ruby-throated Hummingbird, smaller than a Purple Martin sparrow-sized or smaller",
        "color: Entirely brown above with a dingy throat and chest that fades to white. Sexes similar. Juveniles look like adults, but have cinnamon wingbars",
        "habitat: Found in open areas often near water and nests in burrows excavated by other animals as well as in crevices in gutters, boxes, drainpipes, walls, and bridges"
    ],
    "Bank Swallow": [
        "shape: A small swallow with a chunky body, large head, relatively short pointed wings, and a slightly forked tail",
        "size: The smallest of North America’s swallow species, similar in size to a Chimney Swift but with shorter, broader wings between sparrow and robin",
        "color: A warm brown swallow with white underparts and a thick brown band across the chest. The head is brown with a white chin. Underwings are dark",
        "habitat: Bank Swallows breed in open lowland areas near bodies of water. They tend to avoid forests, woodlands, or areas where they cannot find appropriate nesting habitats"
    ],
    "Cliff Swallow": [
        "shape: These compact swallows have rounded, broad-based wings, a small head, and a medium-length, squared tail",
        "size: Smaller than a Purple Martin; slightly larger than a Bank Swallow sparrow-sized or smaller",
        "color: In poor light, Cliff Swallows look brownish with dark throats and white underparts. In good light you’ll see their metallic, dark-blue backs and pale, pumpkin-colored rumps. They have rich, brick-red faces and a bright buff-white forehead patch like a headlamp. Some juveniles show whitish throats in summer and fall",
        "habitat: Cliff Swallows traditionally built their nests on vertical cliff faces. With the expansion of road infrastructure they have adopted many bridges, overpasses, and culverts as their colonial nesting sites. They feed in areas near and over water, frequently mixing with other species of swallows"
    ],
    "Cave Swallow": [
        "shape: Cave Swallows have a cylindrical body with long, pointed wings and a square-tipped tail that sometimes shows a slight notch. The bill is very short and the feet very small",
        "size: Slightly larger than a Bank Swallow, smaller than a Barn Swallow sparrow-sized or smaller",
        "color: Cave Swallows are dark above and pale below. The most notable features for ID include the chestnut rump, forehead, and cheeks, and the pale chestnut throat",
        "habitat: Nests in natural or human-made structures including caves, sinkholes, buildings, silos, bridges, and culverts. During the day it forages over open areas, often near water"
    ],
    "Barn Swallow": [
        "shape: When perched, the sparrow-sized Barn Swallow appears cone shaped, with a slightly flattened head, no visible neck, and broad shoulders that taper to long, pointed wings. The tail extends well beyond the wingtips and the long outer feathers give the tail a deep fork",
        "size: Slightly smaller than a bluebird; slightly larger than a Tree Swallow sparrow-sized or smaller",
        "color: Barn Swallows have a steely blue back, wings, and tail, and rufous to tawny underparts. The blue crown and face contrast with the cinnamon-colored forehead and throat. White spots under the tail can be difficult to see except in flight. Males are more boldly colored than females",
        "habitat: You can find the adaptable Barn Swallow feeding in open habitats from fields, parks, and roadway edges to marshes, meadows, ponds, and coastal waters. Their nests are often easy to spot under the eaves or inside of sheds, barns, bridges and other structures"
    ],
    "Carolina Chickadee": [
        "shape: This tiny, approachable bird has a short neck and large head, giving it a distinctive spherical body shape. Its tail is fairly long and narrow. Its bill is a bit thicker than a warbler’s but thinner than a finch’s",
        "size: Smaller than a White-breasted Nuthatch sparrow-sized or smaller",
        "color: Carolina Chickadees have a black cap and bib separated by stark white cheeks. The back, wings, and tail are soft gray",
        "habitat: Forested areas or urban and suburban yards or parks with large trees"
    ],
    "Black-capped Chickadee": [
        "shape: This tiny bird has a short neck and large head, giving it a distinctive, rather spherical body shape. It also has a long, narrow tail and a short bill a bit thicker than a warbler’s but thinner than a finch’s",
        "size: Smaller than a sparrow sparrow-sized or smaller",
        "color: The cap and bib are black, the cheeks white, the back soft gray, the wing feathers gray edged with white, and the underparts soft buffy on the sides grading to white beneath. The cap extends down just beyond the black eyes, making the small eyes tricky to see",
        "habitat: Chickadees may be found in any habitat that has trees or woody shrubs, from forests and woodlots to residential neighborhoods and parks, and sometimes weedy fields and cattail marshes. They frequently nest in birch or alder trees"
    ],
    "Mountain Chickadee": [
        "shape: Tiny, large-headed but small-billed, with a long, narrow tail and full, rounded wings",
        "size: Same size as Black-capped Chickadee sparrow-sized or smaller",
        "color: Like all chickadees, strikingly black-and-white on the head, gray elsewhere. The white stripe over the eye identifies Mountain Chickadees from all other chickadees",
        "habitat: Dry, mountainous forests of the West. The similar Black-capped Chickadee often occurs along streams and in broad-leaved trees, while Mountain Chickadees stick to the evergreens on higher slopes"
    ],
    "Chestnut-backed Chickadee": [
        "shape: Tiny, large-headed but small-billed, with a rather long, narrow tail and short, rounded wings",
        "size: The smallest, shortest-tailed chickadee sparrow-sized or smaller",
        "color: The Chestnut-backed Chickadee is boldly black and white on the head like other chickadees, but the back is a rich chestnut instead of the more typical slaty gray. The flanks can be either rich brown (north of San Francisco) or dull gray (central and southern California)",
        "habitat: Chestnut-backed Chickadees are found in dense coniferous and mixed coniferous forests of the Pacific Coast. You can also find them in shrubs, trees, and parks of cities, towns, and suburbs"
    ],
    "Boreal Chickadee": [
        "shape: A small songbird with husky body and head, and a slim, rather long tail",
        "size: About the size of a Black-capped Chickadee sparrow-sized or smaller",
        "color: A grayish brown bird with a rich brown cap, a small black bib, and small white cheek (gray at the rear). Whitish below, with pinkish buff sides",
        "habitat: Restricted largely to mature spruce-fir forests in Canada and some adjacent states"
    ],
    "Bridled Titmouse": [
        "shape: A small songbird with a short, pointy crest, a short, stubby bill, a moderately long tail, and rounded wings",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Western Bluebird sparrow-sized or smaller",
        "color: An ashy gray bird with a boldly striped black-on-white face made up of a sweeping black line on the crest, a line through the eye and bordering the cheek, and black patches on the nape and throat",
        "habitat: Resident in oak, pine-oak, and riparian woodlands at higher elevations (typically above 5,000 feet)"
    ],
    "Oak Titmouse": [
        "shape: Oak Titmice are small songbirds with short, stubby bills, a short crest on the head, and a medium-long tail",
        "size: Smaller than a Western Bluebird; slightly larger than a Black-throated Gray Warbler sparrow-sized or smaller",
        "color: Oak Titmice are plain gray-brown birds. They are slightly darker above than below, and may show a slight buffy wash on the flanks",
        "habitat: Oak Titmice are strongly tied to oak trees, although they also live in areas of open pine or mixed oak-pine forest. The species is almost entirely restricted to dry slopes in California, though it ranges north to Oregon and south to Baja California as well"
    ],
    "Juniper Titmouse": [
        "shape: The Juniper Titmouse is a small songbird, but the long body, short neck, and medium-long tail makes it appear bigger than it is. A short crest gives the fairly large head a pointed silhouette. The short bill is fairly thick and round",
        "size: Larger than a Bushtit, smaller than a Dark-eyed Junco sparrow-sized or smaller",
        "color: The Juniper Titmouse is gray overall with a slightly paler gray belly. The dark eye stands out on an otherwise plain gray bird. The bill is also dark",
        "habitat: The Juniper Titmouse occurs in pinyon pine and juniper woodlands from about 2,250-8,000 feet. These cavity-nesting birds tend to nest in mature woodlands, where older pinyon and juniper trees offer a ready supply of cavities for nesting"
    ],
    "Tufted Titmouse": [
        "shape: Tufted Titmice look large among the small birds that come to feeders, an impression that comes from their large head and eye, thick neck, and full bodies. The pointed crest and stout bill help identify titmice even in silhouette",
        "size: Noticeably larger than a chickadee sparrow-sized or smaller",
        "color: Soft silvery gray above and white below, with a rusty or peach-colored wash down the flanks. A black patch just above the bill makes the bird look snub-nosed",
        "habitat: You’ll find Tufted Titmice in most eastern woodlands below 2,000 feet elevation, including deciduous and evergreen forests. Tufted Titmice are also common visitors at feeders and can be found in backyards, parks, and orchards"
    ],
    "Black-crested Titmouse": [
        "shape: A medium-sized songbird with a long tail, short bill, and distinctive crest",
        "size: Larger than a Carolina Chickadee, slightly smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Medium gray above, pale below, with grayish flanks and black crest; sides and forehead sometimes tinged buff",
        "habitat: A wide variety of wooded habitats, from mesquite bosques to montane evergreen forests, oak scrub, or suburbs"
    ],
    "Verdin": [
        "shape: A tiny, chickadee-like songbird with a slight body, moderately long tail, small head, and tiny pointed bill",
        "size: Larger than a Black-tailed Gnatcatcher, smaller than a Bridled Titmouse sparrow-sized or smaller",
        "color: Adults are grayish with a yellow head. They have a small chestnut patch at the bend of the wing (the lesser coverts). Juveniles are similar but lack the yellow and chestnut colors",
        "habitat: Nests and forages in thorny desert scrub with scattered trees"
    ],
    "Bushtit": [
        "shape: Bushtits are tiny, kinglet-sized birds. They are plump and large-headed, with long tails and short, stubby bills",
        "size: Slightly smaller than a chickadee; about the size of a kinglet sparrow-sized or smaller",
        "color: Bushtits are fairly plain brown-and-gray birds. Slightly darker above than below, they have brown-gray heads, gray wings, and tan-gray underparts. Males in parts of the range have contrasting blackish face masks",
        "habitat: Bushtits live in oak forest, evergreen woodlands, dry scrublands, streamsides, and suburbs. You can find them at elevations from sea level to over 10,000 feet"
    ],
    "Red-breasted Nuthatch": [
        "shape: A small, compact bird with a sharp expression accentuated by its long, pointed bill. Red-breasted Nuthatches have very short tails and almost no neck; the body is plump or barrel-chested, and the short wings are very broad",
        "size: Noticeably smaller than a White-breasted Nuthatch sparrow-sized or smaller",
        "color: Red-breasted Nuthatches are blue-gray birds with strongly patterned heads: a black cap and stripe through the eye broken up by a white stripe over the eye. The underparts are rich rusty-cinnamon, paler in females",
        "habitat: Red-breasted Nuthatches are mainly birds of coniferous woods and mountains. Look for them among spruce, fir, pine, hemlock, larch, and western red cedar as well as around aspens and poplars. In northeastern North America you can also find them in forests of oak, hickory, maple, birch, and other deciduous trees"
    ],
    "White-breasted Nuthatch": [
        "shape: The largest nuthatch, this is still a small bird with a large head and almost no neck. The tail is very short, and the long, narrow bill is straight or slightly upturned",
        "size: Larger than a Red-breasted Nuthatch; smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: White-breasted Nuthatches are gray-blue on the back, with a frosty white face and underparts. The black or gray cap and neck frame the face and make it look like this bird is wearing a hood. The lower belly and under the tail are often chestnut",
        "habitat: White-breasted Nuthatches are birds of mature woods and woodland edges. They’re particularly associated with deciduous stands, including maple, hickory, basswood, and oak, though they can be found in some coniferous forests"
    ],
    "Pygmy Nuthatch": [
        "shape: A tiny bird with a relatively large, rounded head, no discernible neck, and a straight, sharp bill. The legs are short, the wings are short and broad, and the tail is short and square",
        "size: Smaller than a White-breasted Nuthatch; slightly larger than a Golden-crowned Kinglet sparrow-sized or smaller",
        "color: Bluish-gray above with a sharply defined brown crown and pale nape spot. The throat is white and the underside creamy buff. Some subspecies show a blackish line through eye",
        "habitat: Pygmy Nuthatches live in pine forests in western North America; they especially favor mature ponderosa pine forests. They are typically found at lower and middle elevations where ponderosa pine grows, but can sometimes occur up to 10,000 feet"
    ],
    "Brown-headed Nuthatch": [
        "shape: The Brown-headed Nuthatch is a tiny, compact bird. It appears rather round thanks to its short tail, legs, and neck. It also has a chisel-like bill that looks a little too big for its body",
        "size: Larger than a Golden-crowned Kinglet, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: This bird is white below and gray above with a brown head. Finer inspection reveals a white spot on the back of the head and small white spots in the tail that are visible in flight. Males and females look similar",
        "habitat: Brown-headed Nuthatches occur in Southeastern pine forests in areas with loblolly, shortleaf, longleaf, and slash pine trees. They are most common in open and mature pine forests and are less common in mixed pine-hardwood stands"
    ],
    "Brown Creeper": [
        "shape: Brown Creepers are tiny yet lanky songbirds. They have long, spine-tipped tails, slim bodies, and slender, decurved bills",
        "size: Smaller than a White-breasted Nuthatch; larger than a Golden-crowned Kinglet sparrow-sized or smaller",
        "color: Streaked brown and buff above, with their white underparts usually hidden against a tree trunk, Brown Creepers blend easily into bark. Their brownish heads show a broad, buffy stripe over the eye (supercilium)",
        "habitat: Brown Creepers breed primarily in mature evergreen or mixed evergreen-deciduous forests. You can find them at many elevations, even as high as 11,000 feet at treeline in the West. In the winter season, the species moves into a broader variety of forests and becomes much easier to find in deciduous woodlands"
    ],
    "Cactus Wren": [
        "shape: The Cactus Wren is a large chunky wren with a long heavy bill, a long, rounded tail, and short, rounded wings. The Cactus Wren is the largest wren in the United States and is similar in size to a Spotted Towhee",
        "size: Larger than a Bewick’s Wren, smaller than a Northern Mockingbird between sparrow and robin",
        "color: The Cactus Wren is a speckled brown bird with bright white eyebrows that extend from the bill, across and above their red eyes, to the sides of the neck. They have pale cinnamon sides and a white chest with dark speckles. The back is brown with heavy white streaks, and the tail is barred white and black—especially noticeable from below. Males and females look alike, but juveniles are slightly paler and have a brown eye",
        "habitat: Cactus Wrens live in deserts, arid foothills, coastal sage scrub, and urban areas throughout the Southwestern deserts, especially in areas with thorny shrubs, cholla, and prickly pear"
    ],
    "Canyon Wren": [
        "shape: A distinctive pot-bellied wren with a long, slender, slightly curved bill, a fairly long tail, and strong, short legs. The wings are short and rounded",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than a Cactus Wren sparrow-sized or smaller",
        "color: Canyon Wrens are rusty brown birds with a neat white throat. The head is a grayer brown than the body and speckled with white, while the tail is a brighter rusty brown than the back. The wings and tail are barred with black",
        "habitat: Rocky canyons and slopes in arid country, from about 1,000–6,000 feet elevation, sometimes higher"
    ],
    "Carolina Wren": [
        "shape: The Carolina Wren is a small but chunky bird with a round body and a long tail that it often cocks upward. The head is large with very little neck, and the distinctive bill marks it as a wren: long, slender, and downcurved",
        "size: slightly smaller than sparrows; slightly larger than a House Wren sparrow-sized or smaller",
        "color: Both males and females are a bright, unpatterned reddish-brown above and warm buffy-orange below, with a long white eyebrow stripe, dark bill, and white chin and throat",
        "habitat: Look—or listen—for Carolina Wrens singing or calling from dense vegetation in wooded areas, especially in forest ravines and neighborhoods. These birds love to move low through tangled understory; they frequent backyard brush piles and areas choked with vines and bushes"
    ],
    "Bewick's Wren": [
        "shape: Bewick’s Wrens are medium-sized wrens with a slender body and a strikingly long tail often held upright. They have slender, long bills that are slightly downcurved",
        "size: Smaller than a House Sparrow; slightly larger than a House Wren sparrow-sized or smaller",
        "color: Bewick’s Wrens are subdued brown-and-gray wrens with a long, brow-like white stripe over the eye. The back and wings are plain brown; underparts gray-white; and the long tail is barred with black and tipped with white spots. Males and females look the same",
        "habitat: Bewick’s Wrens favor dry brushy areas, chaparral, scrub, thickets in open country, and open woodlands near rivers and streams. They are at home in gardens, residential areas, and parks in cities and suburbs"
    ],
    "House Wren": [
        "shape: Small and compact, with a flat head and fairly long, curved beak. Short-winged, often keeping its longish tail either cocked above the line of the body or slightly drooped",
        "size: Smaller than a Carolina Wren; chickadee-sized sparrow-sized or smaller",
        "color: Subdued brown overall with darker barring on the wings and tail. The pale eyebrow that is characteristic of so many wren species is much fainter in House Wrens",
        "habitat: In summer, House Wrens are at home in open forests, forest edges, and areas with scattered grass and trees. Backyards, farmyards, and city parks are perfect for them. In winter they become more secretive, preferring brushy tangles, thickets, and hedgerows"
    ],
    "Pacific Wren": [
        "shape: One of the smallest wrens in the United States, the Pacific Wren has a short, stubby tail which it usually holds upright. Their small size and short tail give them a round appearance. They have short wings and a thin bill",
        "size: Larger than a Rufous Hummingbird, smaller than a Chestnut-backed Chickadee sparrow-sized or smaller",
        "color: This wren is brown overall with darker brownish-black barring on the wings, tail, and belly. The face is also brown with a slight pale mark over the eyebrow",
        "habitat: Pacific Wrens are most common in old-growth evergreen forests. They also live in deciduous forests, treeless islands in Alaska, and in mixed-species forests near streams. Wrens forage and build nests near fallen logs, upturned tree roots, dead trees, and thick understory cover of mosses and ferns, often near water. During the nonbreeding season, winter wrens use more types of habitats including parks and gardens"
    ],
    "Winter Wren": [
        "shape: The Winter Wren is a plump round ball with a stubby tail that it usually holds straight up. Its bill is small and thin, in keeping with its diminutive appearance",
        "size: Larger than a Ruby-throated Hummingbird, smaller than a Carolina Wren sparrow-sized or smaller",
        "color: In the dark forest understory, the Winter Wren appears brown overall. With a closer look, you’ll see darker brown barring on the wings, tail, and belly. It has a pale tan eyebrow stripe above the eye and a plain brown cap. Its unmarked throat and barred belly are pale tan, paler than the back",
        "habitat: Winter Wrens use both deciduous and evergreen forests with plenty of downed logs, standing dead trees, larger trees, and understory vegetation. They are often more common in areas near streams"
    ],
    "Marsh Wren": [
        "shape: The Marsh Wren is a small, plump, round-bodied wren with a short tail that it often holds up almost vertically above its back. It has a thin bill and short wings",
        "size: About the size of a House Wren, but smaller than a Song Sparrow sparrow-sized or smaller",
        "color: The Marsh Wren is a small, plump, round-bodied wren with a short tail that it often holds up almost vertically above its back. It has a thin bill and short wings",
        "habitat: Marsh Wrens occupy wetlands filled with cattails, sedges, bulrushes, and Phragmites as well as cordgrass-filled saltmarshes year-round. In the winter they also use brushy thickets near wetlands, tidal saltmarshes, and weedy agricultural canals"
    ],
    "Blue-gray Gnatcatcher": [
        "shape: Blue-gray Gnatcatchers are tiny, slim songbirds with long legs; a long tail; and a thin, straight bill",
        "size: Slightly larger than a Ruby-throated Hummingbird, Slightly smaller than a House Wren sparrow-sized or smaller",
        "color: Blue-gray Gnatcatchers are pale blue-gray birds with grayish-white underparts and a mostly black tail with white edges. The underside of the tail is mostly white. The face is highlighted by a thin but obvious white eyering. In summer, male Blue-gray Gnatcatchers sport a black ‘V’ on their foreheads extending above their eyes",
        "habitat: In the East, gnatcatchers breed in deciduous forests and near edges, often in moister areas. In the West, look for them in shorter woodlands and shrublands including pinyon-juniper and oak woodlands"
    ],
    "Black-tailed Gnatcatcher": [
        "shape: A tiny, slim songbird with a thin, straight bill, small body, and long tail",
        "size: Larger than a Costa’s Hummingbird; smaller than a Black-throated Sparrow sparrow-sized or smaller",
        "color: Black-tailed Gnatcatchers are gray overall with a fine white eyering, and a black tail with white flashes on the underside. They are darker gray above, with paler gray underparts. Breeding males have a black cap",
        "habitat: Look for Black-tailed Gnatcatchers in desert scrub, including washes densely lined with creosote and salt bush as well as areas studded with ocotillo, prickly pear, cholla, and mesquite"
    ],
    "American Dipper": [
        "shape: Medium-sized, round-bodied, and chunky, with long legs, rounded head and short neck, a short, sturdy bill, and a short tail",
        "size: Larger and heavier-bodied than a Western Bluebird, smaller than an American Robin robin-sized",
        "color: Adults are dark gray all over, slightly more brownish around the head. Legs are pink and the bill is black. Young birds have faintly barred underparts and a yellowish bill. Look for distinct white eyelids when they blink",
        "habitat: Fast flowing, rocky streams with gravel or rocky bottoms. Perches on boulders and woody debris"
    ],
    "Golden-crowned Kinglet": [
        "shape: These are tiny songbirds with a rounded body, short wings, and skinny tail. They have relatively large heads, and their bills are short and thin, perfect for gleaning small insects",
        "size: Smaller than a chickadee; larger than a hummingbird sparrow-sized or smaller",
        "color: Golden-crowned Kinglets are pale olive above and gray below, with a black-and-white striped face and bright yellow-orange crown patch. They have a thin white wingbar and yellow edges to their black flight feathers",
        "habitat: Golden-crowned Kinglets live mainly in coniferous forests. They breed in boreal or montane forests (especially spruce and fir), as well as in conifer plantations. In winter, kinglets are somewhat less selective about their habitat: though they still use conifers, you may also find them in deciduous forests, suburbs, swamps, bottomlands, and scrubby habitat. They can occur from sea level to more than 10,000 feet elevation"
    ],
    "Ruby-crowned Kinglet": [
        "shape: Kinglets are tiny songbirds with relatively large heads, almost no neck, and thin tails. They have very small, thin, straight bills",
        "size: Smaller than a chickadee or warbler; about the same size as a Golden-crowned Kinglet sparrow-sized or smaller",
        "color: Ruby-crowned Kinglets are olive-green birds with a prominent white eyering and white wingbar. This wingbar contrasts with an adjacent blackish bar in the wing. The “ruby crown” of the male is only occasionally visible",
        "habitat: Ruby-crowned Kinglets breed in tall, dense conifer forests such as spruce, fir, and tamarack. In winter and during migration, also look for them in shrubby habitats, deciduous forests, parks, and suburbs"
    ],
    "Wrentit": [
        "shape: Wrentits are small birds with fairly large, round heads and short rounded wings giving them an overall plump appearance. They have long legs and long tails, which they often hold up and away from their body at different angles. Their bills are short and slightly curved",
        "size: Larger than a Bushtit, smaller than a Spotted Towhee; about the size of a Song Sparrow sparrow-sized or smaller",
        "color: Wrentits are plain brownish-gray with paler, slightly streaked, pale pinkish bellies. They have a distinctive pale eye",
        "habitat: The Wrentit lives in coastal scrub and chaparral along the West Coast, including suburban yards and parks with shrubs. Away from the coast they live in thickets along creeks, oak woodlands, mixed-evergreen forests, and dense shrublands with coyotebush, manzanita, California lilac, or blackberry"
    ],
    "Eastern Bluebird": [
        "shape: The Eastern Bluebird is a small thrush with a big, rounded head, large eye, plump body, and alert posture. The wings are long, but the tail and legs are fairly short. The bill is short and straight",
        "size: About two-thirds the size of an American Robin between sparrow and robin",
        "color: Male Eastern Bluebirds are vivid, deep blue above and rusty or brick-red on the throat and breast. Blue in birds always depends on the light, and males often look plain gray-brown from a distance. Females are grayish above with bluish wings and tail, and a subdued orange-brown breast",
        "habitat: Eastern Bluebirds live in meadows and openings surrounded by trees that offer suitable nest holes. With the proliferation of nest boxes and bluebird trails, bluebirds are now a common sight along roads, field edges, golf courses, and other open areas"
    ],
    "Western Bluebird": [
        "shape: Western Bluebirds are small thrushes that usually perch upright. They are stocky with thin, straight bills and fairly short tails",
        "size: Larger than a sparrow; smaller than an American Robin sparrow-sized or smaller",
        "color: Male Western Bluebirds are shiny blue above with rust-orange extending from a vest on the breast onto the upper back. Females are gray-buff with a pale orange wash on the breast and blue tints to the wings and tail. The throat is blue in males and gray-buff in females, and the lower belly is whitish",
        "habitat: Look for Western Bluebirds in open woodland, both coniferous and deciduous. They also live in backyards, burned areas, and farmland, from sea level far up into the mountains"
    ],
    "Mountain Bluebird": [
        "shape: Mountain Bluebirds are fairly small thrushes with round heads and straight, thin bills. Compared with other bluebirds they are lanky and long-winged, with a long tail",
        "size: Slightly larger than a Cassin’s Finch, considerably smaller than an American Robin between sparrow and robin",
        "color: Male Mountain Bluebirds are sky-blue, a bit darker on wings and tail and a bit paler below, with white under the tail. Females are mostly gray-brown with tinges of pale blue in the wings and tail. They occasionally show a suffusion of orange-brown on the chest. Mountain Bluebirds’ bills are entirely black. Juveniles have fewer spots than the young of other bluebirds and lack spotting on the back",
        "habitat: Mountain Bluebirds are common in the West’s wide-open spaces, particularly at middle and higher elevations. They breed in native habitats such as prairie, sagebrush steppe, and even alpine tundra; anywhere with open country with at least a few trees that can provide nest cavities. They also readily take to human-altered habitats, often nesting in bluebird boxes and foraging in pastures"
    ],
    "Townsend's Solitaire": [
        "shape: This thrush is a medium-sized songbird with a long tail, a short bill, and a small rounded head relative to its body size. Their upright posture and long tail gives them a long and slender appearance",
        "size: Larger than a Mountain Bluebird, smaller than an American Robin robin-sized",
        "color: Townsend’s Solitaires are gray birds with prominent white eyerings. Their buffy wing patches and white outer tail feathers are often prominent in flight. Juveniles are dark gray overall and heavily spotted with buff and white, giving them a scaly look",
        "habitat: Townsend’s Solitaires inhabit open pine, fir, and spruce forests in mountainous regions from about 1,100–11,500 feet. During the nonbreeding season some Townsend’s Solitaires migrate short distances to lower elevations especially where juniper berries are abundant"
    ],
    "Veery": [
        "shape: Veeries are medium-sized thrushes—smaller than an American Robin but similar in shape. They have a plump body, round head, a straight, narrow bill, and fairly long wings and legs",
        "size: Smaller than an American Robin; larger than a Song Sparrow between sparrow and robin",
        "color: Most Veeries are uniformly bright cinnamon-brown above with indistinct spotting on the chest and pale underparts (see Regional Differences for exceptions). The throat is white with a buffy-orange cast",
        "habitat: Veeries breed in rich deciduous woodland and forest with well-developed understory across northern North America. Wintering birds select the same habitat structure in the tropics. On migration, you might encounter the species in nearly any woodlot or other treed habitat"
    ],
    "Swainson's Thrush": [
        "shape: Swainson’s Thrushes are medium-sized thrushes—slim songbirds with round heads and short, straight bills. Their fairly long wings and medium-length tail can make the back half of the bird appear long",
        "size: Smaller than an American Robin; larger than a White-throated Sparrow between sparrow and robin",
        "color: These medium-brown birds with pale underparts have spotted chests and large buffy eyerings that extend in front of the eye, creating “spectacles.” The whitish throat is bordered on each side with a dark brown stripe. Swainson’s Thrushes breeding on the Pacific slope of the U.S. and Canada have warmer brown upperparts (see Regional Differences)",
        "habitat: This is a forest bird, rarely found far from closed-canopy forest. Breeding habitat is a mix of deciduous and coniferous forest (though sometimes includes pure deciduous forest). In the Rocky Mountains and in Pacific states, look for them in dense alder thickets along streams running through coniferous forest"
    ],
    "Hermit Thrush": [
        "shape: Hermit Thrushes have a chunky shape similar to an American Robin, but smaller. They stand upright, often with the slender, straight bill slightly raised. Like other thrushes, the head is round and the tail fairly long",
        "size: Smaller than an American Robin, larger than a Song Sparrow between sparrow and robin",
        "color: The Hermit Thrush is rich brown on the head and back, with a distinctly warm, reddish tail. The underparts are pale with distinct spots on the throat and smudged spots on the breast. With a close look you may see a thin pale eyering (not a bold one)",
        "habitat: Look for Hermit Thrushes in forest understories, especially around edges or openings"
    ],
    "Wood Thrush": [
        "shape: The Wood Thrush's pot-bellied body, short tail, straight bill, big head, and upright posture give it the profile of a scaled-down American Robin",
        "size: Smaller than an American Robin, larger than a Hermit Thrush between sparrow and robin",
        "color: Wood Thrushes are warm reddish-brown above and white with bold black spots on their underparts. Juveniles show a somewhat muted version of the same pattern. All have a bold, white eyering",
        "habitat: The Wood Thrush breeds in deciduous and mixed forests in the eastern U.S. where there are large trees, moderate understory, shade, and abundant leaf litter for foraging. They winter in lowland tropical forests in Central America"
    ],
    "Varied Thrush": [
        "shape: Varied Thrushes are stocky songbirds with large, rounded heads, straight bills, and long legs. Usually seen standing horizontally on the ground or in a tree, they often look plump-bellied with a relatively short tail",
        "size: About the size of an American Robin; smaller than a Steller’s Jay robin-sized",
        "color: Male Varied Thrushes are dark blue-gray on the back and rich burnt-orange below with a sooty-black breastband and orange line over the eye. The wings are blackish with two orange bars and orange edging to the flight feathers. Females have the same patterns, but are paler gray-brown than males",
        "habitat: Varied Thrushes breed in dark understories of humid evergreen and mixed forests along the Pacific Coast. In the winter, many move into dense parks, gardens, and backyards. Varied Thrushes are rare but regular winter visitors to the Upper Midwest and Northeast"
    ],
    "Gray Catbird": [
        "shape: A medium-sized, slender songbird with a long, rounded, black tail and a narrow, straight bill. Catbirds are fairly long legged and have broad, rounded wings",
        "size: Slightly smaller than a Northern Mockingbird robin-sized",
        "color: Catbirds give the impression of being entirely slaty gray. With a closer look you’ll see a small black cap, blackish tail, and a rich rufous-brown patch under the tail",
        "habitat: Look for Gray Catbirds in dense tangles of shrubs, small trees, and vines, along forest edges, streamside thickets, old fields, and fencerows"
    ],
    "Northern Mockingbird": [
        "shape: A medium-sized songbird, a bit more slender than a thrush and with a longer tail. Mockingbirds have small heads, a long, thin bill with a hint of a downward curve, and long legs. Their wings are short, rounded, and broad, making the tail seem particularly long in flight",
        "size: Slightly larger than a Gray Catbird robin-sized",
        "color: Mockingbirds are overall gray-brown, paler on the breast and belly, with two white wingbars on each wing. A white patch in each wing is often visible on perched birds, and in flight these become large white flashes. The white outer tail feathers are also flashy in flight",
        "habitat: Look for Northern Mockingbirds in towns, suburbs, backyards, parks, forest edges, and open land at low elevations"
    ],
    "Brown Thrasher": [
        "shape: Brown Thrashers are fairly large, slender songbirds with long proportions—the legs are long and sturdy, and the bill is long and slightly downcurved. The tail is long, too, and often cocked upward in the manner of wrens",
        "size: Slightly smaller than a Blue Jay; slightly larger than a Northern Mockingbird robin-sized",
        "color: Brown Thrashers are foxy brown birds with heavy, dark streaking on their whitish underparts. The face is gray-brown and the wings show two black-and-white wingbars. They have bright-yellow eyes",
        "habitat: Scrubby fields, dense regenerating woods, and forest edges are the primary habitats of Brown Thrashers. They rarely venture far from thick undergrowth into which they can easily retreat"
    ],
    "Curve-billed Thrasher": [
        "shape: A lanky songbird with a long, curved bill, long tail, and thick legs, recalling a mockingbird but bulkier and with a different bill",
        "size: Slightly larger than an American Robin, smaller than a Woodhouse’s Scrub-Jay robin-sized",
        "color: Grayish brown above, paler off-white below mottled with indistinct gray-brown speckling. The eye is orange-yellow",
        "habitat: Deserts (especially with cholla cactus), brushlands, thorn scrub, arid canyons, pinyon-oak scrub"
    ],
    "California Thrasher": [
        "shape: A large, lanky songbird with a very long tail and long legs. The bill is very long and strongly curved. It has wide wings",
        "size: Larger than a Northern Mockingbird, smaller than a Yellow-billed Magpie robin-sized",
        "color: Brown to grayish brown overall with a pale throat and a buffy or rusty patch under the tail",
        "habitat: Nests and forages in chaparral of coastal and foothill areas, as well as in nearby areas with junipers, pines, and oaks with plenty of underbrush, including sagebrush"
    ],
    "American Pipit": [
        "shape: A small, slim songbird with a short, thin bill, and medium-length tail, recalling a lark (or a sparrow, but lacking a sparrow’s heavier bill)",
        "size: Larger than a Yellow-rumped Warbler, smaller than a White-crowned Sparrow sparrow-sized or smaller",
        "color: Brownish or grayish above, pale below, with most subspecies showing streaks in the breast and sides, especially in winter",
        "habitat: Mostly bare terrestrial habitats of many kinds, including tundra, shortgrass plains, alpine meadows, sandbars, mudflats, and many human-made habitats such as airfields, turf farms, harvested agricultural fields, and winter wheat fields. Pipits sometimes perch in bushes"
    ],
    "Bohemian Waxwing": [
        "shape: Bohemian Waxwings are full-bellied, thick-necked birds with a shaggy crest atop a pin head. The wings are broad and pointed, like a starling's. The tail is fairly short and square-tipped",
        "size: Larger than a bluebird, smaller than an American Robin robin-sized",
        "color: The Bohemian Waxwing is grayish brown overall with subtle peach blushing around its black mask. The wings have 2 distinctive white rectangular patches and red waxlike tips on the secondaries. The undertail is rusty and the tail is tipped in yellow. Juveniles are grayer overall with a streaked belly. Juveniles lack the adult's peach blushing around the face and the red-tipped secondaries",
        "habitat: Bohemian Waxwings breed in open evergreen forests and spend the nonbreeding season in open areas that have plentiful fruit, from city parks to forest patches near streams"
    ],
    "Cedar Waxwing": [
        "shape: The Cedar Waxwing is a medium-sized, sleek bird with a large head, short neck, and short, wide bill. Waxwings have a crest that often lies flat and droops over the back of the head. The wings are broad and pointed, like a starling’s. The tail is fairly short and square-tipped",
        "size: Slightly smaller than a Bohemian Waxwing between sparrow and robin",
        "color: Cedar Waxwings are pale brown on the head and chest fading to soft gray on the wings. The belly is pale yellow, and the tail is gray with a bright yellow tip. The face has a narrow black mask neatly outlined in white. The red waxy tips to the wing feathers are not always easy to see",
        "habitat: Look for Cedar Waxwings in woodlands of all kinds, and at farms, orchards, and suburban gardens where there are fruiting trees or shrubs"
    ],
    "Ovenbird": [
        "shape: The Ovenbird is a chunky, larger-than-average warbler, but still smaller than a Song Sparrow. It has a round head, fairly thick bill for a warbler, and a jaunty tail often cocked upward",
        "size: Slightly larger than a Yellow Warbler; smaller than an Eastern Bluebird sparrow-sized or smaller",
        "color: Ovenbirds are olive-green above and spotted below, with bold black-and-orange crown stripes. A white eyering gives it a somewhat surprised expression. Like several other terrestrial, or near-terrestrial, warblers, Ovenbirds have pink legs",
        "habitat: Ovenbirds breed in closed-canopy forests, particularly deciduous and mixed deciduous-coniferous woods. You may find them in most forest types, from rich oak or maple woods to dry pine forest, although they avoid wet or swampy areas"
    ],
    "Louisiana Waterthrush": [
        "shape: A large, somewhat plump warbler, with a stout bill (bigger than Northern Waterthrush’s), rather short tail, and long legs",
        "size: Larger than a Yellow Warbler, smaller than an Eastern Bluebird. Slightly larger than Northern Waterthrush sparrow-sized or smaller",
        "color: Brownish above, with a very prominent white eyebrow (supercilium); pale below, with dark streaks. The supercilium is thicker in Louisiana than in ​Northern, and tends to flare at the rear. The legs are bright pink",
        "habitat: Louisiana Waterthrushes are almost always seen near fast-flowing forested streams or creeks. On migration they sometimes use the edges of lakes and ponds if there is adequate vegetative cover"
    ],
    "Northern Waterthrush": [
        "shape: A large but trim warbler with a short, fine bill, a rather short tail, and long legs. The bill is smaller than Louisiana Waterthrush’s",
        "size: Larger than a Yellow Warbler, smaller than an Eastern Bluebird sparrow-sized or smaller",
        "color: Brownish above, with a prominent pale eyebrow (supercilium); pale yellowish or buff below, with dark streaks. The legs are duskier and less pink than Louisiana Waterthrush. The supercilium stripe is thinner in Northern Waterthrush than in Louisiana, especially at rear, and is faintly yellowish",
        "habitat: Northern Waterthrushes are almost always seen near still or stagnant water, even during migration. Wooded swamps, ponds with brushy edges, bogs, beaver ponds, and similar settings attract breeders and migrants, while wintering birds use mangroves"
    ],
    "Blue-winged Warbler": [
        "shape: Blue-winged Warblers are small, well-proportioned birds with a sharp and pointed bill. Compared to other warblers, the rather heavy black bill and eyeline give them a pointy-headed look",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than a Field Sparrow sparrow-sized or smaller",
        "color: Adult males are bright yellow below, yellow-green above, and have two obvious wingbars on blue-gray wings, and a black eyeline. Adult females are paler with a less defined eyeline. The black bill and eyeline contribute to an almost angry-looking expression. From below look for the white undertail coverts on both sexes",
        "habitat: Blue-winged Warbler is a shrubland specialist, and are found in brushy fields, thickets, and forest edges"
    ],
    "Black-and-white Warbler": [
        "shape: Black-and-white Warblers are medium-sized warblers (small songbirds). They have a fairly long, slightly downcurved bill. The head often appears somewhat flat and streamlined, with a short neck. The wings are long and the tail is short",
        "size: About the size of a Black-capped Chickadee; slightly smaller than a White-breasted Nuthatch sparrow-sized or smaller",
        "color: These birds are boldly striped in black and white. Their black wings are highlighted by two wide, white wing bars. Adult males have more obvious black streaking, particularly on the underparts and the cheek. Females (especially immatures) are paler, with less streaking and usually a wash of buff on the flanks. The undertail coverts have distinctive large black spots",
        "habitat: Deciduous forest and mixed forest are the preferred summer habitats of Black-and-white Warblers, usually with trees of mixed ages that provide a variety of foraging substrates. On migration, look for them in any forest or woodlot. They winter in forests and forest edges from Florida to Colombia"
    ],
    "Prothonotary Warbler": [
        "shape: The Prothonotary Warbler is a large, heavy-bodied warbler with a big head and bill. It has shorter legs and a shorter tail than other warblers. Its bill is heavier and longer than most warblers",
        "size: Larger than a Carolina Chickadee, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: The Prothonotary Warbler is bright golden yellow with blue-gray wings and tail and a yellow-olive back. Its beady black eye stands out on its solid yellow face. Seen from below, it has white under the tail. Females are often paler yellow than males",
        "habitat: Prothonotary Warblers breed in wooded swamps, flooded bottomland forests, and wooded areas near streams and lakes. These forests are often flat and shady with standing dead trees that have old woodpecker and chickadee holes for nesting"
    ],
    "Tennessee Warbler": [
        "shape: Small and stocky for a warbler, with a short tail and a thin and sharply pointed bill (markedly smaller and more pointed than a Red-eyed Vireo's bill)",
        "size: Larger than a Golden-crowned Kinglet, slightly smaller than a Yellow-rumped Warbler sparrow-sized or smaller",
        "color: Breeding males have a gray head with a white line over the eye, contrasting with a green back and no wingbars. The underparts are whitish all the way through the undertail coverts. Females and nonbreeding males are more greenish, with less contrast between head and back. Occasionally very olive-yellow all over except for white undertail coverts",
        "habitat: Tennessee Warblers breed in coniferous or mixed deciduous-coniferous forest across Canada. On migration they can occur in most types of forests and woodlands. Winters in second-growth tropical forests"
    ],
    "Orange-crowned Warbler": [
        "shape: Orange-crowned Warblers are small songbirds. Compared with other warblers, they have noticeably thin, sharply pointed bills. They have short wings and short, square tails",
        "size: Slightly larger than a Ruby-crowned Kinglet; slightly smaller than a Yellow-rumped Warbler sparrow-sized or smaller",
        "color: Orange-crowned Warblers are fairly plain yellowish or olive—they are more yellow on the Pacific coast and grayer, particularly on the head, farther east. They have a thin white or yellow stripe over the eye, a blackish line through the eye, and a pale partial eyering. The namesake orange crown patch is rarely seen, but may become visible when the bird raises its head feathers in excitement or agitation. The undertail coverts are bright yellow and are often the brightest part of the plumage",
        "habitat: Orange-crowned Warblers breed in dense areas of deciduous shrubs, usually within or adjacent to forest. They can occur from low-elevation oak scrub to stunted forest near timberline. During migration you may find them in nearly any habitat, though they still show a preference for dense, low vegetation"
    ],
    "Nashville Warbler": [
        "shape: A small songbird, compact with a round head, plump body and shortish tail. The bill is fine, straight, and pointed",
        "size: Smaller than a White-breasted Nuthatch, larger than a Blue-gray Gnatcatcher sparrow-sized or smaller",
        "color: A mostly yellow warbler with a green back, gray head, and white eyering. The lower belly is white, sandwiched in between yellow breast and yellow undertail coverts; this is a distinctive pattern helpful for identifying the species from below. Females and young birds are similar but the colors are more washed out and pale",
        "habitat: Nashville Warbler most commonly use shrubby tangles and regrowing clearings within broken forests. In the East, this often means mixed forest and spruce-cedar bogs. In the West, look for them in brushy oak and fir forests"
    ],
    "MacGillivray's Warbler": [
        "shape: A compact, small songbird with a full body for a warbler and a thick neck. The bill is straight and thin overall, although heavier than many other warblers’ bills. The tail is medium length and the legs are fairly long",
        "size: Slightly larger than a Common Yellowthroat, slightly smaller than a Pine Warbler sparrow-sized or smaller",
        "color: Adult males are rich golden-olive above, bright yellow below, with a dark gray hood extending down to the chest. The face has white crescents (arcs) above and below the eye and blackish lores (the area between eye and bill). Adult females are similar but duller in color. Immatures are mostly olive brown above, with whitish eye arcs and a grayish or brownish version of the hood, broken up by a pale throat",
        "habitat: Nests and forages in dense shrubby vegetation, second growth, and along streams with dense underbrush. Migrants typically occur in similar habitats. Winters in dense habitats in Central America, from coastal mangrove and edges of thorn forest into cloud forest"
    ],
    "Mourning Warbler": [
        "shape: A small but sturdy songbird with a fairly full body and thick neck. The bill is thin and straight, smaller than the bill of the similar-looking Connecticut Warbler. It has a moderately long tail and strong legs",
        "size: Larger than a Carolina Chickadee, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: Adult males are olive above, yellow below, with a gray hood and black chest patch. Adult females are more muted in colors and lack the chest patch. Immatures are brownish above, yellow below, including center of throat. Both sexes usually lack an eyering, although some adult males show thin white eye arcs (recalling the bolder marks of MacGillivray’s Warbler)",
        "habitat: Nests in dense shrubby second-growth of berry-bearing plants in boreal forest and Appalachian highlands. Winters in undergrowth of lowland and highland tropical forest gaps and edges in Central and South America"
    ],
    "Hooded Warbler": [
        "shape: Hooded Warblers are small, well-proportioned birds with a straight, sharp bill. Compared to other warblers, they are fairly heavy-bodied and thick-necked",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Adult males are olive-green above and bright yellow below with a black hood and throat, a yellow forehead, and yellow cheeks. Females and immatures are also olive-green above and yellow below, but they don't have a black hood, although some adult females show an outline of a hood. Note the large black eye and white outer tail feathers that it often flashes",
        "habitat: Hooded Warblers are found in mature deciduous forests with a dense understory, but also uses smaller forest patches as long as there is a shrubby understory"
    ],
    "Cape May Warbler": [
        "shape: A delicate, short-tailed warbler with a slender and distinctively decurved bill, unusual among warblers",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: Adult males are rich yellowish olive above, with rufous cheeks (auriculars) framed in yellow and dense rufous “tiger stripes” on the breast (present in all plumages, giving the species its scientific name, tigrina). The underparts are yellow, and the wing has a large white patch. Females and immatures are duller, lacking vivid yellow but with a yellowish green rump",
        "habitat: Boreal forest (spruce, balsam fir) in breeding season; a wide variety of forested and shrubby habitats during migration and in winter"
    ],
    "Northern Parula": [
        "shape: Northern Parulas are small wood-warblers with a short tail and a thin, pointy bill. They are plump little warblers about the size of a kinglet",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Adult male Northern Parulas are bluish gray overall with a yellow-green patch on the back and 2 white wingbars. A chestnut band separates the male's bright yellow throat and chest. Adult females are a bit paler and typically lack the male's breast band. Males and females have distinctive white eye crescents. Immature birds are paler than adults and lack the chestnut breast band",
        "habitat: In the southern part of their range Northern Parulas are more common in deciduous forests, but in the northern part they also use evergreen forests. But no matter what part of their range, the key to their presence is moss; Spanish moss in the South and beard moss farther north. On the wintering grounds, they forage in fields, pastures, plantations, scrub, and forests"
    ],
    "Blackburnian Warbler": [
        "shape: A typical medium-sized warbler with a short, thin, pointed bill, trim body, and medium-length tail. The overall shape is similar to the widespread Yellow Warbler",
        "size: Larger than a Northern Parula, slightly smaller than a Yellow-rumped Warbler sparrow-sized or smaller",
        "color: The breeding male, with vivid orange in face and throat, is unmistakable; females and immatures show at least a hint of this coloration, but more important is the unique triangular facial pattern of black (or gray), also seen in all plumages",
        "habitat: Breeds in coniferous forest (with spruce, white pine, or balsam fir) and mixed coniferous-deciduous forest, often with hemlock trees. Migrants are attracted to similar habitats (cemeteries with tall conifers in particular) but can appear in almost any environment with trees. Wintering birds in Central and South America utilize many montane habitats with trees"
    ],
    "Yellow Warbler": [
        "shape: Yellow Warblers are small, evenly proportioned songbirds with medium-length tails and rounded heads. For a warbler, the straight, thin bill is relatively large",
        "size: About the same size as a Yellow-rumped Warbler; slightly larger than an American Goldfinch sparrow-sized or smaller",
        "color: Yellow Warblers are uniformly yellow birds. Males are a bright, egg-yolk yellow with reddish streaks on the underparts. Both sexes flash yellow patches in the tail. The face is unmarked, accentuating the large black eye",
        "habitat: Yellow Warblers breed in shrubby thickets and woods, particularly along watercourses and in wetlands. Common trees include willows, alders, and cottonwoods across North America and up to about 9,000 feet in the West. In winter they mainly occur in mangrove forests of Central and South America"
    ],
    "Palm Warbler": [
        "shape: Palm Warblers are small songbirds, but they are on the larger side for a warbler and have a fuller looking belly. Their posture is more upright than a typical warbler and more like a pipit—especially noticeable when they are on the ground. Their tails and legs are longer than most warblers contributing to the pipitlike shape",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Dark-eyed Junco sparrow-sized or smaller",
        "color: Palm Warblers are dull brownish-olive above with yellow under the tail and throat. The outside corners of their tails flash white in flight. In eastern birds the belly is yellow, while in western birds the belly is white. Sexes are similar, and during the breeding season they have a rusty cap and some rusty streaking on the belly. Nonbreeding birds have paler yellow undertails and a dull brown crown",
        "habitat: During migration and winter Palm Warblers use weedy fields, forest edges, fence rows, and other areas with scattered trees and shrubs. They breed in the boreal forest of the far north, where they use bogs with scattered evergreen trees and thick ground cover"
    ],
    "Pine Warbler": [
        "shape: Pine Warblers are hefty, long-tailed warblers with stout bills. The tip of the tail usually appears to have a central notch",
        "size: Smaller than a White-throated Sparrow; larger than a Northern Parula sparrow-sized or smaller",
        "color: Pine Warblers are yellowish birds with olive backs, whitish bellies, and two prominent white wingbars on gray wings. Adult males are the brightest; females and immatures are more subdued and can even appear gray-brown. Overall, Pine Warblers don’t show the strong patterns of other warblers, but the face can look weakly “spectacled,” with a pale eyering connected to a pale stripe in front of the eye",
        "habitat: Pine Warblers are well named—they spend most of their time in pine trees. This can be in pine forests or in deciduous woods with pine mixed in. They are found in similar habitats in winter, but also visit backyards and come to bird feeders to eat seeds and suet"
    ],
    "Yellow-throated Warbler": [
        "shape: Yellow-throated Warblers are small, well-proportioned birds with sharp and pointed bills. Compared to other warblers, they are a bit more heavy-bodied with a longer and thicker bill. From below, note the blunt, only slightly notched tail",
        "size: Slightly larger than a Brown Creeper, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: Yellow-throated Warblers are gray and white with a splash of yellow on the throat and black streaks down the sides. The yellow throat is offset by a black triangle below the eye and a white eyebrow. From above they have a gray back and 2 white wingbars. From below look for the white belly and white tail. Females and first-year males look similar, but are slightly paler",
        "habitat: Yellow-throated Warblers are found in pine forests, sycamore–bald cypress swamps, and woodlands near streams, especially areas with tall trees and an open understory"
    ],
    "Prairie Warbler": [
        "shape: Small songbird with thin, straight bill. Slender, with a long tail and long legs relative to other warblers",
        "size: Larger than a Blue-gray Gnatcatcher, slightly smaller than a Yellow-rumped Warbler sparrow-sized or smaller",
        "color: Adult males are bright yellow below with heavy black streaks on the flanks. A black eyeline and a black semicircle under the eye mark the yellow face. Males often have a chestnut patch on the back and a dark spot on the side of the neck. Females and immatures are similar but paler, with a grayish head and broken white eyering",
        "habitat: Prairie Warblers are found in scrubby, second-growth habitats such as overgrown pastures, regenerating woodlands, pine stands, and powerline cuts. The Florida subspecies lives in mangrove forests"
    ],
    "Black-throated Gray Warbler": [
        "shape: A compact warbler with a small round bill and a big head",
        "size: Larger than a Bushtit, smaller than a Juniper Titmouse sparrow-sized or smaller",
        "color: A mostly black, gray, and white bird with a yellow spot above and in front of the eye. They also have a sharp black-and-white striped face and crisp black streaks on their sides. Females are a tad paler and often have a patchy black throat. From below, note the all-white belly and undertail",
        "habitat: Found in open pine, pine-oak, and pinyon-juniper forests"
    ],
    "Townsend's Warbler": [
        "shape: A small songbird, slender-bodied like many other warblers, with a short, fine bill and moderately long tail",
        "size: Larger than a Golden-crowned Kinglet, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: Adult males have a black head and throat with a gleaming golden face and black cheek patch. They have gray wings with white wingbars, an olive-green back, and a yellow breast with bold black flank streaks. Females and immatures are similar but less strongly marked",
        "habitat: Breeding birds use mostly tall, old-growth coniferous and mixed woodlands, nesting and foraging mostly in the upper third of the trees. Migrating and wintering birds occupy a great variety of habitats, from chaparral to cloud forest to parks and backyards along the Pacific Coast"
    ],
    "Hermit Warbler": [
        "shape: A small songbird with classic warbler proportions, including a moderately long tail and a rather short, slender, straight bill",
        "size: Larger than a Bushtit, smaller than a White-crowned Sparrow sparrow-sized or smaller",
        "color: Breeding males have a golden-yellow head and a black throat, with a dark gray back and two white wingbars. The upper breast is white with blackish streaking. Adult females and nonbreeding males have similar patterning but with subdued colors",
        "habitat: Tall coniferous forests, especially fir, pine, spruce, Douglas-fir, redwood, and sequoia, usually in mountainous areas. Winters in pine, pine-oak, and cloud forest habitats in mountains of Mexico and northern Central America. Migrants also occur in stream corridors forests, at desert oases, and in suburban parks"
    ],
    "Black-throated Green Warbler": [
        "shape: The Black-throated Green Warbler is a medium-sized warbler similar in size and shape to many others in the Setophaga genus. Plump and seemingly large-headed, with a thick, straight bill and shortish tail",
        "size: Larger than a kinglet, smaller than a titmouse sparrow-sized or smaller",
        "color: These are olive-green birds, white below, with yellow faces and black on the front. Adult males are stunning, with a bright yellow face and extensive black on the throat turning to black streaks on the flanks. Two bright white wingbars. Females and young birds are patterned like males, but duller and lacking the extensive black on the throat",
        "habitat: Black-throated Green Warblers use coniferous and mixed forests in the north, deciduous forests in the south, and coastal cypress swamps in the case of the unique “Wayne’s” subspecies. Migrating birds will frequent any woody habitat, even coming down from the canopy to forage on fruiting shrubs. Wintering birds are typically found in the canopies of tall mature forests in Middle America, but sometimes occur in secondary growth as well"
    ],
    "Canada Warbler": [
        "shape: Canada Warblers are small, well-proportioned birds with a straight, sharp bill. Compared to other warblers, they have a slightly longer tail with a fuller chest",
        "size: Larger than a Wilson's Warbler, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Canada Warblers are steely blue-gray above and bright yellow below with an obvious whitish eyering. The most noticeable feature is the broken black necklace across the chest on adult males. Females also have a necklace, but it's not as bold",
        "habitat: Found in mixed conifer and deciduous forests with a shrubby understory. It frequents forest slopes filled with rhododendrons in the southern Appalachian Mountains, aspen and poplar forests in Canada, and forested wetlands in the central part of its range"
    ],
    "Wilson's Warbler": [
        "shape: Wilson’s Warblers are one of our smallest warblers. They have long, thin tails and small, thin bills. They appear rather round bodied and large headed for their size",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Common Yellowthroat sparrow-sized or smaller",
        "color: Wilson’s Warblers are bright yellow below and yellowish olive above. Their black eyes stand out on their yellow cheeks. Males have a distinctive black cap. Adult females are similar in color but show variations in the amount of black on the top of the head, from a few blackish feathers to a small dark cap. Juvenile females have an olive crown and a yellow eyebrow",
        "habitat: Wilson’s Warblers breed in mountain meadows and thickets near streams, especially those with willows and alders. They also breed along the edges of lakes, bogs, and aspen stands. Pacific Coast populations breed in shrubby habitat and in young stands of conifers, alders, or maples. During migration they use woodlands, suburban areas, desert scrub, and shrubby areas near streams"
    ],
    "Yellow-breasted Chat": [
        "shape: Chats are small songbirds but are larger and bulkier than warblers or vireos. They have a long tail, large head and a relatively thick, heavy bill",
        "size: Larger than a Yellow Warbler; smaller than an American Robin between sparrow and robin",
        "color: Chats are olive-green above with a bright yellow breast and bold face markings. The face is gray, with a white eyering that connects to the bill, forming “spectacles.” They also have a white malar or mustache stripe bordering the cheek. The lower belly is white",
        "habitat: Yellow-breasted Chats live in thickets and other dense, regrowing areas such as bramble bushes, clearcuts, powerline corridors, and shrubs along streams"
    ],
    "Green-tailed Towhee": [
        "shape: Green-tailed Towhees are small but chunky songbirds with a big head, stocky body and longish tail. The bill is thick and sparrowlike. They are larger than most sparrows and have shorter tails than most other towhees",
        "size: Larger than a Song Sparrow, smaller than an American Robin between sparrow and robin",
        "color: Green-tailed Towhees are grayish birds with olive-yellow wings, back and tail. The head is strongly marked with a bright rufous crown, white throat, and a dark “mustache” stripe",
        "habitat: Look for Green-tailed Towhees in shrubby habitats of the West, particularly disturbed areas of montane forest and open slopes in the Great Basin, sagebrush steppes, and high desert. In winter, they join mixed flocks in dense mesquite areas of desert washes"
    ],
    "Spotted Towhee": [
        "shape: A large sparrow with a thick, pointed bill, short neck, chunky body, and long, rounded tail",
        "size: About a third again bigger than a Song Sparrow and twice as heavy. Smaller than a robin robin-sized",
        "color: Male Spotted Towhees have jet-black upperparts and throat; their wings and back are spotted bright white. The flanks are warm rufous and the belly is white. Females have the same pattern but are grayish brown where males are black. In flight, look for white corners to the black tail",
        "habitat: Look for Spotted Towhees in open, shrubby habitat with thick undergrowth. Spotted Towhees are also at home in backyards, forest edges, and overgrown fields"
    ],
    "Eastern Towhee": [
        "shape: Towhees are a kind of large sparrow. Look for their thick, triangular, seed-cracking bill as a tip-off they’re in the sparrow family. Also notice the chunky body and long, rounded tail",
        "size: 30% bigger than a Song Sparrow and twice as heavy. Smaller than a robin robin-sized",
        "color: Males are striking: bold sooty black above and on the breast, with warm rufous sides and white on the belly. Females have the same pattern, but are rich brown where the males are black",
        "habitat: Look for Eastern Towhees in brush, tangles, thickets, and along forest edges where there’s plenty of leaf litter for the birds to forage in"
    ],
    "Rufous-crowned Sparrow": [
        "shape: Rufous-crowned Sparrows are relatively large sparrows with rounded heads and fairly long tails. The thick, pointed bill is fairly large",
        "size: Larger and bulkier than a Chipping Sparrow; smaller than a White-crowned Sparrow sparrow-sized or smaller",
        "color: These are grayish sparrows with streaky backs and and bright reddish-brown crowns. They have a white eyering and a white malar or whisker stripe that’s bordered in black and contrasts with the gray face and underparts",
        "habitat: Look for Rufous-crowned Sparrows on steep, dry, rocky hillsides with plenty of grasses and a scattering of shrubs and small trees, such as sagebrush or scrub oaks. Recently burned areas can provide good, open habitat. The birds tend to avoid areas of dense shrubs"
    ],
    "Canyon Towhee": [
        "shape: Canyon Towhees are large sparrows with fairly long tails, chunky bodies and short rounded wings. The bill is short and thick at the base, and the legs are long",
        "size: between sparrow and robin",
        "color: Overall, the Canyon Towhee is about as plain brown as birds come. They have warm rusty undertail coverts, a buffy throat and a hint of a reddish crown",
        "habitat: Within their fairly narrow range, look for Canyon Towhees in desert grasslands with scattered dense shrubs, rocky terrain, dry watercourses with mesquite, and other dry, scrubby areas. Unlike California Towhees, they shy away from suburban neighborhoods, favoring sparsely settled and remote areas"
    ],
    "California Towhee": [
        "shape: California Towhees are essentially large sparrows, with a sparrow’s short, rounded wings, long tail, and thick, seed-cracking beak—but towhees are larger and bulkier. The long tail and short wings can give this bird an ungainly look in flight",
        "size: Slightly larger than a Spotted Towhee; slightly smaller than a robin between sparrow and robin",
        "color: Few birds are as uniformly matte brown as a California Towhee, except for a rusty patch under the tail (called the crissum, giving the bird its scientific name) and around their bill. Males look the same as females",
        "habitat: California Towhees live in chaparral and other tangled, shrubby, and dry habitats. They’re also at home in the small backyards and neighborhood parks of lowland California towns"
    ],
    "Abert's Towhee": [
        "shape: A large sparrow with a short, conical bill, an elongated body for a sparrow, and a rather long tail. The overall shape is similar to Northern Cardinal (but with a smaller bill and without the crest)",
        "size: Slightly larger than a Northern Cardinal, smaller than a Woodhouse’s Scrub-Jay robin-sized",
        "color: Abert’s Towhee is grayish-brown above, pinkish brown below, with rusty undertail coverts and black plumage bordering a pale grayish bill",
        "habitat: Low, dense cover along desert streams and riverbeds with cottonwoods, willows, or mesquite"
    ],
    "American Tree Sparrow": [
        "shape: American Tree Sparrows are small, round-headed birds that often fluff out their feathers, making their plump bodies look even chubbier. Among sparrows, they have fairly small bills and long, thin tails",
        "size: About the size of a House Sparrow sparrow-sized or smaller",
        "color: A rusty cap and rusty (not black) eyeline on a gray head, a streaked brown back, and a smooth gray to buff breast in both male and female American Tree Sparrows give an overall impression of reddish-brown and gray. A dark smudge in the center of the unstreaked breast is common",
        "habitat: Look for small flocks of American Tree Sparrows in winter in weedy fields with hedgerows or shrubs, along forest edges, or near marshes. They readily visit backyards, especially if there's a seed feeder. American Tree Sparrows breed in the far north and are rarely seen south of northern Canada in summer"
    ],
    "Clay-colored Sparrow": [
        "shape: Clay-colored Sparrows are petite, trim sparrows with a small bill, slender body, and fairly long, notched tail. The small, slender shape of these and other Spizella sparrows is distinctive",
        "size: About the size of a Chipping Sparrow; slightly smaller than a Song Sparrow sparrow-sized or smaller",
        "color: These are mostly pale, tan-and-gray birds with a contrasting face pattern. Their pale gray collar is a helpful mark at all times of the year. The crown is finely streaked, with a pale stripe over the eye and darker cheek. The dark eyeline does not extend in front of the eye",
        "habitat: They breed in shrublands, field edges, and thickets across the northern prairies. At the eastern edge of their range, look for them in Christmas tree farms and grassy areas with short, scattered conifers. They spend winters in desert grasslands, upland plains, thorn scrub, fields, and brushy hillsides"
    ],
    "Brewer's Sparrow": [
        "shape: The Brewer’s Sparrow is typical of the Spizella group of sparrows: dainty and slim, with a long, notched tail, short rounded wings, and a small, sharply conical bill. Its size varies somewhat by region and sex, but overall it is North America’s smallest sparrow",
        "size: About the size of a Black-capped Chickadee; noticeably smaller and slimmer than a Song Sparrow sparrow-sized or smaller",
        "color: Brewer’s Sparrows are dusky gray-brown, with grayish underparts and a thin white eyering. The back and nape are streaked. A faint gray stripe over the eye contrasts with a darker eyeline. The throat is grayish white",
        "habitat: Brewer’s Sparrows live in the arid sagebrush steppe of the interior West of North America, where they are the region’s most abundant bird. In some northwestern mountains, a form known as the “Timberline Sparrow” lives among subalpine trees and dwarf shrubs"
    ],
    "Field Sparrow": [
        "shape: Field Sparrows are small, slender sparrows with relatively short, conical bills, rounded heads, and somewhat long tails",
        "size: Smaller and more slender than a Song Sparrow; larger than a Black-capped or Carolina Chickadee sparrow-sized or smaller",
        "color: These are warm-colored birds with a distinct white eyering, a pink bill, and pale grayish underparts with soft orangey highlights. The head is pale gray with a bright rufous crown and a wide rufous line behind the eye. The whitish throat is bordered by soft orange-rufous lateral throat stripes. The back is brown with black streaks, all of which contrasts with the gray rump and tail. The wings have two weak wingbars",
        "habitat: Field Sparrows are so-called “old-field” specialists; look for them in areas of tall grass and brush that are growing up into small trees and shrubs, particularly thorny shrubs such as roses and briars"
    ],
    "Vesper Sparrow": [
        "shape: Vesper Sparrows are fairly large sparrows with a chunky body, a fairly small conical bill, and a long, notched tail",
        "size: Larger than a Savannah Sparrow, smaller than a Western Meadowlark sparrow-sized or smaller",
        "color: Brown overall with crisp streaks. The most notable features include a thin white eyering, white outer tail feathers (seen in flight), and a pale cheek patch. Vesper Sparrows also have a distinctive, but difficult to see, chestnut patch on the shoulder",
        "habitat: Found in open grassy areas including prairie, weedy fields, sagebrush steppe, meadows, pastures, and roadsides. Tends to avoid areas with taller grass and wetter areas"
    ],
    "Lark Sparrow": [
        "shape: A large, long-tailed sparrow. When perched, it often looks long-bodied with a thin neck and a round head. The tail is long and rounded",
        "size: Larger than an American Goldfinch, smaller than a Western Meadowlark sparrow-sized or smaller",
        "color: Adults have a bold, blocky facial pattern that sets them apart from other sparrows. Chestnut and white stripes streak across the head, a black mustache runs down the sides of the throat, and the cheeks have chestnut spots. The outer tail feathers are tipped in white and a black spot marks the center of the chest. Juveniles have a ghosting of the adult's facial pattern and heavy streaking on the breast and flanks",
        "habitat: Found in grasslands, roadsides, farmlands, pastures, and open country with scattered trees and shrubs"
    ],
    "Savannah Sparrow": [
        "shape: Savannah Sparrows are medium-sized sparrows with short, notched tails. The head appears small for the plump body, and the crown feathers often flare up to give the bird’s head a small peak. The thick-based, seed-eating bill is small for a sparrow",
        "size: About the size of a Song Sparrow sparrow-sized or smaller",
        "color: Savannah Sparrows are brown above and white below, with crisp streaks throughout. Their upperparts are brown with black streaks, and the underparts are white with thin brown or black streaks on the breast and flanks. Look for a small yellow patch on the face in front of the eye",
        "habitat: Savannah Sparrows breed in open areas with low vegetation, including most of northern North America from tundra to grassland, marsh, and farmland. Even in winter, you’ll find Savannah Sparrows on the ground or in low vegetation in open areas; look for them along the edges of roads adjacent to farms"
    ],
    "Song Sparrow": [
        "shape: Song Sparrows are medium-sized and fairly bulky sparrows. For a sparrow, the bill is short and stout and the head fairly rounded. The tail is long and rounded, and the wings are broad",
        "size: Slightly smaller than a Dark-eyed Junco; slightly larger than a Chipping Sparrow sparrow-sized or smaller",
        "color: Song Sparrows are streaky and brown with thick streaks on a white chest and flanks. On a closer look, the head is an attractive mix of warm red-brown and slaty gray, though these shades, as well as the amount of streaking, vary extensively across North America",
        "habitat: Look for Song Sparrows in nearly any open habitat, including marsh edges, overgrown fields, backyards, desert washes, and forest edges. Song Sparrows commonly visit bird feeders and build nests in residential areas"
    ],
    "Lincoln's Sparrow": [
        "shape: The Lincoln's Sparrow is a medium-sized sparrow with a dainty appearance. It has a rounded belly and head, but the back of its head often looks pointed or crested when it raises its crown feathers. Its tail is relatively short and its conical bill is a bit thinner compared to most other sparrows",
        "size: Larger than a Wilson's Warbler, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: The Lincoln's Sparrow is streaky brown, buffy, and gray overall with rusty edges to its wings and tail. Its chest and sides are rich buff with fine black streaking that fades into a white belly. Its face is marked by a buffy mustache stripe that is bordered by thin brown lines. A buffy eyering, a thick gray eyebrow, and a dark eyeline mark the area around the eye. Its crown is striped brown and black with a gray central crown stripe",
        "habitat: These sparrows breed in wet meadows filled with willows, alders, and sedges. They also breed in patches of aspens, cottonwoods, and willows as well as shrubby areas near streams. During migration Lincoln's Sparrows use brushy fields, forest edges, and thickets. In winter, they use tropical forests, pine-oak forests, tropical scrub, weedy pastures, and shrubby fields"
    ],
    "Swamp Sparrow": [
        "shape: A medium-sized sparrow with a short, conical bill, a compact, robust body, and a moderately long tail. The overall shape is quite similar to the widespread Song Sparrow",
        "size: Slightly larger than a Chipping Sparrow, slightly smaller than a White-throated Sparrow sparrow-sized or smaller",
        "color: Swamp Sparrows look quite dark overall, especially in dim or shadowy habitats, where they often remain concealed. Closer views reveal a bright rusty crown and wings (especially the coverts), grayish breast with whitish throat, and gray nape",
        "habitat: Swamp Sparrows are almost always seen near water, even during migration, although migrants sometimes use wet fields and brambles and other low, dense cover"
    ],
    "Pyrrhuloxia": [
        "shape: Pyrrhuloxias are stocky, medium-sized songbirds with tall crests and long tails. They have heavy but short seed-cracking bills with a curved culmen, or upper edge",
        "size: About the size of a Northern Cardinal; larger than a Black-throated Sparrow between sparrow and robin",
        "color: Overall, Pyrrhuloxias are gray or gray-brown birds with prominent flashes of red. Males are crisp gray with a red face and crest, a red stripe running down the breast, and a reddish tail. Females are buffy gray, with less red than males. Both sexes have yellowish bills and reddish highlights in the wings",
        "habitat: Sedentary residents of desert regions, Pyrrhuloxias favor scrub, dry grasslands, open mesquite forest, and cactus gardens for nesting. In the winter, they may move short distances into more lush areas near water"
    ],
    "Dickcissel": [
        "shape: Compact and sparrowlike, with a full chest, a large, thick bill, and a relatively short tail",
        "size: Slightly larger than a Song Sparrow, about the same size as a House Sparrow sparrow-sized or smaller",
        "color: Adult males are grayish on the head with a yellow face and chest, crossed with a bold black V. The back is brown and gray, with warm reddish-brown shoulders. Females have a similar but more subdued pattern and lack the black V on the throat. Immatures are browner, without the cool gray or bright yellow tones; note the broad eyebrow stripe and neat dark malar (mustache) stripe",
        "habitat: In all seasons Dickcissels are most commonly found in tall grasslands, including prairies, hayfields, lightly grazed pastures, and roadsides"
    ],
    "Eastern Meadowlark": [
        "shape: Eastern Meadowlarks are chunky, medium-sized songbirds with short tails and long, spear-shaped bills. In flight, their rounded wings, short tails, and long bills help set them apart from other grassland songbirds",
        "size: Slightly larger but more compact than an American Robin; smaller than a Blue Jay robin-sized",
        "color: Eastern Meadowlarks are pale brown marked with black, with bright-yellow underparts and a bold black V across the chest. Though most of the tail is brown with blackish barring, the outer feathers are white and conspicuous during flight",
        "habitat: Eastern Meadowlarks live in farm fields, grasslands, and wet fields. They nest on the ground and sing from exposed perches such as treetops, fenceposts, and utility lines"
    ],
    "Western Meadowlark": [
        "shape: The Western Meadowlark is the size of a robin but chunkier and shorter-tailed, with a flat head, long, slender bill, and a round-shouldered posture that nearly conceals its neck. The wings are rounded and short for the bird’s size and the tail is short, stiff, and spiky",
        "size: About the size of an American Robin, but with a shorter tail robin-sized",
        "color: Western Meadowlarks have yellow underparts with intricately patterned brown, black and buff upperparts. A black “V” crosses the bright yellow breast; it is gray in winter. Contrasting stripes of dark brown and light buff mark the head. The outer tail feathers flash white in flight",
        "habitat: Western Meadowlarks seek the wide open spaces of native grasslands and agricultural fields for spring and summer breeding and winter foraging. Look for them among low to medium-height grasses more so than in tall fields. They also occur along the weedy verges of roads, marsh edges, and mountain meadows up to 10,000 feet"
    ],
    "Rusty Blackbird": [
        "shape: Rusty Blackbird is a medium-sized blackbird with a slender bill and medium-length tail. The bill is slightly decurved. They are a bit larger and longer-tailed than Red-winged Blackbird with a more slender bill. Rusty Blackbird is thinner-billed and shorter-tailed than Common Grackle",
        "size: robin-sized",
        "color: In winter, male Rusty Blackbirds are recognized by their rusty feather edges, pale yellow eye and buffy eyebrow. Females are gray-brown; they also have rusty feather edges, pale eyes and a bold eyebrow, contrasting with darker feathers right around the eye. Breeding males are dark glossy black",
        "habitat: Look for Rusty Blackbirds in wet areas, including flooded woods, swamps, marshes and the edges of ponds. These moist habitats are their favorite foraging areas in winter and during migration. During the breeding season, they favor bogs, beaver ponds and wet woods in boreal forest"
    ],
    "Common Grackle": [
        "shape: Common Grackles are large, lanky blackbirds with long legs and long tails. The head is flat and the bill is longer than in most blackbirds, with the hint of a downward curve. In flight, the wings appear short in comparison to the tail. Males are slightly larger than females",
        "size: Larger than a Red-winged Blackbird; about the same size as a Mourning Dove robin-sized",
        "color: Common Grackles appear black from a distance, but up close their glossy purple heads contrast with bronzy-iridescent bodies. A bright golden eye gives grackles an intent expression. Females are slightly less glossy than males. Young birds are dark brown with a dark eye",
        "habitat: Common Grackles thrive around agricultural fields, feedlots, city parks, and suburban lawns. They’re also common in open habitats including woodland, forest edges, meadows, and marshes"
    ],
    "Boat-tailed Grackle": [
        "shape: Boat-tailed Grackles are large, lanky songbirds with rounded crowns, long legs, and fairly long, pointed bills. Males have very long tails that make up almost half their body length and that they typically hold folded in a V-shape, like the keel of a boat",
        "size: Smaller than a Fish Crow; larger than a Common Grackle between robin and crow",
        "color: Males are glossy black all over. Females are dark brown above and russet below, with a subtle face pattern made up of a pale eyebrow, dark cheek, and pale “mustache” stripe. Eye color ranges from dull brown along the western Gulf Coast to bright yellow along the Atlantic Coast",
        "habitat: Boat-tailed Grackles are a strictly coastal species through most of their range; however, they live across much of the Florida peninsula, often well away from the immediate coast"
    ],
    "Great-tailed Grackle": [
        "shape: Male Great-tailed Grackles are long-legged, slender blackbirds with a flat-headed profile and stout, straight bills. The male’s tapered tail is nearly as long as its body and folds into a distinctive V or keel shape. Females are about half the size of males with long, slender tails",
        "size: Exceptionally long-tailed and large songbird. Much smaller by weight than an American Crow, but about the same length between robin and crow",
        "color: Male Great-tailed Grackles are iridescent black with piercing yellow eyes, and black bills and legs. Females are dark brown above, paler below, with a buff-colored throat and stripe above the eye. Juveniles have the female’s dark brown plumage, with streaked underparts and a dark eye",
        "habitat: Look for Great-tailed Grackles in rural and developed areas of the Midwest and West, foraging in agricultural fields and feedlots, and in suburbs including golf courses, cemeteries, parks, and neighborhood lawns. Large trees and vegetation edging marshes, lakes, and lagoons provide roosting and breeding sites"
    ],
    "Bronzed Cowbird": [
        "shape: A solidly built songbird with a thick-based, sharply pointed, slightly curved bill. Males have a thick neck, especially when they fluff out the feathers of the nape during displays",
        "size: Larger than a Brown-headed Cowbird, smaller than an Eastern or Western Meadowlark; similar in size to a Red-winged Blackbird robin-sized",
        "color: Adult males are blackish with a soft bronze sheen. The wings appear purplish blue at close range. Adult females and juveniles in the eastern part of the range are blackish; in the western part of the range they are grayish brown. Adults have vivid red eyes; juveniles have dark eyes",
        "habitat: Open habitats such as chaparral, mesquite bosques, coastal prairie, farmland, pasture, golf courses, lightly wooded canyons, and riparian corridors"
    ],
    "Gray-crowned Rosy-Finch": [
        "shape: A small songbird with a short, conical bill and a fairly short tail. Subspecies on the Aleutian and Pribilof Islands are considerably larger, shaped more like a grosbeak than a small finch",
        "size: Larger than an American Goldfinch, slightly smaller than a House Sparrow (except on Alaskan islands, where they are nearly as large as an Evening Grosbeak) sparrow-sized or smaller",
        "color: Adult males are rich brown suffused with pink on the body, with gray sides of the head and a black forecrown and throat. Adult females are similar but with less extensive pink. The bill is yellow. Juveniles are brownish overall with grayish wings and a dusky bill",
        "habitat: Nests high on mountains, in boulder fields and cliffs, and forages on scree slopes, ice fields, glaciers, meadows, and avalanche areas. Descends to open areas in lower elevations in winter, sometimes into forests and towns, especially where there are feeders"
    ],
    "Black Rosy-Finch": [
        "shape: Medium-sized chunky finch with a conical bill and a notched tail",
        "size: Larger than a Pine Siskin, smaller than an Evening Grosbeak sparrow-sized or smaller",
        "color: Breeding birds are blackish overall with pink highlights on the wings and lower belly, and a gray crown. Nonbreeding birds are brownish instead of black, but still have the same pink highlights as breeding birds. The bill on breeders is black and is yellow on nonbreeders",
        "habitat: Breeds in alpine areas, usually near rock piles and cliffs. Winters in open country, including mountain meadows, high deserts, valleys, and plains"
    ],
    "Brown-capped Rosy-Finch": [
        "shape: A small, compact songbird with a conical bill, relatively short tail, and rather long wings",
        "size: Larger than an American Goldfinch, smaller than a Mountain Bluebird sparrow-sized or smaller",
        "color: Adult male in breeding plumage is mostly rich brown above, deep rosy below, with rosy edges to wings and rump, charcoal gray cap and tail, and dark bill and legs. Adult female similarly patterned but much less richly colored. Bill is black in breeding season and yellow in winter. Juvenile brownish overall with strikingly patterned wings that may show a hint of rosy edges",
        "habitat: Nests in cliffs and other rocky environments in alpine meadows of the Rocky Mountains. Winters in the same environments but often descends to lower elevations, including forested habitats, during bad weather"
    ],
    "Common Redpoll": [
        "shape: Common Redpolls are small songbirds with small heads and small, pointed, seed-eating bills. The tail is short with a small notch at the tip",
        "size: About the size of an American Goldfinch sparrow-sized or smaller",
        "color: Common Redpolls are brown and white birds with heavily streaked sides. Look for a small red forehead patch, black feathering around a yellow bill, and two white wingbars. Males have a pale red vest on the chest and upper flanks",
        "habitat: Look for Common Redpolls in northern habitats ranging from willow flats to open conifer forest to open, weedy fields. They visit backyard bird feeders as well, especially during the winter"
    ],
    "Hoary Redpoll": [
        "shape: A very small songbird with a short, notched tail and a thick-based but very small bill that looks “pushed in” compared to Common Redpoll. Fluffed up plumage often makes this species appear portly",
        "size: Larger than a Golden-crowned Kinglet, smaller than a House Finch sparrow-sized or smaller",
        "color: Hoary Redpolls are pale whitish birds with gray-brown streaks. Adults have a small red patch on the forecrown. They have darker gray tail and wings, with bold white wingbars. Some individuals have a rosy tint to the rump and underparts, or a buff tint to the face and back. Adult females are less strikingly white overall than males. Juveniles are brownish and streaky, often with buff tones in the face",
        "habitat: Nests mostly in tundra where there are shrubs or stunted trees, sometimes in crevices of rocky areas. Typically winters in the Arctic, north of (or above) treeline, occasionally farther south, where usually found in weedy fields and sometimes at bird feeders"
    ],
    "Pine Siskin": [
        "shape: Pine Siskins are very small songbirds with sharp, pointed bills and short, notched tails. Their uniquely shaped bill is more slender than that of most finches. In flight, look for their forked tails and pointed wingtips",
        "size: Slightly smaller than an American Goldfinch sparrow-sized or smaller",
        "color: Pine siskins are brown and very streaky birds with subtle yellow edgings on wings and tails. Flashes of yellow can erupt as they take flight, flutter at branch tips, or display during mating",
        "habitat: Although Pine Siskins prefer evergreen or mixed evergreen and deciduous forests with open canopies, they are opportunistic and adaptable in their search for seeds. They'll forage in weedy fields, scrubby thickets, or backyards and gardens. And they'll flock around feeders, especially thistle feeders, in woodlands and suburbs"
    ],
    "Western Wood-Pewee": [
        "shape: Western Wood-Pewees are medium-sized flycatchers with a peaked crown that gives their head a triangular shape. These long and thin flycatchers perch upright in the canopy. They have long wings, a feature that helps separate them from similar looking Empidonax flycatchers",
        "size: Slightly larger than a Dusky Flycatcher, smaller than a Western Kingbird sparrow-sized or smaller",
        "color: Western Wood-Pewees are grayish brown overall with 2 pale wingbars. The underparts are whitish with smudgy gray on the breast and sides that can make them look like they are wearing a partially buttoned vest. The face is dark grayish brown with little to no eyering. The bill is mostly dark with yellow at the base of the lower mandible. Juveniles are similar to adults but have buffy wingbars",
        "habitat: Western Wood-Pewees use open woodlands, forest edges, and forests near streams with large trees, open understories, and standing dead trees. Common tree species include pinyon pine, cottonwood, sycamore, ponderosa pine, aspen, and spruce. They tend to avoid dense forests"
    ],
    "Eastern Wood-Pewee": [
        "shape: Eastern Wood-Pewees are medium-sized flycatchers with long wings and tails. Like other pewee species, they have short legs, upright posture, and a peaked crown that tends to give the head a triangular shape. Their long wings are an important clue to separate them from Empidonax flycatcher species",
        "size: A bit smaller than an Eastern Bluebird; larger than a chickadee sparrow-sized or smaller",
        "color: Eastern Wood-Pewees are olive-gray birds with dark wings, and little to no yellow on the underparts. The sides of the breast are dark with an off-white throat and belly, giving a vested appearance typical of pewees. They show little or no eyering. Adults have thin, white wingbars; those of juveniles are buffy. The underside of the bill is mostly yellow-orange, except in some juveniles",
        "habitat: Eastern Wood-Pewees are most common in deciduous forest and woodland, but you may find them in nearly any forested habitat, even smaller woodlots, for breeding as long as it is fairly open. As migrants, these pewees can occur in nearly any woodlot or other treed area"
    ],
    "Least Flycatcher": [
        "shape: Least Flycatchers are the smallest Empidonax flycatcher in the East. Like other flycatchers they tend to perch upright, but they appear a little more compact than most. The primary feathers on their wings are short, which makes their thin tail look longer. Their head is round and is not peaked at the back of the head like some other Empidonax ",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than an Eastern Wood-Pewee sparrow-sized or smaller",
        "color: Least Flycatchers are grayish olive above with a dusky breast. Their head is grayish olive as well with a bold white eyering. They have a very faint yellow wash to the belly and 2 white wingbars",
        "habitat: Least Flycatchers breed in deciduous and mixed forests of all ages including second-growth and mature forests. These forests tend to have a few shrubs or small saplings in the understory and a well-developed canopy"
    ],
    "Pacific-slope Flycatcher": [
        "shape: A slim, small songbird with an upright posture, a large head that often looks peaked, and a straight, fairly wide bill. The tail is moderately long",
        "size: Slightly larger than a Chestnut-backed Chickadee, smaller than a Black Phoebe sparrow-sized or smaller",
        "color: In fresh plumage, pale greenish brown above, pale below with lemon wash and brownish breast. The wings and tail are dark with strongly contrasting pale wingbars. Worn birds can look brownish above, dingy pale gray below, with weak wingbars",
        "habitat: Nests in shady but partly open coniferous and mixed forests, usually near streams in ravines and canyons of foothills and mountains. Migrants stop in similar interior woodland settings. Winters in lowland and mountain forests of western Mexico"
    ],
    "Cordilleran Flycatcher": [
        "shape: A slim, small songbird with a large, often peaked head, a straight, flat, pointed bill, and a moderately long tail",
        "size: Slightly larger than a Mountain Chickadee, smaller than a Western Kingbird sparrow-sized or smaller",
        "color: In fresh plumage, greenish brown above (usually darker than Pacific-slope), pale below with strong lemon wash and olive-tinged breast (colors usually richer than in Pacific-slope); wings and tail dark with strongly contrasting pale wingbars. Worn birds can look brownish above, dingy pale gray below, with weak wingbars",
        "habitat: Nests in shady but partly open coniferous and mixed forests, usually near streams in ravines and canyons of mountains. Migrants use similar interior woodland settings. Winters in montane pine-oak forests of western Mexico"
    ],
    "Black Phoebe": [
        "shape: Black Phoebes are small, plump songbirds with large heads and medium-long, squared tails. They often show a slight peak at the rear of the crown. The bill is straight and thin",
        "size: Smaller than a Western Scrub-Jay; larger than an American Goldfinch sparrow-sized or smaller",
        "color: Black Phoebes are mostly sooty gray on the upperparts and chest, with a slightly darker black head. The belly is clean white, and the wing feathers are edged with pale gray",
        "habitat: In the U.S., you’ll almost always find these flycatchers near water. They live along streams, rivers, lakes, and the Pacific Ocean—even around cattle tanks. As long as there is water present and some kind of ledge or overhang on which to anchor a mud nest, Black Phoebes could be around"
    ],
    "Eastern Phoebe": [
        "shape: The Eastern Phoebe is a plump songbird with a medium-length tail. It appears large-headed for a bird of its size. The head often appears flat on top, but phoebes sometimes raise the feathers up into a peak. Like most small flycatchers, they have short, thin bills used for catching insects",
        "size: Slightly larger than a Tufted Titmouse sparrow-sized or smaller",
        "color: The Eastern Phoebe is brownish-gray above and off-white below, with a dusky wash to the sides of the breast. The head is typically the darkest part of the upperparts. Birds in fresh fall plumage show faint yellow on the belly and whitish edging on the folded wing feathers",
        "habitat: These birds favor open woods such as yards, parks, woodlands, and woodland edges. Phoebes usually breed around buildings or bridges on which they construct their nests under the protection of an eave or ledge"
    ],
    "Say's Phoebe": [
        "shape: This slender, long-tailed flycatcher appears large-headed for a bird of its size. The head often looks flat on top, but phoebes sometimes raise their head feathers into a small peak at the back",
        "size: Larger than a Dark-eyed Junco, smaller than an American Robin between sparrow and robin",
        "color: Say’s Phoebes are pale brownish gray above with a cinnamon belly, a blackish tail, and a gray breast. Male and female are similar. The immature is similar to the adult, but browner and may have a buffy wingbar",
        "habitat: Say’s Phoebes live in open country, sagebrush, badlands, dry barren foothills, canyons, and borders of deserts; they avoid forests. They often gravitate to buildings and aren’t closely tied to watercourses like other phoebes"
    ],
    "Ash-throated Flycatcher": [
        "shape: This medium-sized flycatcher is long and slender with a long tail. Its head is slightly peaked at the back, making it look rather large headed for its size. It has a medium-sized bill that is thicker than phoebes and Empidonax flycatchers, but smaller than kingbirds",
        "size: Larger than a Western Bluebird, smaller than an American Robin robin-sized",
        "color: Ash-throated Flycatchers are grayish brown overall with a pale yellow belly and cinnamon edges on the primary feathers in the wing. The underside of the tail has a broad stroke of cinnamon down the center bordered by brownish gray. The cinnamon stripe does not reach the tip of the tail; the tip of the tail is brownish gray. Two whitish wingbars mark the wings. The head and face is uniformly ashy gray with a whitish throat. Males and females look similar",
        "habitat: The Ash-throated Flycatcher occupies dry scrub, open woodlands, and deserts in the West. They usually avoid humid forested areas, but do occur in woodlands along streams in dry regions"
    ],
    "Great Crested Flycatcher": [
        "shape: Great Crested Flycatchers are large flycatchers with fairly long and lean proportions. Like many flycatchers they have a powerful build with broad shoulders and a large head. Despite its name, this bird’s crest is not especially prominent. The bill is fairly wide at the base and straight; the tail is fairly long",
        "size: Larger than an Eastern Bluebird; smaller than an American Robin robin-sized",
        "color: Great Crested Flycatchers are reddish-brown above, with a brownish-gray head, gray throat and breast, and bright lemon-yellow belly. The brown upperparts are highlighted by rufous-orange flashes in the primaries and in the tail feathers. The black bill sometimes shows a bit of pale color at the base",
        "habitat: Great Crested Flycatchers live in woodlots and open woodland, particularly among deciduous trees. On its tropical wintering grounds it occurs in similar semiopen habitats. Migrants can occur in nearly any wooded or shrubby habitat"
    ],
    "Cassin's Kingbird": [
        "shape: A compact, powerfully built flycatcher with a heavy, straight bill, smallish head, and moderately long wings and tail",
        "size: Slightly larger than a Western Kingbird, smaller than a Northern Mockingbird robin-sized",
        "color: A gray-headed bird with a neat white throat and a lemon-yellow belly. The wings and tail are brownish; the tail does not have white outer feathers, but often shows a pale tip",
        "habitat: Nests in lightly wooded to open areas. Found from lowlands with scattered trees (such as desert scrub, agricultural areas, grasslands, cottonwood-edged rivers) up into canyons and foothills with pine, oak, juniper, and pinyon pine"
    ],
    "Western Kingbird": [
        "shape: Western Kingbirds are fairly large flycatchers with large heads and broad shoulders. They have heavy, straight bills, long wings, and a medium-length, square-tipped tail",
        "size: Smaller than an American Robin; larger than a Black Phoebe robin-sized",
        "color: Western Kingbirds are gray-headed birds with a yellow belly and a whitish chest and throat. The tail is black with white outer tail feathers that are especially conspicuous in flight",
        "habitat: Western Kingbirds live in open habitats, where they perch on utility lines, fences, and trees. They prefer valleys and lowlands, including grasslands, deserts, sagebrush, agricultural fields, and open woodlands. They are typically found below about 7,000 feet in elevation"
    ],
    "Eastern Kingbird": [
        "shape: The Eastern Kingbird is a sturdy, medium-sized songbird with a large head, upright posture, square-tipped tail, and a relatively short, straight bill",
        "size: Smaller than an American Robin; larger than an Eastern Phoebe robin-sized",
        "color: Eastern Kingbirds are blackish above and white below. The head is a darker black than the wings and back, and the black tail has a conspicuous white tip",
        "habitat: Eastern Kingbirds breed in open habitats such as yards, fields, pastures, grasslands, or wetlands, and are especially abundant in open places along forest edges or water. They spend winters in forests of South America"
    ],
    "Scissor-tailed Flycatcher": [
        "shape: Scissor-tailed Flycatchers are slender, stout-billed kingbirds with very long, stiff, deeply forked tails. Males have longer tail feathers than females and immatures",
        "size: Smaller and more slender overall than an American Robin, but can seem larger because of the very long tail; larger than an Eastern Phoebe robin-sized",
        "color: These are pale gray birds with blackish wings and black tails with white edges. Adults have salmon-pink flanks that extend to underwing patches that are very conspicuous in flight. Males are more intensely colored than females",
        "habitat: Scissor-tailed Flycatchers breed in open habitats in the southern Great Plains and south Texas, especially around scattered trees or utility lines. They tolerate human presence well and frequently breed in towns"
    ],
    "Loggerhead Shrike": [
        "shape: Loggerhead Shrikes are thick-bodied songbirds. They have large, blocky heads and a thick bill with a small hook. The tail is fairly long and rounded",
        "size: Smaller and more slender than an American Robin; larger and longer-tailed than a Western Bluebird robin-sized",
        "color: The Loggerhead Shrike is a gray bird with a black mask and white flashes in the black wings. The gray head contrasts with the wide, black mask, black bill, and white throat. The tail is black with white corners; the wings are black with white at the base of the primaries that form a small “handkerchief” spot when the wing is closed and larger white patches in flight. Juveniles have darker barring above and below",
        "habitat: Open country with scattered shrubs and trees is the typical habitat of Loggerhead Shrike, but the species can also be found in more heavily wooded habitats with large openings and in very short habitats with few or no trees"
    ],
    "Northern Shrike": [
        "shape: A fairly large songbird with a thick neck and a large, rounded head with a thick, hooked bill. It has short wings and a long, rounded tail",
        "size: Slightly larger than a Loggerhead Shrike, smaller than a Blue Jay robin-sized",
        "color: Adults are gray birds with black masks and black in the wings and tail. They are paler below, often with faint, fine gray barring. The black mask does not go across the top of the bill. The tail is edged in white and the wings have a white flash, especially noticeable in flight. Juveniles and immatures are brownish with a faint mask, and show more distinct barring below than adults",
        "habitat: Breeds in open parts of the boreal forest (taiga) and along the northern edge where boreal forest gives way to tundra. Winters in and migrates through similar open habitats with a patchwork of small trees and bushes"
    ],
    "White-eyed Vireo": [
        "shape: Small songbird with a thick, straight, and slightly hooked bill. It has a rather compact body and a thick neck",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: This vireo wears yellow spectacles surrounding its white eye. It has yellow-washed sides, a gray head, a white chest and throat, and 2 white wingbars. Young birds have a dark eye that turns white in their first winter or spring",
        "habitat: Found in deciduous scrub, overgrown pastures, old fields, forested edges, second-growth forests, and streamside thickets. In Florida, also uses mangroves"
    ],
    "Bell's Vireo": [
        "shape: A diminutive songbird with a slim build and a slender, somewhat long tail. Its bill is small for a vireo, but still thicker and more hooked than a warbler’s",
        "size: Larger than a kinglet, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Western birds, especially the tiny Least Bell’s Vireo, are grayish above, whitish below, with faint pale “spectacles” around the eyes and pale wingbars. Eastern birds have greenish tones above and a yellow wash on the sides, with stronger wingbars",
        "habitat: For breeding, migrating, and wintering, Bell’s Vireos select low, dense vegetation of many types"
    ],
    "Yellow-throated Vireo": [
        "shape: Yellow-throated Vireos are small songbirds, but they are chunky, with a big head, thick bill, and short tail",
        "size: Larger than a Black-capped Chickadee, smaller than an Eastern Wood-Pewee sparrow-sized or smaller",
        "color: Males and females look as if they are wearing bright yellow spectacles on their olive-green head. The throat and chest match their spectacles, but the lower belly is bright white. Two white bars mark the gray wings",
        "habitat: Breeds in deciduous forests and is often more common near forest edges with an open understory. Winters in a range of habitats from dry tropical forest to rainforest up to 6,000 feet"
    ],
    "Plumbeous Vireo": [
        "shape: A small, sturdy songbird with a fairly thick, short, and slightly hooked bill",
        "size: Larger than a Red-breasted Nuthatch, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Plumbeous Vireos are rich gray above, white below, with bold white “spectacles” (the eyering and lores). The grayish sides can show a hint of yellowish",
        "habitat: Nests in dry coniferous and mixed forests of the mountain West (3,000 to 8,200 feet elevation) and in stream corridors in the Great Basin. Migrants often travel along drainages. Wintering birds in Mexico range from coastal mangroves up to nearly 10,000 feet in pine-oak woodlands"
    ],
    "Cassin's Vireo": [
        "shape: A small but sturdy songbird, with a fairly thick, short bill and relatively long wings and tail",
        "size: Larger than a Red-breasted Nuthatch, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Olive green above with a grayish head and a prominent white eyering and wingbars. White below, with yellow-olive wash on sides. Dark eye, bill, and legs",
        "habitat: Nests in deciduous, coniferous, and mixed forest up to almost 8,000 feet elevation. Migrates through virtually all western forest types. Winters in almost all woodland habitats in Mexico, from mangrove forests at sea level to montane woodlands up to almost 10,000 feet elevation"
    ],
    "Blue-headed Vireo": [
        "shape: A stocky small songbird with medium-length tail and fairly heavy, hooked bill and thick legs (compared to warblers)",
        "size: Larger than a Carolina Chickadee, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: A moss-green bird with a bluish-gray head and crisp white underparts. The face is set off by clean white “spectacles” and throat. Underparts white, sides greenish yellow. Tail and wings blackish, with two white wingbars",
        "habitat: Blue-headed Vireos breed in mature boreal and montane forests of many types; migrants and wintering birds can be found in almost any forested setting but especially those with some understory plants"
    ],
    "Hutton's Vireo": [
        "shape: A small vireo with a large head, short bill, rather short wings, and a moderately long tail",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Cassin’s Vireo sparrow-sized or smaller",
        "color: Grayish olive above, pale gray below (sometimes with pale olive tones to the flanks). The wings are darker with two wingbars. The face shows an incomplete eyering, thicker in front of and behind the eye (similar to the Ruby-crowned Kinglet’s face pattern)",
        "habitat: Lives year-round in evergreen oak, coniferous, and mixed forests, as well as locally in stream corridors and in chaparral on offshore islands"
    ],
    "Warbling Vireo": [
        "shape: Warbling Vireos are small, chunky songbirds with thick, straight, slightly hooked bills. They are medium-sized for vireos, with a fairly round head and medium-length bill and tail",
        "size: Slightly larger than a Black-capped Chickadee; smaller than a House Finch sparrow-sized or smaller",
        "color: Warbling Vireos are gray-olive above and whitish below, washed on the sides and vent with yellow. They have a dark line through the eye and a white line over the eye. The lores (the area between the eye and bill) are white in most individuals. Typically, the brightest plumage on Warbling Vireos is on vent or flanks. Worn midsummer birds can be nearly entirely gray above and whitish below",
        "habitat: Deciduous forest is the favored habitat of Warbling Vireos throughout the year, though they also use some mixed coniferous and deciduous habitats. Even on migration they typically occur in areas with taller trees"
    ],
    "Red-eyed Vireo": [
        "shape: Red-eyed Vireos are large, chunky vireos with a long, angular head, thick neck, and a strong, long bill with a small but noticeable hook at the tip. The body is stocky and the tail fairly short",
        "size: Slightly larger than a Yellow Warbler; slightly smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: Red-eyed Vireos are olive-green above and clean white below with a strong head pattern: a gray crown and white eyebrow stripe bordered above and below by blackish lines. The flanks and under the tail have a green-yellow wash. Adults have red eyes that appear dark from a distance; immatures have dark eyes",
        "habitat: Large expanses of deciduous forest, particularly deciduous trees with large leaves (such as maples), typify Red-eyed Vireo habitat during the breeding season. On migration, look for them in nearly any type of forest, woodland, or woodlot (particularly in deciduous stands). It is often the commonest of vireo migrants"
    ],
    "Gray Jay": [
        "shape: Compact and stocky body with a thick neck, short tail, and a distinctive rounded head.",
        "size: Medium-sized songbird with an average length of approximately 11-12 inches (28-30 cm).",
        "color: Gray overall with a lighter gray head, dark gray wings, and a white throat and belly.",
        "habitat: Boreal forests and mountainous regions."
    ],
    "Steller's Jay": [
        "shape: Steller’s Jays are large songbirds with large heads, chunky bodies, rounded wings, and a long, full tail. The bill is long, straight, and powerful, with a slight hook. Steller’s Jays have a prominent triangular crest that often stands nearly straight up from their head",
        "size: About the same size as a Western Scrub-Jay between robin and crow",
        "color: At a distance, Steller’s Jays are very dark jays, lacking the white underparts of most other species. The head is charcoal black and the body is all blue (lightest, almost sparkling, on the wings). White markings above the eye are fairly inconspicuous",
        "habitat: Look for Steller’s Jays in evergreen forests of western North America, at elevations of 3,000-10,000 feet (lower along the Pacific coast). They’re familiar birds of campgrounds, picnic areas, parks, and backyards"
    ],
    "Blue Jay": [
        "shape: Large crested songbird with broad, rounded tail. Blue Jays are smaller than crows, larger than robins",
        "size: About the same size as a Western Scrub-Jay robin-sized",
        "color: White or light gray underneath, various shades of blue, black, and white above",
        "habitat: Blue Jays are birds of forest edges. A favorite food is acorns, and they are often found near oaks, in forests, woodlots, towns, cities, parks"
    ],
    "Florida Scrub-Jay": [
        "shape: A large and sturdy bird with a long tail and hefty legs. This uncrested jay has a big flat head and a heavy bill",
        "size: Larger than an Eastern Towhee, smaller than an American Crow robin-sized",
        "color: Dull blue overall with a whitish forehead and a pale gray back and belly. Juveniles are grayer overall than adults and lack the adult’s blue head",
        "habitat: Found only in low-growing oak scrub and scrubby flatwoods with sandy soils in Florida. Within these patches of oak scrub, they frequent relatively open areas with bare sandy patches"
    ],
    "Western Scrub-Jay": [
        "shape: Sleek and agile body with a long tail, slender wings, and a pointed bill.",
        "size: Medium-sized jay with an average length of around 11-12 inches (28-30 cm).",
        "color: Bright blue feathers on the head, wings, and tail, with a grayish-brown back and a pale gray underbelly.",
        "habitat: Arid and semi-arid scrublands and oak woodlands."
    ],
    "Mexican Jay": [
        "shape: A large songbird with a robust body, long tail, short neck, heavy, pointed bill, and long, strong legs and feet",
        "size: Slightly larger than a Blue Jay, smaller than an American Crow between robin and crow",
        "color: Adult is cerulean blue above, dingy below, with brown-gray back, dark eye, and dark bill. Juvenile is similar but plumage mostly darker gray; bill has irregular pale base",
        "habitat: Lives year-round in pine-oak-juniper woodlands of the southwestern U.S. and Mexico, from the upper edge of deserts to high mountain ridges up to 11,000 feet"
    ],
    "Clark's Nutcracker": [
        "shape: Clark’s Nutcrackers are the size of a jay but the shape of a crow, with short tails and rounded, crestless heads. The bill is long, straight, and sharp-tipped",
        "size: Smaller than an American Crow; about the size of a Steller’s Jay but more compact between robin and crow",
        "color: Clark’s Nutcrackers are pale gray birds with black wings. In flight, the wings show large white patches along the trailing edges (secondaries). The tail is black in the center with broad white along either side. Nutcrackers have black bills, legs, and feet",
        "habitat: Clark’s Nutcrackers are birds of the mountains. They are closely associated with pines that produce large seeds, such as whitebark pine and limber pine, but are also found in other montane evergreen forests from about 3,000 to more than 11,000 feet in the West"
    ],
    "Black-billed Magpie": [
        "shape: Black-billed Magpies are slightly larger than jays with much longer, diamond-shaped tails and heavier bills. In flight, their wings seem to be too short to support their graceful flight",
        "size: Larger than a jay but smaller than a raven crow-sized",
        "color: These birds are black and white overall with blue-green iridescent flashes in the wing and tail. The upperparts are mostly black with a white patch in the outer wing and two white stripes (“backpack straps”) on the back",
        "habitat: Black-billed Magpies are widespread in towns, fields, and stream corridors of the West. They also concentrate in flocks at feedlots and other areas where food is easy to find"
    ],
    "Yellow-billed Magpie": [
        "shape: A very large songbird with a heavy body, a large head, and an extremely long tail. The bill is stout and slightly curved. The wings are wide and rounded",
        "size: Much larger than a California Scrub-Jay, slightly smaller than an American Crow between robin and crow",
        "color: A black-and-white bird with iridescent blue in the wings and a bright yellow bill. When perched, the shoulders and belly are stark white against the black body. In flight, the primary feathers (in the outer wing) show extensive white as well",
        "habitat: Nests in tall trees in oak savanna or similar habitats of central California. Forages in grassland, pasture, cultivated fields, and orchards, sometimes in trees"
    ],
    "American Crow": [
        "shape: A large, long-legged, thick-necked bird with a heavy, straight bill. In flight, the wings are fairly broad and rounded with the wingtip feathers spread like fingers. The short tail is rounded or squared off at the end",
        "size: Nearly twice the size of a Blue Jay; about two-thirds the size of a Common Raven crow-sized",
        "color: American Crows are all black, even the legs and bill. When crows molt, the old feathers can appear brownish or scaly compared to the glossy new feathers",
        "habitat: American Crows are common birds of fields, open woodlands, and forests. They thrive around people, and you’ll often find them in agricultural fields, lawns, parking lots, athletic fields, roadsides, towns, and city garbage dumps"
    ]
}