{
    "Sooty Albatross": {
        "Shape": [
            "Graceful winged beauty"
        ],
        "Size": [
            "The Sooty Albatross is relatively large among birds, with a wingspan exceeding most other species."
        ],
        "Color": [
            "Steel-gray elegance with a touch of charcoal"
        ],
        "Habitat": [
            "Remote Southern Ocean Islands"
        ]
    },
    "Crested Auklet": {
        "Shape": [
            "Plump and crested diver"
        ],
        "Size": [
            "The Crested Auklet is of medium size compared to other birds, falling between smaller and larger species in terms of size."
        ],
        "Color": [
            "Vibrant plumage adorned in snowy white and charcoal black, crowned with a splash of golden feathers"
        ],
        "Habitat": [
            "Coastal Arctic Seabird Colonies"
        ]
    },
    "Least Auklet": {
        "Shape": [
            "Tiny and compact seabird"
        ],
        "Size": [
            "The Least Auklet is relatively small among birds, typically measuring smaller in size compared to many other species."
        ],
        "Color": [
            "Subtle shades of smoky gray with hints of pale lavender, wrapped in a velvety cloak"
        ],
        "Habitat": [
            "Rocky Arctic Coastal Islands"
        ]
    },
    "Cardinal": {
        "Shape": [
            "Small, stocky songbird with a distinctive crest"
        ],
        "Size": [
            "The Cardinal is relatively small among birds, typically smaller in size compared to many other species."
        ],
        "Color": [
            "Bold and fiery red, reminiscent of flickering flames amidst the emerald green"
        ],
        "Habitat": [
            "Wooded Forests and Gardens"
        ]
    },
    "Spotted Catbird": {
        "Shape": [
            "Sleek and slender songbird with spotted plumage"
        ],
        "Size": [
            "The Spotted Catbird is of medium size compared to other birds, falling between smaller and larger species in terms of size."
        ],
        "Color": [
            "Glossy obsidian feathers with a scatter of vibrant spots, like stardust on a moonlit night"
        ],
        "Habitat": [
            "Tropical Rainforests of Australia"
        ]
    },
    "European Goldfinch": {
        "Shape": [
            "Elegantly slender and compact songbird"
        ],
        "Size": [
            "The European Goldfinch is relatively small among birds, typically smaller in size compared to many other species."
        ],
        "Color": [
            "Splashes of sunshine embodied in a lively tapestry of bright yellow, contrasting with a dashing jet black cap"
        ],
        "Habitat": [
            "Open Woodlands and Farmland"
        ]
    },
    "Slaty-backed Gull": {
        "Shape": [
            "Robust and powerful seabird"
        ],
        "Size": [
            "The Slaty-backed Gull is relatively large among birds, often surpassing many other species in terms of size."
        ],
        "Color": [
            "Slate-gray majesty kissed by the ocean's mist, commanding the skies with its noble presence"
        ],
        "Habitat": [
            "Coastal Shorelines and Rocky Islands"
        ]
    },
    "Green Violetear": {
        "Shape": [
            "Graceful and elongated hummingbird"
        ],
        "Size": [
            "The Green Violetear is of medium size among birds, falling between smaller and larger species in terms of size."
        ],
        "Color": [
            "Iridescent emerald enchantment, adorned with hints of amethyst, fluttering through the foliage like a living gem"
        ],
        "Habitat": [
            "Tropical Montane Forests and Gardens"
        ]
    },
    "Pied Kingfisher": {
        "Shape": [
            "Sleek and streamlined fisher with a distinctive beak"
        ],
        "Size": [
            "The Pied Kingfisher is relatively small among birds, typically smaller in size compared to many other species."
        ],
        "Color": [
            "Monochrome elegance with a touch of regal grace, sporting a crisp black-and-white ensemble"
        ],
        "Habitat": [
            "Rivers, Lakes, and Coastal Areas"
        ]
    },
    "White-breasted Kingfisher": {
        "Shape": [
            "Compact and stout kingfisher with a prominent white breast"
        ],
        "Size": [
            "The White-breasted Kingfisher is of medium size among birds, falling between smaller and larger species in terms of size."
        ],
        "Color": [
            "Rich azure blue and pristine white, a harmonious fusion of sky and purity"
        ],
        "Habitat": [
            "Wooded Areas and Wetlands"
        ]
    },
    "Red-legged Kittiwake": {
        "Shape": [
            "Slender and agile seabird with vibrant red legs"
        ],
        "Size": [
            "The Red-legged Kittiwake is relatively small among birds, typically smaller in size compared to many other species."
        ],
        "Color": [
            "Arctic beauty in black and white, accentuated by vibrant coral-red legs, a splash of color amidst the icy landscape"
        ],
        "Habitat": [
            "Arctic Cliffs and Coastal Breeding Sites"
        ]
    },
    "Mockingbird": {
        "Shape": [
            "Sleek and slender mimic with a long tail"
        ],
        "Size": [
            "The Mockingbird is of medium size among birds, falling between smaller and larger species in terms of size."
        ],
        "Color": [
            "Pearlescent gray adorned with a medley of subtle earth tones, embodying the artistry of nature's mimicry"
        ],
        "Habitat": [
            "Diverse Habitat: Woodlands, Scrublands, and Urban Areas"
        ]
    },
    "White Pelican": {
        "Shape": [
            "Majestic and robust water bird with a large bill and expansive wings"
        ],
        "Size": [
            "The White Pelican is relatively large among birds, often surpassing many other species in terms of size."
        ],
        "Color": [
            "Crisp and pristine, draped in snowy white feathers, a vision of pure elegance soaring above the waters"
        ],
        "Habitat": [
            "Large Inland Lakes and Wetlands"
        ]
    },
    "Sayornis": {
        "Shape": [
            "Sparrow-sized flycatcher with a sleek and slender body"
        ],
        "Size": [
            "The Sayornis, commonly known as the Phoebe, is of medium size among birds, falling between smaller and larger species in terms of size."
        ],
        "Color": [
            "Soft and understated, with a dusty olive-brown back and a touch of pale yellow adorning its belly"
        ],
        "Habitat": [
            "Riparian Zones and Open Wooded Areas"
        ]
    },
    "White-necked Raven": {
        "Shape": [
            "Impressive and stout raven with a distinctive white neck"
        ],
        "Size": [
            "The White-necked Raven is relatively large among birds, often surpassing many other species in terms of size."
        ],
        "Color": [
            "Dark and mysterious ebony plumage crowned by a striking snowy white collar, an enigmatic contrast in the avian realm"
        ],
        "Habitat": [
            "Semi-arid and Desert Regions with Scattered Vegetation"
        ]
    },
    "Geococcyx": {
        "Shape": [
            "Slender and long-legged cuckoo with a prominent crest"
        ],
        "Size": [
            "The Geococcyx, commonly known as the Roadrunner, is of medium size among birds, falling between smaller and larger species in terms of size."
        ],
        "Color": [
            "Warm desert hues embraced by sandy brown feathers, blending harmoniously with the arid landscape"
        ],
        "Habitat": [
            "Arid Desert and Scrubland Regions"
        ]
    },
    "Great-Grey Shrike": {
        "Shape": [
            "Compact and predatory songbird with a hooked bill"
        ],
        "Size": [
            "The Great Grey Shrike is relatively small among birds, typically smaller in size compared to many other species."
        ],
        "Color": [
            "A dapper predator in charcoal gray, with a crisp white chest and a mask of black highlighting its fierce gaze"
        ],
        "Habitat": [
            "Open Grasslands and Savannas with Scattered Trees"
        ]
    },
    "Tree Sparrow": {
        "Shape": [
            "Small and plump sparrow with a short tail and sturdy build"
        ],
        "Size": [
            "The Tree Sparrow is of small to medium size among birds, falling between smaller and larger species in terms of size."
        ],
        "Color": [
            "A delicate blend of earthy tones, featuring warm cinnamon-brown feathers accented with subtle streaks of black and cream"
        ],
        "Habitat": [
            "Farmlands, Hedgerows, and Open Woodlands"
        ]
    },
    "Cape-Glossy Starling": {
        "Shape": [
            "Sleek and glossy songbird with a slender body and long tail"
        ],
        "Size": [
            "The Cape Glossy Starling is of medium size among birds, falling between smaller and larger species in terms of size."
        ],
        "Color": [
            "Metallic sapphire iridescence, with a glossy sheen of deep blue, purple, and green, radiating opulent allure"
        ],
        "Habitat": [
            "Wooded Savannahs and Forest Edges"
        ]
    },
    "Myrtle Warbler": {
        "Shape": [
            "Small and agile warbler with a rounded body and pointed beak"
        ],
        "Size": [
            "The Myrtle Warbler is relatively small among birds, typically smaller in size compared to many other species."
        ],
        "Color": [
            "A lively composition of vibrant yellow, contrasting with jet black stripes, as if painted with the colors of sunshine and shadows"
        ],
        "Habitat": [
            "Boreal Forests and Coniferous Woodlands"
        ]
    }
}