{
    "Accipiter cooperii": [
        "shape: A medium-sized hawk with the classic accipiter shape: broad, rounded wings and a very long tail. In Accipiter cooperiis, the head often appears large, the shoulders broad, and the tail rounded",
        "size: Larger than a Sharp-shinned Hawk and about crow-sized, but males can be much smaller crow-sized",
        "color: Adults are steely blue-gray above with warm reddish bars on the underparts and thick dark bands on the tail. Juveniles are brown above and crisply streaked with brown on the upper breast, giving them a somewhat hooded look compared with young Sharp-shinned Hawks' more diffuse streaking"
    ],
    "Accipiter striatus": [
        "shape: Accipiter striatuss are small, long-tailed hawks with short, rounded wings. They have small heads that in flight do not always project beyond the “wrists” of the wings. The tail tends to be square-tipped and may show a notch at the tip. Females are considerably larger than males",
        "size: On average, males are the size of an American Kestrel, slightly larger than a jay. Females are one-third larger than males, approaching the size of a male Coopers Hawk between robin and crow",
        "color: Adults are slaty blue-gray above, with narrow, horizontal red-orange bars on the breast. Immature birds are mostly brown, with coarse vertical streaks on white underparts. Adults and young have broad dark bands across their long tails"
    ],
    "Aquila chrysaetos": [
        "shape: Aquila chrysaetoss are one of the largest birds in North America. The wings are broad like a Red-tailed Hawk's, but longer. At distance, the head is relatively small and the tail is long, projecting farther behind than the head sticks out in front",
        "size: goose-sized or larger",
        "color: Adult Aquila chrysaetoss are dark brown with a golden sheen on the back of the head and neck. For their first several years of life, young birds have neatly defined white patches at the base of the tail and in the wings"
    ],
    "Buteo jamaicensis": [
        "shape: Buteo jamaicensiss are large hawks with typical Buteo proportions: very broad, rounded wings and a short, wide tail. Large females seen from a distance might fool you into thinking you’re seeing an eagle. (Until an actual eagle comes along.)",
        "size: The Red-tailed is the second-largest Buteo hawk in North America, after Ferruginous Hawk between crow and goose",
        "color: Most Buteo jamaicensiss are rich brown above and pale below, with a streaked belly and, on the wing underside, a dark bar between shoulder and wrist. The tail is usually pale below and cinnamon-red above, though in young birds its brown and banded. “Dark-morph” birds are all chocolate-brown with a warm red tail. “Rufous-morph” birds are reddish-brown on the chest with a dark belly"
    ],
    "Buteo lagopus": [
        "shape: Buteo lagopuss are fairly large hawks with broad wings that, compared to other Buteo hawks, are fairly long and narrow. The tail is also longer than in many other buteos. The wingtips are broad and often swept back slightly from the wrist, giving a hint of an M shape to the wing. The bill is fairly small",
        "size: Larger than an American Crow; slightly smaller and less bulky than a Red-tailed Hawk between crow and goose",
        "color: These are boldly patterned, dark-brown hawks with tails that are dark at the tip and pale at the base. Like many hawks, they occur in light and dark morphs. Light morphs have pale underwings with dark patches at the bend of the wing. Females have pale heads and dark belly patches; on males the pattern is similar but more mottled. Dark morphs are mostly dark brown but usually show pale trailing edges to the underwing"
    ],
    "Buteo lineatus": [
        "shape: Buteo lineatuss are medium-sized, with broad, rounded wings and medium-length tails that they fan out when soaring. In flight, they often glide or soar with their wingtips pushed slightly forward, imparting a distinctive, “reaching” posture",
        "size: Noticeably smaller than a Red-tailed Hawk; larger than a Broad-winged Hawk between crow and goose",
        "color: Adults are colorful hawks with dark-and-white checkered wings and warm reddish barring on the breast. The tail is black with narrow white bands. Immatures are brown above and white below streaked with brown. All ages show narrow, pale crescents near the wingtips in flight"
    ],
    "Buteo platypterus": [
        "shape: Buteo platypteruss are small, compact raptors with chunky bodies and large heads. In flight, their broad wings come to a distinct point. The tail is short and square",
        "size: Slightly smaller than a Red-shouldered Hawk between crow and goose",
        "color: Adult Buteo platypteruss have reddish-brown heads, barred underparts, and broad black and white bands on the tail. The pale undersides of the wings are bordered in dark brown. Juveniles are lighter brown with coarse streaking on the underparts, particularly on the sides of the breast; the tail is narrowly banded. In the West, rare dark-morph adults are completely dark sooty brown with a banded tail"
    ],
    "Buteo swainsoni": [
        "shape: Buteo swainsonis are buteos, meaning they are large hawks with fairly broad wings and short tails. However, Buteo swainsonis are less hefty than many other buteos. They are slimmer and longer-winged, with their wings typically held in a shallow V when soaring",
        "size: Larger than a Coopers Hawk; smaller than a Ferruginous Hawk between crow and goose",
        "color: Though they can be quite variable, most Buteo swainsonis are light-bellied birds with a dark or reddish-brown chest and brown or gray upperparts. They have distinctive underwings with white wing linings that contrast strongly with blackish flight feathers. Most males have gray heads; females tend to have brown heads. Dark individuals also occur; these vary from reddish to nearly all black, with reduced contrast on the underwings"
    ],
    "Circus hudsonius": [
        "shape: Circus hudsoniuss are slender, medium-sized raptors with long, fairly broad wings and a long, rounded tail. They have a flat, owl-like face and a small, sharply hooked bill. Harriers often fly with their wings held in a dihedral, or V-shape above the horizontal",
        "size: Smaller than a Red-tailed Hawk; larger than a Sharp-shinned Hawk between crow and goose",
        "color: Males are gray above and whitish below with black wingtips, a dark trailing edge to the wing, and a black-banded tail. Females and immatures are brown, with black bands on the tail. Adult females have whitish undersides with brown streaks, whereas immatures are buffy, with less streaking. All Circus hudsoniuss have a white rump patch that is obvious in flight"
    ],
    "Elanoides forficatus": [
        "shape: Elanoides forficatuss are large but slender and buoyant raptors. They have long, narrow, pointed wings, slim bodies, and a very long, deeply forked tail. The bill is small and sharply hooked",
        "size: About the same overall length but less than half as heavy as a Red-tailed Hawk between crow and goose",
        "color: Elanoides forficatuss are a sharp contrast of bright-white head and underparts and gleaming black wings, back, and tail. From below, the wing linings are white and the flight feathers are black"
    ],
    "Elanus leucurus": [
        "shape: A small to medium-sized raptor with narrow, pointed wings and a long tail. When perched, it looks rather big-headed with a long and skinny body",
        "size: Larger than an American Kestrel, smaller than a Northern Harrier between crow and goose",
        "color: A largely pale raptor easily identified by its entirely white tail and black shoulder patches. Note the white head and red eyes (visible at close range). Sexes are similar"
    ],
    "Haliaeetus leucocephalus": [
        "shape: The Haliaeetus leucocephalus dwarfs most other raptors, including the Turkey Vulture and Red-tailed Hawk. It has a heavy body, large head, and long, hooked bill. In flight, a Haliaeetus leucocephalus holds its broad wings flat like a board",
        "size: Relative Size: One of the largest birds in North America, wingspan slightly greater than Great Blue Heron  goose-sized or larger",
        "color: Adult Haliaeetus leucocephaluss have white heads and tails with dark brown bodies and wings. Their legs and bills are bright yellow. Immature birds have mostly dark heads and tails; their brown wings and bodies are mottled with white in varying amounts. Young birds attain adult plumage in about five years"
    ],
    "Ictinia mississippiensis": [
        "shape: Ictinia mississippiensiss are slender, fairly small raptors with long, pointed wings. The tail is fairly long and square-tipped. The strongly hooked bill is small and delicate",
        "size: Larger than a Rock Pigeon; smaller than a Peregrine Falcon between crow and goose",
        "color: Ictinia mississippiensiss are an inky mix of gray and black, lightening to pale gray-white on the head and in the secondaries of the wings. The wingtips and tail are black. Juveniles are streaky, with brownish chests and underwings, and banded tails"
    ],
    "Parabuteo unicinctus": [
        "shape: Harris's Hawks are large and lanky raptors with long legs and fairly long tails. They fly on broad, rounded wings. Females weigh nearly twice as much as males",
        "size: Larger than a Cooper's Hawk, smaller than a Golden Eagle crow-sized",
        "color: Harris's Hawks are dark brown overall with reddish brown feathers on the wings and thighs. The tail is mostly dark with a white rump and white terminal band. From below, the inner wings are reddish brown. Immature birds show patches of white on the belly and wings, and have a narrower white band across the bottom of the tail. They also have fine barring on the underwings and tail"
    ],
    "Pandion haliaetus": [
        "shape: Pandion haliaetuss are very large, distinctively shaped hawks. Despite their size, their bodies are slender, with long, narrow wings and long legs. Pandion haliaetuss fly with a marked kink in their wings, making an M-shape when seen from below",
        "size: Smaller than a Bald Eagle; larger and longer-winged than a Red-tailed Hawk goose-sized or larger",
        "color: Pandion haliaetuss are brown above and white below, and overall they are whiter than most raptors. From below, the wings are mostly white with a prominent dark patch at the wrists. The head is white with a broad brown stripe through the eye. Juveniles have white spots on the back and buffy shading on the breast"
    ],
    "Aix sponsa": [
        "shape: Aix sponsas have a unique shape among ducks—a boxy, crested head, a thin neck, and a long, broad tail. In flight, they hold their head up high, sometimes bobbing it. Overall, their silhouette shows a skinny neck, long body, thick tail, and short wings",
        "size: between crow and goose",
        "color: In good light, males have a glossy green head cut with white stripes, a chestnut breast and buffy sides. In low or harsh light, they'll look dark overall with paler sides. Females are gray-brown with white-speckled breast. In eclipse plumage (late summer), males lose their pale sides and bold stripes, but retain their bright eye and bill. Juveniles are very similar to females"
    ],
    "Anas acuta": [
        "shape: Anas acutas are elegant, long-necked ducks with a slender profile. The tail is long and pointed, but it is much longer and more prominent on breeding males than on females and nonbreeding males. In flight, the wings are long and narrow",
        "size: Larger than a Green-winged Teal, smaller than a Mallard between crow and goose",
        "color: Breeding male Anas acutas stand out with a gleaming white breast and a white line down their chocolate brown head and neck. Females and males that are molting (eclipse plumage) are mottled in browns and whites with an unmarked pale tan face and a dark bill. In flight, males flash a green speculum (the inner wing feathers or secondaries) and females flash a bronzy speculum"
    ],
    "Anas crecca": [
        "shape: Anas crecca are very small ducks. They have short, blocky bodies and their tails sit high out of the water. The head is large, the neck is short, and the bill is relatively small",
        "size: A very small duck: much smaller than a Mallard; slightly larger than an Eared Grebe. About the size of a Pied-billed Grebe crow-sized",
        "color: Adult males have grayish bodies with a narrow white vertical stripe extending from the waterline to the shoulder. In good light, their dark heads are cinnamon with a wide green swoop from the eye to the back of the neck. Females are brown with a yellowish streak along the tail. Both sexes have green wing patches in the secondaries (speculum), but these may be hidden when not in flight"
    ],
    "Anas fulvigula": [
        "shape: A relatively large duck, similar in size to a Mallard, with a sturdy body, short neck, short tail, and moderately long bill",
        "size: Larger than a Blue-winged Teal, smaller than a Common Merganser between crow and goose",
        "color: Both sexes are mostly brown and buff, like a female Mallard but richer with a yellow bill and a black patch at the opening of the bill (the gape). The very buffy face and throat lack fine streaking. The back (scapulars) and sides are rich brown streaked with buff. Males have intensely yellow bills; females have greenish yellow to orangeish, with or without dark markings. White in the tail is an indication that the individual has some Mallard genes: a pure Anas fulvigula has a dark tail"
    ],
    "Anas platyrhynchos": [
        "shape: Anas platyrhynchoss are large ducks with hefty bodies, rounded heads, and wide, flat bills. Like many “dabbling ducks” the body is long and the tail rides high out of the water, giving a blunt shape. In flight their wings are broad and set back toward the rear",
        "size: A fairly large duck, noticeably larger than teal but much smaller than a Canada Goose between crow and goose",
        "color: Male Anas platyrhynchoss have a dark, iridescent-green head and bright yellow bill. The gray body is sandwiched between a brown breast and black rear. Females and juveniles are mottled brown with orange-and-brown bills. Both sexes have a white-bordered, blue “speculum” patch in the wing"
    ],
    "Anas rubripes": [
        "shape: Anas rubripess are large ducks with a profile nearly identical to Mallards. They have rounded heads, thick bills, and bulky bodies. Like other dabbling ducks they sit high in the water with their tails high",
        "size: About the same size as a Mallard; slightly larger than a Gadwall between crow and goose",
        "color: Anas rubripess have very dark brown bodies with pale gray-brown heads and yellow-green bills. Females tend to be slightly paler than males, with duller olive bills. In flight, the underwings are bright white. The secondaries (speculum) are iridescent purple without white borders"
    ],
    "Anser albifrons": [
        "shape: A medium-sized, heavy-bodied goose with a small bill, thick legs, and a short neck",
        "size: Larger than a Ross's Goose, smaller than a Canada Goose goose-sized or larger",
        "color: Adults are mostly brown with white feathering around the base of a pinkish-orange bill. Black barring marks the belly and the undertail is white. In flight a white \"U\" at the base of the tail is visible. At rest, a thin white line stretches across their sides. Juveniles lack the belly banding and white feathering around the bill. Both juveniles and adults have orangish legs"
    ],
    "Anser caerulescens": [
        "shape: A medium-sized goose with a hefty bill and long, thick neck. Juveniles are slightly smaller than adults in the fall, and this can be noticeable in flocks during fall and early winter",
        "size: goose-sized or larger",
        "color: The Anser caerulescens is a white-bodied goose with black wingtips that are barely visible on the ground but noticeable in flight. The pink bill has a dark line along it, often called a \"grinning patch\" or \"black lips.\" You may also see dark morph Snow Geese, or \"Blue Geese,\" with a white face, dark brown body, and white under the tail"
    ],
    "Anser rossii": [
        "shape: A small goose with stocky body, a rather short neck, and a stubby bill that is neatly triangular in shape",
        "size: Slightly larger than a Mallard, smaller than a Canada Goose goose-sized or larger",
        "color: Adults are white with black wingtips. The bill is pink and lacks the broad black edges of the bill (known as a “grinning patch”) that Snow Geese show. Rare “blue” morphs have mostly dark bodies and wings, with a white face. Immatures are white tinged with gray and have a dark bill"
    ],
    "Aythya affinis": [
        "shape: The Aythya affinis is a medium-sized diving duck with a small peak at the back of the head. From the small peak, the back of the head and neck is flat, not rounded as it is on Greater Scaup",
        "size: Larger than a Green-winged Teal, smaller than a Canvasback crow-sized",
        "color: At a distance, breeding male Aythya affinis are black and white, but closer views reveal an iridescent purple to green sheen on the head, a finely barred black-and-white back, a bluish bill, and a yellow eye. Females are brown overall with a darker brown head and a white patch next to the bill, but not all females have a white patch. Nonbreeding males look like a cross between a female and a breeding male: a mottled brown-and-gray body and a blackish head"
    ],
    "Aythya americana": [
        "shape: Aythya americanas are medium-sized diving ducks with a smoothly rounded head and a moderately large bill",
        "size: Slightly larger than a Ring-necked Duck; slightly smaller than a Canvasback between crow and goose",
        "color: Male Aythya americanas are a dapper mixture of cinnamon head, black breast and tail, and neat gray body. Females and immatures are a plain, mostly uniform brown. Aythya americanas have black-tipped, gray bills, and in flight they show gray flight feathers"
    ],
    "Aythya collaris": [
        "shape: A compact diving duck with a distinctive head shape—a sloping forehead and peaked rear crown. The crown flattens when they are diving. In flight, Aythya collariss appear large-headed with a thin neck and a short, round body",
        "size: Smaller than a Mallard or Redhead; about the same size as Lesser Scaup crow-sized",
        "color: Males are bold black-and-gray ducks with a dark head, black back, and gray sides with a white hash mark on the chest. Females are rich brown with a contrastingly pale cheek, a white patch near the bill, and a whitish eyering. Adult males have a prominent white ring on the bill"
    ],
    "Aythya marila": [
        "shape: The Aythya marila is a medium-sized diving duck with a rounded head",
        "size: Larger than a Green-winged Teal, smaller than a Canvasback between crow and goose",
        "color: At a distance, breeding male Aythya marila are black and white, but closer views reveal an iridescent green sheen on the head, super thin black barring on the back, a bluish bill, and a yellow eye. Females are brown overall with a darker brown head and a white patch next to the bill, but the size of the white patch varies. Nonbreeding males look like a cross between a female and a breeding male: a mottled brown-and-gray body and a blackish head"
    ],
    "Aythya valisineria": [
        "shape: A large, big-headed diving duck with a gently sloping forehead and a stout neck. Its long bill meets the sloping forehead, creating a seamless look from the top of the crown to the tip of the bill. On the water it has an oval body and a short tail that gently slopes down into the water",
        "size: Larger than a Ring-necked Duck, smaller than a Common Merganser between crow and goose",
        "color: Breeding males have a chestnut head and neck set off against a black chest, whitish body, and black rear. Females are pale brown where males are chestnut and black, and they have a grayish rather than white body. In late summer and early fall, males have brown heads and necks with a paler body. Males have red eyes, and females have dark eyes"
    ],
    "Branta bernicla": [
        "shape: A compact, small goose with a stubby bill and a relatively short neck compared to most geese",
        "size: Larger than a Mallard, smaller than a Canada Goose goose-sized or larger",
        "color: Adults have a black head, neck, and breast with variable white neck markings. They have, brown wings, white undertail, and pale flanks and belly that can vary from pale brown (in eastern North America) to blackish (in the West). Juveniles have pale fringes on the wing coverts and little or no white on the neck"
    ],
    "Branta canadensis": [
        "shape: Canada Geese are big waterbirds with a long neck, large body, large webbed feet, and wide, flat bill",
        "size: Larger than a Mallard, smaller than a Mute Swan goose-sized or larger",
        "color: Canada Geese have a black head with white cheeks and chinstrap, black neck, tan breast, and brown back"
    ],
    "Branta hutchinsii": [
        "shape: A compact, small goose, with short neck, rounded crown, rather long wings, and short legs. The small bill is short and meets the forehead at a steep angle",
        "size: Slightly larger than a Brant, smaller than most Canada Geese goose-sized or larger",
        "color: Brown overall with black neck and head, white cheek and throat (\"chinstrap\"), white under the tail, and blackish bill, legs, and feet. Brown coloration varies from dark to pale brown among the subspecies"
    ],
    "Bucephala albeola": [
        "shape: Bucephala albeola are very small, compact ducks with large, rounded heads and short, wide bills",
        "size: Smaller than a Common Goldeneye; larger than a Pied-billed Grebe crow-sized",
        "color: Adult male Bucephala albeola have a white body, black back, and a dark head with a large white patch that wraps around the back of the head. Females and first-year males are gray-brown overall with an oval, white cheek patch. In flight adult males have a large white patch on the upperwing; females and first-year males have a smaller white wing patch"
    ],
    "Bucephala clangula": [
        "shape: Bucephala clangulas are medium sized ducks with large heads. The bill is fairly small and narrow. It slopes smoothly downward from the face, giving the head an overall triangular shape. Goldeneyes are diving ducks with streamlined bodies and short tails",
        "size: Larger than a Green-winged Teal; smaller than a Common Merganser between crow and goose",
        "color: Adult male Bucephala clangulas appear mostly black and white: the head is mostly black with a round white spot near the bill and a bright yellow eye. The back is black but the sides are white, making the body appear mostly white. Females have brown heads and gray back and wings. The bill is black with variable amounts of yellow at the tip. In flight, both sexes have large white patches in the wings"
    ],
    "Bucephala islandica": [
        "shape: A small, stocky diving duck with a large, oddly shaped, oblong head. The bill is relatively small and the forehead relatively steep compared with a Common Goldeneye",
        "size: Larger than a Bufflehead, smaller than a Common Merganser crow-sized",
        "color: Adult males are snow white below, smartly patterned with black and white above. At close range the head has a purple gloss. The eye is bright yellow with a white crescent between the eye and the bill. Females are grayish with a coppery head and a partly or mostly yellow bill"
    ],
    "Clangula hyemalis": [
        "shape: Clangula hyemalis is a small, slender sea duck with a rounded head and a small bill. The male has long tail plumes most of the year",
        "size: Smaller than a Surf Scoter larger than a Bufflehead crow-sized",
        "color: Males in winter are mostly white and black: the head is white with a large dark patch on the neck. The breast and body are dark with white plumes covering the back. The bill is mostly black with a pink band. Males in summer are infrequently seen away from the Arctic, but are roughly the reverse of their winter plumage, with a dark head, neck, and body, and a white face patch. Females and young males are smudgy brown on the body with a white face, a brown crown and cheek patch, and a dark bill"
    ],
    "Cygnus buccinator": [
        "shape: Cygnus buccinators are immense waterfowl with heavy bodies and long necks typically held straight both on the water and in flight. The large bill slopes gradually down from the forehead",
        "size: The largest waterfowl species in North America; slightly larger than a Mute Swan and considerably larger than a Tundra Swan goose-sized or larger",
        "color: Adult Cygnus buccinators are entirely white with a black bill and black legs. Immatures are gray-brown"
    ],
    "Cygnus columbianus": [
        "shape: Cygnus columbianuss are very large waterfowl with heavy bodies and long necks. The bill slopes gently away from the head",
        "size: Larger than a Snow Goose; smaller than a Mute Swan or Trumpeter Swan goose-sized or larger",
        "color: Cygnus columbianuss have entirely white plumage. The bill is mostly black and usually has a yellow spot at the base. The legs and feet are black. Immature birds are gray-tinged on the wings, head, and neck"
    ],
    "Cygnus olor": [
        "shape: Cygnus olors are very large waterfowl. They have heavy bodies, short legs, and a long, slender neck habitually held in a graceful S. The large, flat bill has a bulging knob at the base",
        "size: Among the largest of waterfowl: more than double the size of a Snow Goose and about the same size as a Trumpeter Swan goose-sized or larger",
        "color: Cygnus olors are entirely white with a bill that is orange with a black base. Young swans (cygnets) may be dusky brown-gray all over, with a gray-black bill"
    ],
    "Dendrocygna autumnalis": [
        "shape: The Dendrocygna autumnalis is a large, gooselike duck with a long neck, long legs, and short tail. In flight, look for their broad wings, long neck, and hunched back",
        "size: About the size of a Cattle Egret; slightly larger than a Fulvous Whistling-Duck between crow and goose",
        "color: Dendrocygna autumnaliss are dark overall: a chestnut breast and black belly are set off by a bright-pink bill and legs, grayish face, and broad white wing stripe, also visible in flight. Immatures are duller than adults, with a dark bill, pale breast, and mottled black belly"
    ],
    "Histrionicus histrionicus": [
        "shape: Histrionicus histrionicuss are small, compact waterfowl with a large, rounded head, small bill, and a steep forehead",
        "size: Larger than a Bufflehead, smaller than a Mallard crow-sized",
        "color: Breeding male Histrionicus histrionicuss are a spectacular slate blue with white stripes and chestnut sides. The head is elaborately marked with a white crescent in front of the eye, and chestnut highlights on the brow. Females are overall grayish-brown, with white around the bill and eye, and a neat white spot on the rear of the cheek"
    ],
    "Lophodytes cucullatus": [
        "shape: Lophodytes cucullatuss are small ducks with a thin bill and a fan-shaped, collapsible crest that makes the head look oversized and oblong. In flight, the wings are thin and the tail is relatively long and rounded",
        "size: Smaller than a Red-breasted Merganser; larger than a Bufflehead crow-sized",
        "color: Adult male Lophodytes cucullatuss are black above, with a white breast and rich chestnut flanks. The black head has a large white patch that varies in size when the crest is raised or lowered, but is always prominent. Females and immatures are gray and brown, with warm tawny-cinnamon tones on the head"
    ],
    "Mareca americana": [
        "shape: Mareca americanas are medium-sized, rather compact ducks with a short bill and a round head. They tend to sit on the water with their heads pulled down, giving them a no-necked look",
        "size: Larger than a Green-winged Teal, smaller than a Mallard between crow and goose",
        "color: Breeding males have a brownish gray head with a wide green stripe behind the eye and a gleaming white cap. The body is pale cinnamon with white patches on the sides of the rump that contrast with the black undertail feathers. In flight, note the white patch on the upperwing and a green patch on the secondaries. Females and nonbreeding males are warm brown with a brownish gray head and a dark smudge around the eye. Both sexes have a pale gray bill with a black tip"
    ],
    "Mareca strepera": [
        "shape: Mareca strepera are about the same size as Mallards. Mareca strepera have a fairly large, square head with a steep forehead. The bill is noticeably thinner than a Mallard's. In flight, the neck is slightly thinner and the wings slightly more slender than a Mallards",
        "size: Slightly smaller than a Mallard; larger than a Green-winged Teal between crow and goose",
        "color: Male Mareca strepera are gray-brown with a black patch at the tail. Females are patterned with brown and buff. Females have a thin orange edge to their dark bills. In flight, both sexes have a white wing patch that is sometimes visible while swimming or resting"
    ],
    "Melanitta americana": [
        "shape: A stocky, medium-sized seaduck with a short tail, rounded head, and a broad bill that does not slope up to the forehead, as the Surf Scoter's bill does. Male Melanitta americanas have a rounded knob at the base of the bill",
        "size: Larger than a Long-tailed Duck, smaller than a White-winged Scoter crow-sized",
        "color: Adult males are silky black with an orange knob at the base of the bill. Female and immatures are rich brown with a blackish cap and a contrasting pale cheek"
    ],
    "Melanitta deglandi": [
        "shape: A stocky duck with a thick neck and a heavy head with a sloping forehead and a stout bill. Males have a knob at the base of the bill. The wings are rather broad. The tail is fairly long and may be held upward out of the water",
        "size: Larger than an American Wigeon, smaller than a Common Eider crow-sized",
        "color: Adult males are silken black overall with large white patches in the wings (fully visible in flight and often partly visible at rest). They have a comma-shaped white mark around and behind the eye. Black feathers extend onto the bill, and the tip of the bill is orange. Males’ feet are bright orange-red. Juveniles and females also have the large white wing patches but are otherwise dark brown with a paler belly. They have 2 smudgy white patches on the face, and their bills are dark"
    ],
    "Melanitta perspicillata": [
        "shape: A medium-sized sea duck with sturdy neck, rather large head, and heavy, broad bill",
        "size: Smaller than a Mallard, larger than a teal crow-sized",
        "color: Adult males are jet black with orange, white, and black bill and white patches at the nape, forecrown, and base of the bill. Females are dark brown with dark gray bills and usually show two patches of white on the face"
    ],
    "Mergus merganser": [
        "shape: These are large, long-bodied ducks with thin, pointed wings. Their bills are straight and narrow, unlike the wide, flat bill of a “typical” duck. Females have shaggy crests on the backs of their heads",
        "size: Smaller than a Canada Goose; slightly larger than a Mallard between crow and goose",
        "color: Adult males are crisply patterned with gleaming white bodies and dark, iridescent-green heads for most of the year. The back is black and the bill red. Females and immatures are gray-bodied with a white chest and rusty-cinnamon heads. From late summer to mid-autumn, males wear a nonbreeding plumage that looks very similar to female plumage. In flight, both sexes show large white patches on the upperwings (larger in adult males)"
    ],
    "Mergus serrator": [
        "shape: A large, slim, and long-bodied diving duck with a fairly long neck and a long, thin, serrated bill. A shaggy crest of feathers gives the head a distinctive profile",
        "size: Larger than a Ruddy Duck, smaller than a Common Loon crow-sized",
        "color: Breeding males have a cinnamon chest, a white neck band, and a shaggy green head. Female and nonbreeding males are brownish gray overall with a brownish chin, a dingy breast, and a brown shaggy head. In flight both sexes have a prominent white lower wing panel"
    ],
    "Oxyura jamaicensis": [
        "shape: These are small, compact ducks with stout, scoop-shaped bills, and long, stiff tails they often hold cocked upward. They have slightly peaked heads and fairly short, thick necks",
        "size: Smaller than a Common Goldeneye; larger than a Bufflehead between robin and crow",
        "color: Male Oxyura jamaicensiss have blackish caps that contrast with bright white cheeks. In summer, they have rich chestnut bodies with bright blue bills. In winter, they are dull gray-brown above and paler below with dull gray bills. Females and first-year males are brownish, somewhat like winter males but with a blurry stripe across the pale cheek patch. In flight, Oxyura jamaicensiss show solidly dark tops of the wings"
    ],
    "Somateria mollissima": [
        "shape: A large, heavyset sea duck with a distinctive long, sloping frontal lobe of the bill that extends almost to the crown",
        "size: Larger than a Surf Scoter, smaller than a Snow Goose between crow and goose",
        "color: Breeding males are mostly white above and black below, with a black cap, pale green on the nape (back of neck), and green to yellow-orange bill. Immature and nonbreeding males are chocolate brown with variable white on the breast and back. Females are warm brown with dense blackish barring and black bill"
    ],
    "Spatula clypeata": [
        "shape: The aptly named Spatula clypeata has a shovel-shaped bill that quickly sets it apart from other dabbling ducks. It is a medium-sized duck that tends to sit with its rear a bit higher out of the water almost like its bill is pulling its front half down",
        "size: Larger than an American Coot, smaller than a Mallard crow-sized",
        "color: Breeding male shovelers are bold white, blue, green, and rust, but their most notable feature is their white chest and white lower sides. In flight, males flash blue on the upper wing and green on the secondaries (the speculum). Female and immature shovelers are mottled in brown and have powdery-blue on the wings that is sometimes visible on resting birds. Their very large orange bill is their most notable field mark"
    ],
    "Spatula cyanoptera": [
        "shape: A relatively small duck with sizable head and rather long bill, longer than Blue-winged Teals but shorter than Northern Shovelers",
        "size: Larger than a Green-winged Teal, smaller than a Northern Shoveler crow-sized",
        "color: Breeding male has red eye, long dark bill, and mostly vivid rusty plumage, with brownish back, white underwing. Female, immature, and nonbreeding male are mostly rich brownish overall. All adults have sky-blue patch in open wing, similar to other teal and shovelers"
    ],
    "Spatula discors": [
        "shape: A small dabbling duck, a Spatula discors is dwarfed by a Mallard and only a touch larger than a Green-winged Teal. Head is rounded and bill is on the large side",
        "size: crow-sized",
        "color: Breeding males are brown-bodied with dark speckling on the breast, slaty-blue head with a white crescent behind the bill, and a small white flank patch in front of their black rear. Females and eclipse males are a cold, patterned brown. In flight, they reveal a bold powder-blue patch on their upperwing coverts"
    ],
    "Aeronautes saxatalis": [
        "shape: A fairly large swift with a long, slim body and very long, narrow wings that curve like a scimitar. The overall slim outline can make it appear small, especially at a distance",
        "size: Larger than a Vauxs Swift, smaller and slenderer than a Purple Martin between sparrow and robin",
        "color: A blackish brown bird with a white throat and a white strip down the center of the breast and belly. Upperparts are blackish with white flanks and a white trailing edge to the secondaries (the inner part of the wing)"
    ],
    "Chaetura pelagica": [
        "shape: Chaetura pelagicas are very small birds with slender bodies and very long, narrow, curved wings. They have round heads, short necks, and short, tapered tails. The wide bill is so short that it is hard to see",
        "size: About the same size as a Cliff Swallow between sparrow and robin",
        "color: They are dark gray-brown all over, slightly paler on the throat. At distance and when backlit against they sky they can appear to be all black"
    ],
    "Chaetura vauxi": [
        "shape: A small-bodied bird with long, very narrow swept-back wings that curve along both leading and trailing edges",
        "size: Larger than an Annas Hummingbird, smaller than a Barn Swallow between sparrow and robin",
        "color: Brownish overall, with throat, chest, and uppertail a slightly paler brownish gray"
    ],
    "Chordeiles minor": [
        "shape: Chordeiles minors are medium-sized, slender birds with very long, pointed wings and medium-long tails. Only the small tip of the bill is usually visible, and this combined with the large eye and short neck gives the bird a big-headed look",
        "size: Slightly smaller than an American Kestrel; larger than a Purple Martin between robin and crow",
        "color: Chordeiles minors are well camouflaged in gray, white, buff, and black. The long, dark wings have a striking white blaze about two-thirds of the way out to the tip. In flight, a V-shaped white throat patch contrasts with the rest of the birds mottled plumage"
    ],
    "Archilochus alexandri": [
        "shape: A small, fairly slender hummingbird with a fairly straight bill",
        "size: Same size as Ruby-throated Hummingbird sparrow-sized or smaller",
        "color: Dull metallic green above and dull grayish-white below. Males have a velvety black throat with a thin, iridescent purple base. Females have a pale throat. In both sexes, the flanks are glossed with dull metallic green. Females three outer tail feathers have broad white tips. The bill is black"
    ],
    "Archilochus colubris": [
        "shape: The Archilochus colubris is a small hummingbird with a slender, slightly downcurved bill and fairly short wings that don’t reach all the way to the tail when the bird is sitting",
        "size: Same size as a Black-chinned Hummingbird sparrow-sized or smaller",
        "color: Archilochus colubriss are bright emerald or golden-green on the back and crown, with gray-white underparts. Males have a brilliant iridescent red throat that looks dark when its not in good light"
    ],
    "Calypte anna": [
        "shape: Tiny among birds, Annas are medium-sized and stocky for a hummingbird. They have a straight, shortish bill and a fairly broad tail. When perched, the tail extends beyond the wingtips",
        "size: Very slightly larger than a Rufous Hummingbird sparrow-sized or smaller",
        "color: Calypte annas are mostly green and gray, without any rufous or orange marks on the body. The male's head and throat are covered in iridescent reddish-pink feathers that can look dull brown or gray without direct sunlight"
    ],
    "Calypte costae": [
        "shape: Costa's Hummingbirds are small and compact hummingbirds with a hunched posture. Their short tail barely meets their short wings when perched. The male's gorget (throat patch) flares out along the sides of the neck like an overgrown mustache",
        "size: Larger than a Calliope Hummingbird, smaller than an Anna's Hummingbird sparrow-sized or smaller",
        "color: Adult male Costa's Hummingbirds have an iridescent purple crown and gorget, a green back, and a green vest. Females and immatures are greenish above with a white eyebrow stripe and whitish underparts"
    ],
    "Cynanthus latirostris": [
        "shape: A rather small hummingbird with a long, straight bill and a tail that is notched in the center. Males have fuller tails than females, with rounded corners (females’ tails have squared corners)",
        "size: About the size of a Ruby-throated or Black-chinned Hummingbird, smaller than a Blue-throated Mountain-gem sparrow-sized or smaller",
        "color: Adult males are rich green with a shimmering blue throat (gorget) and a red bill tipped in black. Females are golden-green above, gray below, with a white line behind the eye. Immatures are similar to females (immature males often show the beginning of a blue-green gorget)"
    ],
    "Selasphorus calliope": [
        "shape: The Selasphorus calliope is small even for a hummingbird, and its hunched posture makes it look even smaller. It has a short tail and short wings that barely extend past the end of the tail. The bill is thin and short for a hummingbird",
        "size: Smaller than a Black-chinned hummingbird sparrow-sized or smaller",
        "color: The standout feature of a Selasphorus calliope is the magenta rays on the male's throat. Both males and females are greenish above, but males wear a greenish vest below while females and immatures have a peachy wash across their underparts"
    ],
    "Selasphorus platycercus": [
        "shape: Selasphorus platycercuss, though tiny, are medium-sized for a North American hummingbird. They have a slender body, a big head, and a long straight bill. Its tail is relatively long for a hummingbird, extending beyond the wingtips when perched",
        "size: Larger than a Calliope Hummingbird, slightly smaller than a Rufous Hummingbird sparrow-sized or smaller",
        "color: The Selasphorus platycercus is iridescent green above with greenish or buffy flanks and a white chest and line down the belly. Adult males have a rose-magenta throat patch (gorget). Females and juveniles have green spots on their throats and cheeks and a pale eyering. When they spread their tail in flight, they flash white tail tips"
    ],
    "Selasphorus rufus": [
        "shape: A fairly small hummingbird with a slender, nearly straight bill, a tail that tapers to a point when folded, and fairly short wings that don’t reach the end of the tail when the bird is perched",
        "size: About the same size as a Ruby-throated Hummingbird sparrow-sized or smaller",
        "color: In good light, male Selasphorus rufuss glow like coals: bright orange on the back and belly, with a vivid iridescent-red throat. Females are green above with rufous-washed flanks, rufous patches in the green tail, and often a spot of orange in the throat"
    ],
    "Selasphorus sasin": [
        "shape: Allen's Hummingbirds are small, compact, and stocky hummingbirds. The bill is straight and about as long as the head. The tail extends past the wings when perched and the outermost tail feather is narrower than the rest",
        "size: Larger than a Calliope Hummingbird, slightly smaller than an Anna's Hummingbird sparrow-sized or smaller",
        "color: Allen's Hummingbirds coppery orange and green overall. Adult males have a coppery tail, eye patch, and belly that contrasts with their bronze-green back and deep reddish orange gorget. Females and immatures are bronze-green above with paler coppery sides. They both have bits of bronze spotting on their throats, though females have more spots and a small patch of reddish orange in the center of the throat"
    ],
    "Cathartes aura": [
        "shape: Cathartes auras are large dark birds with long, broad wings. Bigger than other raptors except eagles and condors, they have long \"fingers\" at their wingtips and long tails that extend past their toe tips in flight. When soaring, Cathartes auras hold their wings slightly raised, making a ‘V’ when seen head-on",
        "size: Smaller than an eagle; larger than a Red-tailed Hawk goose-sized or larger",
        "color: Cathartes auras appear black from a distance but up close are dark brown with a featherless red head and pale bill. While most of their body and forewing are dark, the undersides of the flight feathers (along the trailing edge and wingtips) are paler, giving a two-toned appearance"
    ],
    "Coragyps atratus": [
        "shape: Coragyps atratuss are large raptors. In flight, they hold their broad, rounded wings flat and angled slightly forward. The tail is very short and rounded. They have small, bare heads and narrow but strongly hooked bills",
        "size: Slightly smaller than a Turkey Vulture; slightly larger than a Red-tailed Hawk goose-sized or larger",
        "color: These birds are uniform black except for white patches or “stars” on the underside of their wingtips (this can be hard to see in strong light or from far away). The bare skin of the head is black"
    ],
    "Cepphus columba": [
        "shape: A medium-sized seabird with a small head and medium-length, sharply pointed bill. The neck and tail are fairly short; the wings are short and narrow (helps with “flying” underwater)",
        "size: Larger than a Pied-billed Grebe, smaller than a Common Murre crow-sized",
        "color: Adult in breeding plumage is mostly dark brown (black from a distance), with dark underwings and white patches in upperwings that are partly broken by a black bar. The feet and interior of the mouth are vivid scarlet. Adults in nonbreeding plumage retain white wing patches but have a mostly whitish head, neck, and underparts. Juveniles are similar but with grayish feathers on the head, neck, and sides and less white in the upperwing"
    ],
    "Cepphus grylle": [
        "shape: A medium-sized seabird with a heavy body and fairly short, pointed wings. It has a small head and relatively short neck. The bill is straight and sharply pointed",
        "size: Larger than a Pied-billed Grebe, smaller than a Surf Scoter crow-sized",
        "color: Breeding adults are mostly deep black with large white patches on the wings visible when the wings are folded. The underwings are white with black border. The legs and feet are bright red. Nonbreeding adults retain the black-and-white wing pattern but have mostly whitish head, neck, and underparts. Immatures are similar but with grayish feathers in the head, neck, and sides, and less white in the upperwing"
    ],
    "Cerorhinca monocerata": [
        "shape: A squat, thickset seabird with a heavy body, a short neck, and a heavy bill with (during breeding season) a short vertical spike near the base. It has broad, pointed wings, short legs, and large, webbed feet",
        "size: Larger than a Cassin's Auklet, smaller than a Tufted Puffin between robin and crow",
        "color: Breeding adults are cloudy gray, with two white plumes on the face and a thick orange-yellow bill with a prominent pale “horn.\" Nonbreeding adults lack the horn and have much less white on the face. Juveniles resemble nonbreeding adults but have a smaller, darker bill"
    ],
    "Charadrius semipalmatus": [
        "shape: A small, compact shorebird with a short, stubby bill, a round head, and large eyes. The body is plump, with a short neck and medium-length legs",
        "size: Larger than a Least Sandpiper, smaller than a Killdeer between sparrow and robin",
        "color: Adults are brown above, white below, with one black band on the breast. Black around the eye, with white marks above eye and bill and a white band above the black collar. The short orange bill has a black tip. Juveniles have brown instead of black on the face, and a brown breast band that is sometimes incomplete. Legs are yellow-orange"
    ],
    "Charadrius vociferus": [
        "shape: Charadrius vociferus have the characteristic large, round head, large eye, and short bill of all plovers. They are especially slender and lanky, with a long, pointed tail and long wings",
        "size: Similar in size to American Robin, but with longer legs and wings robin-sized",
        "color: Brownish-tan on top and white below. The white chest is barred with two black bands, and the brown face is marked with black and white patches. The bright orange-buff rump is conspicuous in flight"
    ],
    "Pluvialis squatarola": [
        "shape: A chunky, large-headed shorebird with a short, thick bill (heavier than bills of golden-plovers). It has long, pointed wings and moderately long legs",
        "size: Larger than an American Golden-Plover, smaller than a Greater Yellowlegs between robin and crow",
        "color: Breeding males are a dazzling mix of black and white: checkered upperwings, a black face and belly, a white crown, nape, and undertail, and dark legs and bill. Adult females in breeding plumage are similar but with less contrast. Nonbreeding adults are pale gray above and grayish or whitish below. Juveniles are but more scaly-looking on the back. All plumages show black “armpits” in flight"
    ],
    "Haematopus bachmani": [
        "shape: A large, heavyset shorebird with a very long, thick straight bill. The neck is heavy and the legs are long and thick",
        "size: Larger than a Willet, smaller than a Long-billed Curlew crow-sized",
        "color: Adults are blackish with a brilliant orange-red bill and yellow eye ringed with red. At close range the wings, tail, and back are dark brown. Juveniles are brownish overall, with outer portion of bill dusky"
    ],
    "Haematopus palliatus": [
        "shape: A large, thickset shorebird with a long, stout bill, a large head, robust neck, and long, thick legs",
        "size: Larger than a Willet, smaller than a Herring Gull crow-sized",
        "color: Haematopus palliatuss look black-and-white from a distance, with a bright orange-red bill. At closer range, the back and wings are brown, with a black head and breast, white underparts, yellow eye, and red eyering. In flight, look for a white wingbar and white tail base"
    ],
    "Chlidonias niger": [
        "shape: A small and delicately built seabird with a thin, pointed bill; long, pointed wings; a shallowly forked tail; and short legs",
        "size: Larger than a Least Tern, smaller than a Common Tern between robin and crow",
        "color: Adults in breeding plumage are dark gray above with black heads and black underparts. The underwings and undertail coverts are pale. Nonbreeding adults are gray above, whitish below, with a dusky crown, ear-patch, and mark at the side of the breast. Juveniles are similar to nonbreeding adults but with a brown scaled pattern to the upperparts"
    ],
    "Chroicocephalus philadelphia": [
        "shape: A small, ternlike gull, with slender bill, rather narrow, pointed wings, and slim body",
        "size: Larger than a Common Tern, smaller than a Ring-billed Gull crow-sized",
        "color: Breeding adults have black heads, red legs, and large white triangles in the wingtips that contrast with the gray wings. Nonbreeding birds are mostly white with grayish upperwings, white primaries (edged in black), and a gray spot on the cheek. Immatures are similar to nonbreeding adults but upperwing is edged in dark gray, and the tail is tipped in black"
    ],
    "Hydroprogne caspia": [
        "shape: A large, heavy-bodied seabird (and largest of all terns), with a large head; thick, straight, pointed bill; and shallowly forked tail. The long, pointed wings are broad for a tern",
        "size: The largest tern species. Larger than a Ring-billed Gull, smaller than a Herring Gull crow-sized",
        "color: White overall, with pale gray upperwings. From below, the outer primaries in the wing are dark gray. Breeding adults have a black crown; winter adults and juveniles have a partially black crown with grayish speckling. The bill is coral red with a dusky tip. Feet and legs are blackish"
    ],
    "Larus argentatus": [
        "shape: Larus argentatuss are large gulls with hefty bills and robust bodies. In flight, they look barrel-chested and broad-winged compared to smaller species such as Ring-billed Gulls",
        "size: Larger than a Ring-billed Gull, smaller than Western or Great Black-backed Gull between crow and goose",
        "color: Adults have light-gray backs, black wingtips, and white heads and underparts. In winter, dusky streaks mark their heads. Larus argentatuss take four years to reach adult plumage. Juveniles are mottled brown; second-year birds are brown but show gray on the back. Third-years have more gray on the back and more white on the head and underparts. The legs are dull pink at all ages"
    ],
    "Larus californicus": [
        "shape: The Larus californicus is a medium-sized gull with a round head. The bill is slender compared to other gull species. In flight the wings are long and pointed",
        "size: Larger than a Ring-billed Gull, smaller than a Herring Gull crow-sized",
        "color: Breeding adult Larus californicuss are white-headed gulls with a medium gray back, yellow legs, and a dark eye. Nonbreeding adults have brown streaking on the head. Adults have a yellow bill with small black ring and a red spot on the lower mandible—brighter on breeding gulls. In their first year, they are mottled brown and white and often have a paler face. The bill is pink with a black tip and the legs are pinkish. Second-year Larus californicuss are also mottled brown but begin to show gray on the back. They have a dark eye and bluish legs. Third-year gulls look very similar to adults"
    ],
    "Larus delawarensis": [
        "shape: The Ring-billed is a medium-sized gull with a fairly short, slim bill. When the gull perches, its long, slender wings extend well past its square-tipped tail. In flight, the birds move lightly on easy flaps of their fairly slender wings",
        "size: Roughly pigeon-sized body (but with long wings), smaller than Herring Gull crow-sized",
        "color: Adults are clean gray above, with a white head, body and tail; their black wingtips are spotted with white. They have yellow legs and a yellow bill with a black band around it. Nonbreeding adults have brown-streaked heads. During their first two years, Larus delawarensiss are a motley brown and gray with a pink bill and legs"
    ],
    "Larus glaucescens": [
        "shape: A large, heavyset gull with a big, somewhat flat head and a long, heavy bill with a thick tip and pronounced angle along the lower edge",
        "size: Larger than an Iceland Gull, smaller than a Glaucous Gull between crow and goose",
        "color: Breeding adults are pearly gray above, including the wingtips, and white below. The wingtips have white spots. The bill is yellow and the legs and feet pinkish. Nonbreeding adults have some brownish mottling or streaking on the head. Juveniles are pale brown overall, including wingtips. Subadult plumages are intermediate between juvenile and adult"
    ],
    "Larus heermanni": [
        "shape: A medium-sized gull with long wings, a fairly rounded head, and a straight, relatively long bill that is less heavy and angled than bills of larger gulls",
        "size: Larger than a Mew Gull, slightly smaller than a California Gull crow-sized",
        "color: Breeding adults are dark gray above, gray below, with a white head, black legs, and a red bill with black tip. Nonbreeding adults are similar but with streaky heads. Immatures are very dark sooty brown overall, with a pale bill that shows a dusky tip"
    ],
    "Larus marinus": [
        "shape: This is the largest species of gull in the world. They are stout-bodied, with broad wings, a thick neck, and a heavy, slightly bulbous bill",
        "size: Larger than a Herring Gull, but smaller than a Brown Pelican between crow and goose",
        "color: Adults are white with slaty-black upperwings and backs. They have dull pink legs, a yellow bill with a red spot near the tip, and darkish eyes. Juveniles are checkered gray-brown and white above; they have white-based, black-tipped tails, black bills, and blackish flight feathers. Over about 4 years, these crisp, cold-toned gulls transition to dark backed adults"
    ],
    "Larus occidentalis": [
        "shape: A large, heavy-bodied gull with a thick neck, large head, and heavy bill with a thick tip",
        "size: Larger than a Herring Gull, smaller than a Great Black-backed Gull between crow and goose",
        "color: Breeding adults are white with black (or dark gray) back and upperwings, black primary feathers, yellow bill with red mark near the tip, and pale pink legs and feet. Eyes olive-yellow in southern subspecies, dark brown in northern. Juveniles are mottled sooty brown with blackish bill, grayish-pink legs and feet, and dark eye. Subadults have variable gray backs and brownish wings, with gray or pink legs; eyes variable"
    ],
    "Leucophaeus atricilla": [
        "shape: Leucophaeus atricillas are medium-sized gulls with fairly long wings and long legs that impart a graceful look when they are flying or walking. They have stout, fairly long bills",
        "size: Slightly smaller than a Ring-billed Gull crow-sized",
        "color: Leucophaeus atricillas are medium gray above and white below. Summer adults have a crisp black hood, white arcs around the eye, and a reddish bill. In winter, the hood becomes a blurry gray mask on a white head. The legs are reddish black to black. Immatures are much browner and more subtly patterned than adults; they take 2-3 years to gain adult plumage"
    ],
    "Rissa tridactyla": [
        "shape: A small gull with a plump belly. Kittiwakes look sleek in flight, with rather long, narrow wings, a short, notched tail, and a slim, fairly short bill",
        "size: Larger than a Bonapartes Gull, slightly smaller than a Ring-billed Gull crow-sized",
        "color: Breeding adults are pale gray above with neat black wingtips, clean white below, with a yellow bill. The legs and feet are jet black. Nonbreeding adults are similar but acquire a dusky patch behind the ear. Juveniles are quite striking: white overall, with a black M pattern across the upperwing visible in flight. They also have a gray or black collar across the back of the neck, a black tail tip and a black bill"
    ],
    "Rynchops niger": [
        "shape: A medium-sized ternlike seabird with very long wings and an outsized bill in which the lower mandible is much longer than the upper",
        "size: Larger than a Laughing Gull, slightly smaller than a Royal Tern (but with longer wings) crow-sized",
        "color: Starkly black above and white below, with black-and-red bill and orange-red legs. Juveniles are brownish above, with pale-edged wing covert feathers"
    ],
    "Sterna forsteri": [
        "shape: A slender, long-tailed, long-winged seabird with a long, pointed bill and short legs. When perched, the long tail streamers extend past the end of the wings",
        "size: Larger than a Black Tern, smaller than a Bonapartes Gull between robin and crow",
        "color:  Breeding adults are gray above and white below, with a black cap and orange bill with black tip. The wingtips are silvery gray and the legs are orange. Nonbreeding adults are ghostly pale overall, with a dark bill, white crown, and thick blackish eye patch. Juveniles are similar to nonbreeding adults but have tan feathers on the upperparts, a pale base to the bill, and a shorter tail"
    ],
    "Sterna hirundo": [
        "shape: Sterna hirundos have long, narrow, angular wings and pointed wingtips. Unlike gulls, this tern has a straight, slender bill. The tail is forked and the legs are short",
        "size: Larger than a Least Tern, smaller than a Caspian Tern between robin and crow",
        "color: Sterna hirundos are pale gray overall with a black cap. Breeding birds have a fully black cap that extends to the back of the neck and a gray belly. They also have an orange bill tipped in black and orange legs. Nonbreeding birds have a white forehead, a partial black cap, and black legs and bill. They also have a black bar across the shoulder known as a carpal bar and dark trailing edges on the wingtips as seen in flight"
    ],
    "Sterna paradisaea": [
        "shape: Sterna paradisaeas are slender terns with long, angular wings and pointed wingtips. They have a small round head with a steep forehead and extremely short legs. Breeding adults have a deeply forked tail",
        "size: Larger than a Least Tern, smaller than a Caspian Tern between robin and crow",
        "color: Breeding adults are pale gray above and below. They have a full black cap that extends down the back of the neck, a red bill, and red legs. Nonbreeding birds have a white forehead with smaller black cap restricted to the back of the head and neck. Nonbreeders also have a black bill, black legs, and a dark gray bar across the shoulder (carpal bar)"
    ],
    "Sternula antillarum": [
        "shape: A distinctive, very small seabird, slim in all proportions, with long, narrow wings, trim body, and slender, sharp bill",
        "size: Larger than a Tree Swallow, smaller than a Forster's Tern between robin and crow",
        "color: Breeding adults are pale gray and white, with a black cap, white forehead, and yellow bill. Nonbreeding adults have a dark bill, smudgy grayish crown, and may show a dark bar at the bend of the wing. The outer primaries are dark gray-black. Juveniles are similar to nonbreeding adults but scaly gray above. The legs are orange"
    ],
    "Thalasseus elegans": [
        "shape: A medium-sized, slender tern with a long, thin, slightly drooping bill. The wings are long, slender and pointed. The tail is medium length and forked. In breeding season Thalasseus eleganss have a shaggy crest",
        "size: Larger than a Common Tern, smaller than a Royal Tern crow-sized",
        "color: Breeding adults are pale gray above, white with pink bloom below (often hard to see). They have a shaggy black crest, orange bill, dark gray outer primaries, and dark legs. Nonbreeding adults have white foreheads and lack the rosy tint below. Juveniles are grayer and more patterned above, with a gray crown"
    ],
    "Thalasseus maximus": [
        "shape: A large tern, slender and long winged. The head is fairly large and often has a ragged crest at the back. Thalasseus maximuss have a substantial body, a long, forked tail, and short legs. The bill is long and daggerlike",
        "size: Larger than a Ring-billed Gull (but with shorter legs), smaller than a Caspian Tern crow-sized",
        "color: Breeding adults are gray below and white above, with a black crest and bright orange bill. Nonbreeders have a white forehead with black only at the rear of the crest. The outer primaries of the wing are blackish and the legs are black. Juveniles are similar but with tan feathers in upperparts, duskier upperwings, and a paler bill"
    ],
    "Himantopus mexicanus": [
        "shape: A tall but small-bodied shorebird with very long legs, a long neck, small head, and thin, straight bill",
        "size: Smaller than a Willet, larger than a Lesser Yellowlegs between robin and crow",
        "color: These birds are black above and white below, with white around the eye and rosy pink legs. In females and immatures the black areas can be brownish"
    ],
    "Recurvirostra americana": [
        "shape: Large, slender shorebird with a long, upturned bill, a long neck, and a round head. Its oval body sits atop long legs",
        "size: Larger than a Black-necked Stilt, smaller than a Snowy Egret between robin and crow",
        "color: Breeding birds have a chic rusty head and neck that turns grayish white after breeding. A black patch on the back and black-and-white wings mark its largely white body. The legs are bluish gray"
    ],
    "Actitis macularius": [
        "shape: The Actitis macularius is a medium-sized shorebird with a bill slightly shorter than its head and a body that tapers to a longish tail. They have a rounded breast and usually appear as though they are leaning forward",
        "size: Slightly smaller than a Killdeer robin-sized",
        "color: In breeding season Actitis maculariuss have bold dark spots on their bright white breast and an orange bill. The back is dark brown. In winter, a Actitis macularius's breast is not spotted; it's plain white, while the back is grayish brown and the bill is pale yellow. In flight, Actitis maculariuss have a thin white stripe along the wing"
    ],
    "Arenaria interpres": [
        "shape: The Arenaria interpres is a short, stocky, and oval-shaped shorebird. They have a stout and slightly upturned bill",
        "size: Larger than a Spotted Sandpiper, smaller than a Willet robin-sized",
        "color: Breeding males have unique black-and-white markings on the head and throat and a chestnut and black variegated (calico catlike) pattern on the back. Breeding females are paler than males. Nonbreeding adults have brown ghosting of the breeding plumage pattern. Juveniles look similar to nonbreeding birds, but have rusty edges to the feathers. All Arenaria interpress have orange legs, but they are brighter during the breeding season. In flight, Arenaria interpress show a unique color pattern: white stripe down the back, black tail stripe, white rump, and white stripe down the wings"
    ],
    "Arenaria melanocephala": [
        "shape: A small, stout shorebird with a short neck, a short, slightly upturned bill, and rather short legs",
        "size: Larger than a Sanderling, smaller than a Wandering Tattler robin-sized",
        "color: A dark blackish-brown bird with a neat white belly and a bold black-and-white pattern in flight. Breeding adults have a white spot next to the bill and white breast speckling. Nonbreeding adults are similar but with less white (mostly limited to wings, tail, and belly). Juveniles are similar but more brownish than blackish. The striking flight pattern features two white stripes on each wing, a white back stripe, and a mostly white tail with a thick black band near the tip"
    ],
    "Calidris alba": [
        "shape: Calidris albas are small, plump sandpipers with a stout bill about the same length as the head. These and other sandpipers in the genus Calidris are often called “peeps”; Calidris albas are medium-sized members of this group",
        "size: About the same size as a Dunlin. Smaller than a Red Knot; larger than a Least Sandpiper robin-sized",
        "color: You’ll most often see Calidris albas in nonbreeding plumage, when they are very pale overall: light gray above and white below, with a blackish mark at the shoulder. In spring and summer, Calidris albas are spangled black, white, and rich rufous on the head, neck, and back. At all times, their legs and bills are black. In flight, white wingstripes contrast with dark wings"
    ],
    "Calidris alpina": [
        "shape: A chunky, small shorebird with medium-length legs, a short neck, and a long bill that is curved toward the tip",
        "size: Larger than a Western Sandpiper, smaller than a Short-billed Dowitcher robin-sized",
        "color: Breeding adult has bright rusty back and crown, black belly patch, and white underparts with dark stippling. Nonbreeding adults have grayish brown upperparts, head, and breast, and are pale below. Juveniles are browner, with a scaly black and rusty brown marbled pattern above, white below, with faint stippling and trace of dark belly patch. The legs are dark"
    ],
    "Calidris mauri": [
        "shape: A small, portly shorebird with a long, thin bill with a slightly curved tip. It has long, pointed wings, a short tail, and medium-length legs for its size. Females tend to be larger and have longer bills than males",
        "size: Larger than a Least Sandpiper, smaller than a Dunlin between sparrow and robin",
        "color: Breeding adults have black, brown, rufous, and gold upperparts, with white underparts marked with extensive dark arrow-shaped streaks. They have a rufous crown and ear patch, and dark legs and bill. Nonbreeding adults are pale gray above, whitish below. Juveniles are similar to nonbreeding adults but the upperparts are more vivid in the wings, showing gold and rufous edges to feathers"
    ],
    "Calidris minutilla": [
        "shape: Calidris minutillas are tiny sandpipers with round bodies and relatively short, pointed wings. They have thin-tipped, slightly decurved bills and slim, medium-length legs",
        "size: Tiny (our smallest shorebird); Slightly larger than a sparrow, slightly smaller than a Semipalmated Sandpiper between sparrow and robin",
        "color: They have brown upperparts and white underparts. Their bills are black, and their legs are yellowish-green (this can be obscured by mud at times). Juveniles have crisp plumage that is rustier than that of adults. In flight, Calidris minutillas show whitish rumps bisected by a longitudinal black line"
    ],
    "Calidris pusilla": [
        "shape: A very small, plump shorebird with a thin, straight, tubular bill. When folded, the wings are about the same length as the tail. The bill usually does not droop or turn downwards at the tip",
        "size: Smaller than a Dunlin, slightly larger than a Least Sandpiper between sparrow and robin",
        "color: Breeding adults are dappled in brown, black, gold, and rufous above, with pale underparts and dark legs. The head, nape, and breast are stippled or streaked with brown, but the flanks are white. Nonbreeding adults are much plainer, mousy grayish brown above, pale below, with weak supercilium (pale line over eye). Juveniles are similar to nonbreeding adult but the upperparts show a neat, scaly pattern"
    ],
    "Calidris virgata": [
        "shape: A stout shorebird with a short, thick bill, short neck, short tail, and short, thick legs",
        "size: Larger than a Black Turnstone, smaller than a Black-bellied Plover robin-sized",
        "color: Breeding adults are stippled light, dark, and rufous above. The head and underparts are white, neatly marked with black streaks and arrowhead-shaped markings on the breast and belly. Nonbreeding plumage is muddy brownish gray with whitish chin, white belly with some streaking. The tail is white at the base, with a bold black tip. Legs are greenish yellow; base of bill is yellow. Juveniles are paler than nonbreeding adults, with feathers above showing narrow pale edges"
    ],
    "Gallinago delicata": [
        "shape: Gallinago delicatas are medium-sized, pudgy shorebirds with short, stocky legs. The bill is straight and very long (several times the length of the head). The head is rounded and the tail is short",
        "size: About the size of a Killdeer, but heavier-bodied and less lanky robin-sized",
        "color: These birds are intricately patterned in buff and brown stripes and bars. The dark head has prominent buffy to whitish stripes. The dark back has three long buffy streaks, one running down each edge, one down the center. The buff chest is streaked and spotted with brown; the sides are heavily barred with black. In flight, the wings are dark above and below"
    ],
    "Limnodromus griseus": [
        "shape: A chunky, medium-sized shorebird with a long, straight bill and moderately long legs",
        "size: Larger than a Lesser Yellowlegs, smaller than a Greater Yellowlegs robin-sized",
        "color: Breeding adults have brown, black, and gold upperparts and are pale orange with darker speckling below (colors limited to the neck and upper breast in eastern subspecies). Nonbreeding adults are quite plain, grayish brown above and pale below, with some speckling on breast and sides. Juveniles in fresh plumage have orange breast and dark feathers with striking gold edges above"
    ],
    "Limosa fedoa": [
        "shape: Large, long-legged shorebird with an extremely long, slightly upturned bill. A small round head sits atop a thin neck. In flight its legs stick out beyond the tail",
        "size: Larger than a Willet, smaller than a Long-billed Curlew crow-sized",
        "color: Barred above and below in brown, white, and cinnamon during the breeding season. They look similar during the nonbreeding season, but have unbarred cinnamon-washed underparts. In flight, note the cinnamon underwings year-round. The bill is bicolored: black at the tip and orange at the base during breeding or pink during the nonbreeding season"
    ],
    "Numenius americanus": [
        "shape: Large, long-legged shorebird with a very long, thin curved bill. It has a heavy football-shaped body, a long neck, and a small round head",
        "size: Larger than a Whimbrel, smaller than a Great Egret crow-sized",
        "color: Speckled and barred in browns above with a pale cinnamon wash throughout and a plain cinnamon belly. The head and neck are pale with faint streaks and the lower bill is pink at the base. In flight, the upper and lower wings are strongly cinnamon"
    ],
    "Numenius phaeopus": [
        "shape: A robust, large shorebird with a very long, curved bill and relatively long neck and legs. The wings are long and pointed; the tail is short",
        "size: Larger than a Willet, smaller than a Long-billed Curlew crow-sized",
        "color: Mostly brownish above, with pale feather edges, tan below, with neat dark stippling. The crown is dark brown with a pale central stripe, and most show a narrow dark eyeline"
    ],
    "Phalaropus tricolor": [
        "shape: Phalaropus tricolors are small shorebirds with long legs, slender necks, and very thin, straight, long bills. They have sharply pointed wings",
        "size: Larger than a Least Sandpiper; smaller than a Killdeer robin-sized",
        "color: Phalaropus tricolors are grayish birds with cinnamon or rusty highlights especially on the neck. In the breeding season females are more colorful than males, with a dark line through the eye extending down the neck. The throat is white and the neck is washed rusty. Nonbreeding birds are pale gray above, white below, without the strong facial markings of other phalarope species"
    ],
    "Scolopax minor": [
        "shape: Scolopax minors are plump, short-legged shorebirds with very long, straight bills. Their large heads, short necks, and short tails give them a bulbous look on the ground and in flight. The wings are broad and rounded compared to most other shorebirds",
        "size: Bigger and plumper than a Killdeer; slightly smaller than a Rock Pigeon robin-sized",
        "color: They are well camouflaged in light brown, black, buff, and gray-brown tones. The face is buffy, the crown blackish. They are light gray across the neck and back, with dark-and-light patterned shoulders and brown wings. The underparts are buffy to almost orange"
    ],
    "Tringa flavipes": [
        "shape: A slender and elegant, medium-sized shorebirds with long legs and a long neck. The bill is straight and thin, only slightly longer than the bird's head (shorter and straighter than Greater Yellowlegs' bill)",
        "size: Larger than a Dunlin, smaller than a Greater Yellowlegs between robin and crow",
        "color: Breeding Tringa flavipes are grayish brown birds with vivid yellow legs. They have fine, gray streaking across the head and neck, a white eyering, and white spots on the back and wings. Nonbreeding birds are more subdued gray-brown with less streaking and spotting. Bill is entirely dark"
    ],
    "Tringa melanoleuca": [
        "shape: Large and lanky for a shorebird, with very long legs, a long neck, and a thick-based, slightly upturned bill",
        "size: About 50% larger than a Lesser Yellowlegs, smaller than a Marbled Godwit between robin and crow",
        "color: In breeding plumage the Tringa melanoleuca is a striking bird, with dense, dark bands on the breast and neck. Most of the year, the pattern is more subdued: a black and white checkerboard of speckling on the back, with a finely streaked neck and head. There is usually some barring on the flanks and a bright, white eyering. Bill is dark. In all plumages, legs are appropriately bright yellow, occasionally orange in spring"
    ],
    "Tringa semipalmata": [
        "shape: Tringa semipalmatas are large, stocky shorebirds with long legs and thick, straight bills considerably longer than the head. Their wings are broader and rounder than those of many shorebirds and the tail is short and squared off at the base",
        "size: A large shorebird with a pigeon-sized body on long legs crow-sized",
        "color: Tringa semipalmatas are gray or brown birds that, when flying, display a striking white and black stripe along each wing. In summer, Tringa semipalmatas are mottled gray, brown, and black; in winter they are a more consistent plain gray. The legs are bluish gray"
    ],
    "Tringa solitaria": [
        "shape: A small, slender shorebird with a somewhat long neck and long bill. It has fairly long wings and legs",
        "size: Slightly larger than a Spotted Sandpiper, smaller than a Lesser Yellowlegs robin-sized",
        "color: Dark olive-brown above with a white eyering; pale below. In breeding plumage, the head and breast show dark stippling and the upperparts are neatly spotted with white. In nonbreeding plumage the back is mostly unspotted and the breast is washed with brown. The legs are olive. Dark underwings contrast sharply with white belly in flight"
    ],
    "Mycteria americana": [
        "shape: Mycteria americanas are hefty wading birds with football-shaped bodies perched atop long legs. They have a long neck and a long, thick bill that is curved at the tip. They fly with their neck and legs outstretched but tend to perch with the neck drawn in, giving them a humpbacked appearance",
        "size: Larger than a Great Egret, smaller than a Great Blue Heron between crow and goose",
        "color: Mycteria americanas are entirely white save for their black flight feathers and tail. The head is unfeathered and scaly-looking"
    ],
    "Columba livia": [
        "shape: Larger and plumper than a Mourning Dove, Columba livias are tubby birds with small heads and short legs. Their wings are broad but pointed wings and the tail is wide and rounded",
        "size: Larger than a Mourning Dove; smaller than a crow between robin and crow",
        "color: Variable in color, but most birds are bluish gray with two black bands on the wing and a black tip to the tail. Most birds have iridescent throat feathers. Wing patterns may include two bars, dark spots, or can be plain. The tail is usually dark tipped"
    ],
    "Columbina inca": [
        "shape: The Columbina inca is a small and slender dove with a long, square-tipped tail and small head. It has a thin and slightly drooping bill and short legs",
        "size: Slightly larger than a Common Ground-Dove, smaller than a Mourning Dove between sparrow and robin",
        "color: The Columbina inca is the color of desert sands. Its tan feathers are edged in dark brown creating a scaly pattern over the entire body. Its underparts and face are paler than its back. In flight, the underwings flash a rich chestnut and the outer tail feathers flash white"
    ],
    "Columbina passerina": [
        "shape: Common Ground-Doves are tiny doves with short, round wings, short tails, and short, thin bills. They are stocky, with short legs, and they shuffle as they walk",
        "size: About the same size as a House Sparrow; slightly smaller than an Inca Dove between sparrow and robin",
        "color: Common Ground-Doves are sandy brown overall, with large, dark spots on the wing coverts. In flight the wings show rich rufous patches. Males have a pinkish wash on the head, neck, and chest, and bluish crowns; females are duller. Both sexes have fine, dark scaling on the neck and chest, and pinkish-red bills with a dark tip"
    ],
    "Patagioenas fasciata": [
        "shape: Patagioenas fasciatas are large, stocky pigeons with small heads, long, rounded tails, and thick-based, pointed wings",
        "size: Slightly larger than a Rock Pigeon; smaller than an American Crow crow-sized",
        "color: They are soft blue-gray above and purplish-gray below, with a white crescent on the back of the neck. The upper half of the tail is gray, fading to a pale gray band at the tip. The wings are unmarked pale gray with dark wingtips noticeable in flight. The bill and feet are yellow"
    ],
    "Streptopelia decaocto": [
        "shape: Streptopelia decaoctos have plump bodies, small heads, and long tails. They’re larger than Mourning Doves but slimmer and longer-tailed than a Rock Pigeon. The wings are broad and slightly rounded. The broad tail is squared off at the tip, rather than pointed like a Mourning Doves",
        "size: A large dove, larger and heftier than a Mourning Dove but smaller than a Rock Pigeon between robin and crow",
        "color: Streptopelia decaoctos are chalky light brown to gray-buff birds with broad white patches in the tail. The birds collar is a narrow black crescent around the nape of the neck. In flight and when perched, the wingtips are darker than the rest of the wing"
    ],
    "Zenaida asiatica": [
        "shape: Zenaida asiaticas are plump, square-tailed doves with relatively long, thin bills and small heads",
        "size: Smaller than a Eurasian Collared-Dove; larger than a Mourning Dove robin-sized",
        "color: Zenaida asiaticas are brown overall, with a dark line on the cheek. A white stripe at the edge of the folded wing becomes, as the bird takes flight, a bright flash in the middle of a dark wing. The tail is tipped in white and set off with black stripes from the gray underside. Their faces are ornately marked with a black streak on the cheek, and blue skin around the red eyes"
    ],
    "Zenaida macroura": [
        "shape: Plump-bodied and long-tailed, with short legs, small bill, and a head that looks particularly small in comparison to the body. The long, pointed tail is unique among North American doves",
        "size: Smaller, slenderer than Rock Pigeon robin-sized",
        "color: Zenaida macrouras often match their open-country surroundings. They’re delicate brown to buffy-tan overall, with black spots on the wings and black-bordered white tips to the tail feathers"
    ],
    "Chloroceryle americana": [
        "shape: A small kingfisher with a very long, pointed bill, rather long tail, and short, rather narrow wings",
        "size: Larger than a Tree Swallow, much smaller than a Belted Kingfisher between sparrow and robin",
        "color: Adults are green with a white collar and white spangling in the wings; and white below with dark green belly spots. Males have a rufous breast; females have a double green breast band. Juveniles resemble adult females but may have a bronze tinge to the crown"
    ],
    "Megaceryle alcyon": [
        "shape: Megaceryle alcyons are stocky, large-headed birds with a shaggy crest on the top and back of the head and a straight, thick, pointed bill. Their legs are short and their tails are medium length and square-tipped",
        "size: Smaller than an American Crow; larger than a Hairy Woodpecker robin-sized",
        "color: These kingfishers are blue-gray above with fine, white spotting on the wings and tail. The underparts are white with a broad, blue breast band. Females also have a broad rusty band on their bellies. Juveniles show irregular rusty spotting in the breast band"
    ],
    "Megaceryle torquata": [
        "shape: A heavy-bodied, very large kingfisher, with a thick, daggerlike bill, shaggy crest, fairly long tail, moderately long wings, and short legs",
        "size: Larger than a Belted Kingfisher, smaller than an American Crow between robin and crow",
        "color: Males are slaty blue above and rich chestnut below, with a white collar and undertail coverts and white spotting in tail and wings. Female are similar but have a broad bluish band across the breast and a thin white crescent above the chestnut belly"
    ],
    "Coccyzus americanus": [
        "shape: Coccyzus americanuss are fairly large, long, and slim birds. The bill is almost as long as the head, thick and slightly downcurved. They have a flat head, thin body, and very long tail. Wings appear pointed and swept back in flight",
        "size: Longer, but slighter, than American Kestrel; about the size of a Blue Jay or Western Scrub-Jay between robin and crow",
        "color: Coccyzus americanuss are warm brown above and clean whitish below. They have a blackish mask across the face and a yellow eyering. In flight, the outer part of the wings flash rufous. From below, the tail has wide white bands and narrower black ones. The bill is mostly yellow"
    ],
    "Coccyzus erythropthalmus": [
        "shape: Cuckoos are slender, dove-sized birds with a longer slightly curved bill and a very long tail. When perched it often has a hunchbacked posture",
        "size: Larger than a Baltimore Oriole, smaller than an American Crow between robin and crow",
        "color: Coccyzus erythropthalmuss are plain brown above without cinnamon tones and white below with a red ring around the eye and a black bill. From below, note the small white tips on the tail feathers"
    ],
    "Crotophaga sulcirostris": [
        "shape: A fairly large, disheveled-looking bird with a long, rounded tail and short, rounded wings. It has a tall, heavy bill (though generally smaller than the bill of Smooth-billed Ani). At close range, several grooves in the upper mandible are visible",
        "size: Larger than a Yellow-billed Cuckoo, smaller than a male Coopers Hawk between robin and crow",
        "color: Entirely black. The feathers of the upperparts can show some purple or green gloss in optimal light"
    ],
    "Geococcyx californianus": [
        "shape: Geococcyx californianuss are large cuckoos with a distinctive shape: long legs, a very long, straight tail, and a long neck. The head has a short crest and the bill is long, heavy, and slightly downcurved",
        "size: Larger than a Rock Pigeon; about the size (but more slender than) a Common Raven crow-sized",
        "color: They are tan or brown with extensive blackish streaking on the upperparts and chest. The crown is black with small, pale spots, and they have a patch of bare, blue skin behind the eye. The wings are dark with white highlights"
    ],
    "Caracara plancus": [
        "shape: The Caracara plancus is a medium-sized, bulky raptor with long legs. Its flat head is topped with a shaggy crest. In flight, note its long, straight wings and diamond-shaped tail. The bill is heavy with a sharp tip",
        "size: Larger than a Peregrine Falcon, smaller than a Turkey Vulture between crow and goose",
        "color: Caracara plancuss are black and white with yellow-orange legs and yellow-orange skin around the bill. Their black cap contrasts strongly with their white neck and cheeks. In flight the undertail and outer flight feathers are white. Juveniles are brown and white and lack the adult's yellow-orange legs and facial skin"
    ],
    "Falco columbarius": [
        "shape: Falco columbariuss are small falcons with a powerful build that is broader and stockier than the slightly smaller American Kestrel. Falco columbariuss have sharply pointed wings, a broad chest, and a medium length tail",
        "size: Slightly larger than an American Kestrel; less bulky than a Rock Pigeon between robin and crow",
        "color: Falco columbariuss are generally dark and streaky, though their coloration varies geographically and by gender. Adult male Falco columbariuss are slaty gray to dark gray; females and immatures are browner. The chest is usually heavily streaked and the underwings are dark. The dark tail has narrow white bands, and the face often lacks a prominent malar or “mustache” stripe"
    ],
    "Falco mexicanus": [
        "shape: Falco mexicanuss are large falcons about the size of a peregrine. They have pointed wings and medium-long tails",
        "size: Larger than a Merlin; smaller than a Swainson's Hawk between crow and goose",
        "color: Falco mexicanuss are brown above and pale with brown markings on the breast and belly. From below, they show dark under the wing from the \"armpit\" to the wrist. From above, the tail is paler and contrasts with the back and wings. They have a pale stripe above the eye and a brown mustache stripe"
    ],
    "Falco peregrinus": [
        "shape: Falco peregrinuss are the largest falcon over most of the continent, with long, pointed wings and a long tail. Be sure to look at shape as well as size—long primary feathers give the Peregrine a long-winged shape. As with most raptors, males are smaller than females, so Peregrines can overlap with large female Merlins or small male Gyrfalcons",
        "size: crow-sized",
        "color: Adults are blue-gray above with barred underparts and a dark head with thick sideburns. Juveniles are heavily marked, with vertical streaks instead of horizontal bars on the breast. Despite considerable age-related and geographic variation, an overall steely, barred look remains"
    ],
    "Falco sparverius": [
        "shape: The slender Falco sparverius is roughly the size and shape of a Mourning Dove, although it has a larger head; longer, narrow wings; and long, square-tipped tail. In flight, the wings are often bent and the wingtips swept back",
        "size: Mourning Dove-sized; slightly smaller than a Merlin between robin and crow",
        "color: Falco sparveriuss are pale when seen from below and warm, rusty brown spotted with black above, with a black band near the tip of the tail. Males have slate-blue wings; females’ wings are reddish brown. Both sexes have pairs of black vertical slashes on the sides of their pale faces—sometimes called a “mustache” and a “sideburn.\""
    ],
    "Callipepla californica": [
        "shape: Callipepla californica are plump, short-necked game birds with a small head and bill. They fly on short, very broad wings. The tail is fairly long and square. Both sexes have a comma-shaped topknot of feathers projecting forward from the forehead, longer in males than females",
        "size: About the size of Northern Bobwhite; half the size of a Ring-necked Pheasant between robin and crow",
        "color: Adult males are rich gray and brown, with a black face outlined with bold white stripes. Females are a plainer brown and lack the facial markings. Both sexes have a pattern of white, creamy, and chestnut scales on the belly. Young birds look like females but have a shorter topknot"
    ],
    "Callipepla gambelii": [
        "shape: Like other quail, Gambel's Quail are plump, volleyball-sized birds with short necks, small bill, and square tail. The wings are short and broad. Both sexes have a comma-shaped topknot of feathers atop their small heads, fuller in males than females",
        "size: Larger than a Northern Bobwhite; slightly smaller than a Chukar or Gray Partridge between robin and crow",
        "color: Richly patterned in gray, chestnut, and cream that can serve as excellent camouflage. Males have a bright rufous crest, chestnut flanks striped with white, and creamy belly with black patch. Females are grayer, lacking the strong head pattern. Neither sex is as strongly scaled as the California Quail is"
    ],
    "Callipepla squamata": [
        "shape: A compact chickenlike bird with a small head and a distinctive short crest. It has a plump body, short tail, and short, strong legs",
        "size: Slightly larger than a Northern Bobwhite; about the same size as a Gambels Quail between robin and crow",
        "color: Adults are pale brownish with elegant dark scaling on the underparts. The head is plain brown with a buffy accent on the crest. The back is bluish gray and the wings are brown stippled with buff. Juveniles are similar but have a shorter crest, and the upperwing has a more ornate pattern"
    ],
    "Colinus virginianus": [
        "shape: Bobwhite are small quail with rounded bodies, small heads, rounded wings, and short tails",
        "size: between robin and crow",
        "color: They are intricately patterned in brown, rufous, buff, and black. Males have a bold black-and-white head pattern. Females have a buffy throat and eyebrow"
    ],
    "Bonasa umbellus": [
        "shape: Bonasa umbellus are fairly small grouse with a short, triangular crest and a long, fan-shaped tail. They have short legs and often look slimmer than other grouse species",
        "size: About the size of an American Crow; distinctly smaller than a Wild Turkey crow-sized",
        "color: Bonasa umbellus are intricately patterned with dark bars and spots on either a reddish-brown or grayish background. Dark bars down the side of the neck continue and widen on the belly. The tail is finely barred, with one wide, black band near the tip"
    ],
    "Meleagris gallopavo": [
        "shape: Meleagris gallopavos are very large, plump birds with long legs, wide, rounded tails, and a small head on a long, slim neck",
        "size: One of our largest and heaviest birds; smaller than a Trumpeter Swan; about twice the size (and four times as heavy) as a Ring-necked Pheasant goose-sized or larger",
        "color: Turkeys are dark overall with a bronze-green iridescence to most of their plumage. Their wings are dark, boldly barred with white. Their rump and tail feathers are broadly tipped with rusty or white. The bare skin of the head and neck varies from red to blue to gray"
    ],
    "Phasianus colchicus": [
        "shape: Phasianus colchicus is a large, chicken-like bird with a long, pointed tail. It has fairly long legs, a small head, long neck, and plump body",
        "size: Larger and longer-tailed than an American Crow; smaller than a Wild Turkey between crow and goose",
        "color: Male Phasianus colchicuss are gaudy birds with red faces and an iridescent green neck with a bold white ring. The males very long tail is coppery with thin, black bars. Females are brown with paler scaling on the upperparts; buff or cinnamon underparts with black spotting on the sides; and thin, black bars on their tails"
    ],
    "Gavia immer": [
        "shape: Gavia immers are large, diving waterbirds with rounded heads and dagger-like bills. They have long bodies and short tails that are usually not visible. In flight, they look stretched out, with a long, flat body and long neck and bill. Their feet stick out beyond the tail (unlike ducks and cormorants), looking like wedges",
        "size: Larger and longer-bodied than a Mallard, smaller and shorter-necked than a Canada Goose between crow and goose",
        "color: In summer, adults have a black head and bill, a black-and-white spotted back, and a white breast. From September to March, adults are plain gray on the back and head with a white throat. The bill also fades to gray. Juveniles look similar, but with more pronounced scalloping on the back"
    ],
    "Gavia pacifica": [
        "shape: A heavy-bodied water bird with a long thick neck and a strong, pointed bill (slighter than a Common Loons bill). It has long, pointed wings and short legs set far back on the body",
        "size: Slightly larger and sturdier than a Red-throated Loon, notably smaller than a Common Loon between crow and goose",
        "color: Breeding adults have dove-gray heads and black upperparts marked with crisp white lines. The throat is black with sharp black-and-white lines down the sides. Crown and back of neck pale gray. The chin and throat can show a purple gloss. Eye dark red, bill and legs dark. Nonbreeding adults are dark gray-brown above with very little white feather edging; and whitish below, sometimes with a neat dark line or chinstrap across the throat. Juveniles are similar to nonbreeding adult but usually show neat pale edges to feathers"
    ],
    "Gavia stellata": [
        "shape: A large ducklike seabird with long, sinuous neck, a thin but daggerlike bill, and long, narrow, pointed wings. The legs are set far back on the body and the feet trail behind the tail in flight",
        "size: Larger than a Red-breasted Merganser, smaller than a Common Loon between crow and goose",
        "color: Breeding adults are grayish brown above, pale below, with pale gray neck, rusty throat patch, and thin black-and-white stripes on back of neck and sides of breast. Nonbreeding adults are blackish above and white below, with a sharp border along the neck and a mostly white face with a black gab. Immatures are grayish brown above, pale below"
    ],
    "Antigone canadensis": [
        "shape: Antigone canadensiss are very large, tall birds with a long neck, long legs, and very broad wings. The bulky body tapers into a slender neck; the short tail is covered by drooping feathers that form a “bustle.” The head is small and the bill is straight and longer than the head",
        "size: About the same size, but considerably bulkier, than a Great Blue Heron. Smaller than a Whooping Crane goose-sized or larger",
        "color: These are slate gray birds, often with a rusty wash on the upperparts. Adults have a pale cheek and red skin on the crown. Their legs are black. Juveniles are gray and rusty brown, without the pale cheek or red crown"
    ],
    "Fulica americana": [
        "shape: The Fulica americana is a plump, chickenlike bird with a rounded head and a sloping bill. Their tiny tail, short wings, and large feet are visible on the rare occasions they take flight",
        "size: About two-thirds the size of a Mallard between robin and crow",
        "color: Coots are dark-gray to black birds with a bright-white bill and forehead. The legs are yellow-green. At close range you may see a small patch of red on the forehead"
    ],
    "Gallinula galeata": [
        "shape: Gallinula galeatas are medium-sized marsh birds with long legs and toes. In profile, note the small head, thin neck, and small, thin bill. Swimming birds frequently hold their wings up, such that the wingtips stick up on the back",
        "size: Larger than a Sora, smaller than a Mallard crow-sized",
        "color: Gallinula galeatas are mostly charcoal gray birds with a white stripe down their sides and white outer tail feathers. Adults have a bright red shield on their forehead and a red bill tipped in yellow. Immature birds look similar to adults, but lack the red shield and bill"
    ],
    "Porphyrio martinica": [
        "shape: A chicken-sized rail with a heavy conical bill, short tail (often cocked), a compact body, and very long legs and toes",
        "size: Slightly smaller than an American Coot, larger than a Sora crow-sized",
        "color: Adults are a medley of purplish head and body, greenish wings and back, a yellow-tipped red bill, baby-blue frontal shield, and bright yellow legs and feet. Juveniles show very little hint of these colors, being mostly brown above, khaki below, with much duller bill and legs. Immatures acquire their colors gradually in their first year"
    ],
    "Psaltriparus minimus": [
        "shape: Psaltriparus minimuss are tiny, kinglet-sized birds. They are plump and large-headed, with long tails and short, stubby bills",
        "size: Slightly smaller than a chickadee; about the size of a kinglet sparrow-sized or smaller",
        "color: Psaltriparus minimuss are fairly plain brown-and-gray birds. Slightly darker above than below, they have brown-gray heads, gray wings, and tan-gray underparts. Males in parts of the range have contrasting blackish face masks"
    ],
    "Eremophila alpestris": [
        "shape: Eremophila alpestriss are small, long-bodied songbirds that usually adopt a horizontal posture. They have short, thin bills, short necks, and rounded heads—the shape sometimes broken by two small “horns” of feathers sticking up toward the back of the head",
        "size: Larger than a Savannah Sparrow; smaller than an Eastern Meadowlark sparrow-sized or smaller",
        "color: Male Eremophila alpestriss are sandy to rusty brown above, with a black chest band, a curving black mask, and head stripes that extend to the back of the head (sometimes raised into tiny “horns”). The face and throat are either yellow or white (see Regional Differences). The underparts are white. Females have similar head and breast patterns but are less crisply defined"
    ],
    "Bombycilla cedrorum": [
        "shape: The Bombycilla cedrorum is a medium-sized, sleek bird with a large head, short neck, and short, wide bill. Waxwings have a crest that often lies flat and droops over the back of the head. The wings are broad and pointed, like a starlings. The tail is fairly short and square-tipped",
        "size: Slightly smaller than a Bohemian Waxwing between sparrow and robin",
        "color: Bombycilla cedrorums are pale brown on the head and chest fading to soft gray on the wings. The belly is pale yellow, and the tail is gray with a bright yellow tip. The face has a narrow black mask neatly outlined in white. The red waxy tips to the wing feathers are not always easy to see"
    ],
    "Bombycilla garrulus": [
        "shape: Bombycilla garruluss are full-bellied, thick-necked birds with a shaggy crest atop a pin head. The wings are broad and pointed, like a starling's. The tail is fairly short and square-tipped",
        "size: Larger than a bluebird, smaller than an American Robin robin-sized",
        "color: The Bombycilla garrulus is grayish brown overall with subtle peach blushing around its black mask. The wings have 2 distinctive white rectangular patches and red waxlike tips on the secondaries. The undertail is rusty and the tail is tipped in yellow. Juveniles are grayer overall with a streaked belly. Juveniles lack the adult's peach blushing around the face and the red-tipped secondaries"
    ],
    "Plectrophenax nivalis": [
        "shape: A medium-sized, full-bodied songbird with a small conical bill",
        "size: Larger than a Dark-eyed Junco, smaller than an American Robin between sparrow and robin",
        "color: Plectrophenax nivaliss have several plumages, but they always show white inner wings with black wingtips and a black-and-white tail. Breeding males are sharp white with a black back. Breeding females are whitish overall with a brown, streaky back and a dusky head. Nonbreeding males are white below with rusty patches on the crown, \"ear,\" and shoulder, and dark streaks down the back. Nonbreeding females have a rusty wash on the face and darker rusty patches on the breast. Breeding males and females have a dark bill that turns yellowish orange during the nonbreeding season"
    ],
    "Cardinalis cardinalis": [
        "shape: The Cardinalis cardinalis is a fairly large, long-tailed songbird with a short, very thick bill and a prominent crest. Cardinals often sit with a hunched-over posture and with the tail pointed straight down",
        "size: Slightly smaller than an American Robin between sparrow and robin",
        "color: Male cardinals are brilliant red all over, with a reddish bill and black face immediately around the bill. Females are pale brown overall with warm reddish tinges in the wings, tail, and crest. They have the same black face and red-orange bill"
    ],
    "Cardinalis sinuatus": [
        "shape: Cardinalis sinuatuss are stocky, medium-sized songbirds with tall crests and long tails. They have heavy but short seed-cracking bills with a curved culmen, or upper edge",
        "size: About the size of a Northern Cardinal; larger than a Black-throated Sparrow between sparrow and robin",
        "color: Overall, Cardinalis sinuatuss are gray or gray-brown birds with prominent flashes of red. Males are crisp gray with a red face and crest, a red stripe running down the breast, and a reddish tail. Females are buffy gray, with less red than males. Both sexes have yellowish bills and reddish highlights in the wings"
    ],
    "Passerina amoena": [
        "shape: Passerina amoenas are small, finchlike, stocky songbirds with cone-shaped bills and gently sloping foreheads. The tail is notched or slightly forked",
        "size: Larger than a Lesser Goldfinch, smaller than a Western Bluebird sparrow-sized or smaller",
        "color: Adult breeding males are brilliant blue above with a pumpkin-colored breast and a white belly. Adult males also have a white shoulder patch that stands out on perched and flying birds. Females are warm grayish-brown above, with a blue tinge to the wings and tail, two buffy wingbars, and an unstreaked pale cinnamon or tan breast. Juveniles and nonbreeding males have a pumpkin-colored breast, but their backs and heads are mottled blue and tan"
    ],
    "Passerina caerulea": [
        "shape: The Passerina caerulea is a stocky songbird with a very large, triangular bill that seems to cover the entire front of its face, from throat to forehead",
        "size: Larger than an Indigo Bunting; slightly smaller than a Brown-headed Cowbird between sparrow and robin",
        "color: Adult males are deep, rich blue with a tiny black mask in front of the eyes, chestnut wingbars, and a black-and-silver beak. Females are primarily rich cinnamon-brown. The color is richer on the head, paler on the underparts; their tails are bluish. Both sexes have two wingbars; the upper is chestnut and the lower is grayish to buffy. Immature Passerina caeruleas tend to a rich, dark chestnut brown, with chestnut wingbars"
    ],
    "Passerina ciris": [
        "shape: Passerina ciriss are medium-sized finchlike birds with stubby, thick, seed-eating bills",
        "size: Larger than an American Goldfinch; smaller than an Eastern Bluebird sparrow-sized or smaller",
        "color: Males are stunningly colored with blue heads, red underparts, and green backs. Females and immatures are a uniform, bright yellow-green overall, with a pale eyering. Though they are basically unpatterned, their overall color is greener and brighter than similar songbirds"
    ],
    "Passerina cyanea": [
        "shape: Passerina cyaneas are small (roughly sparrow-sized), stocky birds with short tails and short, thick, conical bills. In flight, the birds appear plump with short, rounded tails",
        "size: Sparrow-sized; slightly smaller than a House Finch sparrow-sized or smaller",
        "color: A breeding male Passerina cyanea is blue all over, with slightly richer blue on his head and a shiny, silver-gray bill. Females are basically brown, with faint streaking on the breast, a whitish throat, and sometimes a touch of blue on the wings, tail, or rump. Immature males are patchy blue and brown"
    ],
    "Pheucticus ludovicianus": [
        "shape: Pheucticus ludovicianuss are stocky, medium-sized songbirds with very large triangular bills. They are broad-chested, with a short neck and a medium-length, squared tail",
        "size: Smaller than an American Robin; larger than a House Finch robin-sized",
        "color: Adult males are black-and-white birds with a brilliant red chevron extending from the black throat down the middle of the breast. Females and immatures are brown and heavily streaked, with a bold whitish stripe over the eye. Males flash pink-red under the wings; females flash yellowish. Both sexes show white patches in the wings and tail"
    ],
    "Pheucticus melanocephalus": [
        "shape: Pheucticus melanocephaluss are hefty songbirds with very large bills that are conical and thick at the base. They have large heads and short, thick necks. A short tail imparts a compact, chunky look",
        "size: Larger and bulkier than a House Finch; more compact and slimmer than an American Robin robin-sized",
        "color: Breeding males are rich orange-cinnamon with a black head and black-and-white wings. Females and immature males are brown above with warm orange or buff on the breast, and some have streaks on the sides of the breast. All have grayish bills. In flight, they flash bright yellow under the wings"
    ],
    "Piranga ludoviciana": [
        "shape: Piranga ludovicianas are stocky songbirds; fairly small yet noticeably larger and heavier-bodied than warblers. They have short, thick-based bills and medium-length tails",
        "size: Larger than a Yellow Warbler; smaller than an American Robin between sparrow and robin",
        "color: Adult male Piranga ludovicianas are yellow birds with black wings and a flaming orange-red head. The wings have two bold wingbars; the upper one yellow and the lower white. The back and tail are black. Adult females have red restricted to the front of the face, with subdued yellow-green plumage on the body. Immatures in fall lack red, while in spring show less red on the head relative to that on adults of their respective sex"
    ],
    "Piranga olivacea": [
        "shape: Piranga olivaceas are medium-sized songbirds with fairly stocky proportions. They have thick, rounded bills suitable both for catching insects and eating fruit. The head is fairly large and the tail is somewhat short and broad",
        "size: Slightly smaller than a Northern Cardinal; larger than a Yellow Warbler between sparrow and robin",
        "color: In spring and summer, adult males are an unmistakable, brilliant red with black wings and tails. Females and fall immatures are olive-yellow with darker olive wings and tails. After breeding, adult males molt to female-like plumage, but with black wings and tail"
    ],
    "Piranga rubra": [
        "shape: Piranga rubras are medium-sized, chunky songbirds with big bodies and large heads. They have large, thick, blunt-tipped bills",
        "size: Smaller than an American Robin; larger than a Yellow Warbler between sparrow and robin",
        "color: Adult male Piranga rubras are entirely bright red. Females and immature males are bright yellow-green—yellower on the head and underparts and slightly greener on the back and wings. The bill is pale. Molting immature males can be patchy yellow and red"
    ],
    "Spiza americana": [
        "shape: Compact and sparrowlike, with a full chest, a large, thick bill, and a relatively short tail",
        "size: Slightly larger than a Song Sparrow, about the same size as a House Sparrow sparrow-sized or smaller",
        "color: Adult males are grayish on the head with a yellow face and chest, crossed with a bold black V. The back is brown and gray, with warm reddish-brown shoulders. Females have a similar but more subdued pattern and lack the black V on the throat. Immatures are browner, without the cool gray or bright yellow tones; note the broad eyebrow stripe and neat dark malar (mustache) stripe"
    ],
    "Certhia americana": [
        "shape: Certhia americanas are tiny yet lanky songbirds. They have long, spine-tipped tails, slim bodies, and slender, decurved bills",
        "size: Smaller than a White-breasted Nuthatch; larger than a Golden-crowned Kinglet sparrow-sized or smaller",
        "color: Streaked brown and buff above, with their white underparts usually hidden against a tree trunk, Certhia americanas blend easily into bark. Their brownish heads show a broad, buffy stripe over the eye (supercilium)"
    ],
    "Cinclus mexicanus": [
        "shape: Medium-sized, round-bodied, and chunky, with long legs, rounded head and short neck, a short, sturdy bill, and a short tail",
        "size: Larger and heavier-bodied than a Western Bluebird, smaller than an American Robin robin-sized",
        "color: Adults are dark gray all over, slightly more brownish around the head. Legs are pink and the bill is black. Young birds have faintly barred underparts and a yellowish bill. Look for distinct white eyelids when they blink"
    ],
    "Aphelocoma coerulescens": [
        "shape: A large and sturdy bird with a long tail and hefty legs. This uncrested jay has a big flat head and a heavy bill",
        "size: Larger than an Eastern Towhee, smaller than an American Crow robin-sized",
        "color: Dull blue overall with a whitish forehead and a pale gray back and belly. Juveniles are grayer overall than adults and lack the adults blue head"
    ],
    "Aphelocoma wollweberi": [
        "shape: A large songbird with a robust body, long tail, short neck, heavy, pointed bill, and long, strong legs and feet",
        "size: Slightly larger than a Blue Jay, smaller than an American Crow between robin and crow",
        "color: Adult is cerulean blue above, dingy below, with brown-gray back, dark eye, and dark bill. Juvenile is similar but plumage mostly darker gray; bill has irregular pale base"
    ],
    "Corvus brachyrhynchos": [
        "shape: A large, long-legged, thick-necked bird with a heavy, straight bill. In flight, the wings are fairly broad and rounded with the wingtip feathers spread like fingers. The short tail is rounded or squared off at the end",
        "size: Nearly twice the size of a Blue Jay; about two-thirds the size of a Common Raven crow-sized",
        "color: Corvus brachyrhynchoss are all black, even the legs and bill. When crows molt, the old feathers can appear brownish or scaly compared to the glossy new feathers"
    ],
    "Corvus corax": [
        "shape: Not just large but massive, with a thick neck, shaggy throat feathers, and a Bowie knife of a beak. In flight, ravens have long, wedge-shaped tails. They're more slender than crows, with longer, narrower wings, and longer, thinner “fingers” at the wingtips",
        "size: About half again larger than an American Crow or Chihuahuan Raven crow-sized",
        "color: Corvus coraxs are entirely black, right down to the legs, eyes, and beak"
    ],
    "Corvus ossifragus": [
        "shape: Corvus ossifraguss fit the standard crow shape: hefty, well-proportioned birds with heavy bills, sturdy legs, and broad wings. At rest, Corvus ossifraguss’ wings fall short of their medium-length, square tails",
        "size: Very slightly smaller than an American Crow crow-sized",
        "color: Corvus ossifraguss are all black. Immatures are less glossy and can become brownish as their feathers wear in their first year"
    ],
    "Cyanocitta cristata": [
        "shape: Large crested songbird with broad, rounded tail. Cyanocitta cristatas are smaller than crows, larger than robins",
        "size: About the same size as a Western Scrub-Jay robin-sized",
        "color: White or light gray underneath, various shades of blue, black, and white above"
    ],
    "Cyanocitta stelleri": [
        "shape: Cyanocitta stelleris are large songbirds with large heads, chunky bodies, rounded wings, and a long, full tail. The bill is long, straight, and powerful, with a slight hook. Cyanocitta stelleris have a prominent triangular crest that often stands nearly straight up from their head",
        "size: About the same size as a Western Scrub-Jay between robin and crow",
        "color: At a distance, Cyanocitta stelleris are very dark jays, lacking the white underparts of most other species. The head is charcoal black and the body is all blue (lightest, almost sparkling, on the wings). White markings above the eye are fairly inconspicuous"
    ],
    "Cyanocorax yncas": [
        "shape: A sturdy jay without a crest. It has a thick, straight bill, a long, rounded tail, and fairly long legs. In flight the wings are broad and rounded",
        "size: Larger than a Northern Mockingbird, smaller than a Northern Flicker; similar in size to a Blue Jay between robin and crow",
        "color: Rich green above and pale yellow-green below, with a blue crown, black throat and eyepatch, and yellow outer tail feathers"
    ],
    "Nucifraga columbiana": [
        "shape: Nucifraga columbianas are the size of a jay but the shape of a crow, with short tails and rounded, crestless heads. The bill is long, straight, and sharp-tipped",
        "size: Smaller than an American Crow; about the size of a Stellers Jay but more compact between robin and crow",
        "color: Nucifraga columbianas are pale gray birds with black wings. In flight, the wings show large white patches along the trailing edges (secondaries). The tail is black in the center with broad white along either side. Nutcrackers have black bills, legs, and feet"
    ],
    "Pica hudsonia": [
        "shape: Pica hudsonias are slightly larger than jays with much longer, diamond-shaped tails and heavier bills. In flight, their wings seem to be too short to support their graceful flight",
        "size: Larger than a jay but smaller than a raven crow-sized",
        "color: These birds are black and white overall with blue-green iridescent flashes in the wing and tail. The upperparts are mostly black with a white patch in the outer wing and two white stripes (“backpack straps”) on the back"
    ],
    "Pica nuttalli": [
        "shape: A very large songbird with a heavy body, a large head, and an extremely long tail. The bill is stout and slightly curved. The wings are wide and rounded",
        "size: Much larger than a California Scrub-Jay, slightly smaller than an American Crow between robin and crow",
        "color: A black-and-white bird with iridescent blue in the wings and a bright yellow bill. When perched, the shoulders and belly are stark white against the black body. In flight, the primary feathers (in the outer wing) show extensive white as well"
    ],
    "Acanthis flammea": [
        "shape: Acanthis flammeas are small songbirds with small heads and small, pointed, seed-eating bills. The tail is short with a small notch at the tip",
        "size: About the size of an American Goldfinch sparrow-sized or smaller",
        "color: Acanthis flammeas are brown and white birds with heavily streaked sides. Look for a small red forehead patch, black feathering around a yellow bill, and two white wingbars. Males have a pale red vest on the chest and upper flanks"
    ],
    "Acanthis hornemanni": [
        "shape: A very small songbird with a short, notched tail and a thick-based but very small bill that looks “pushed in” compared to Common Redpoll. Fluffed up plumage often makes this species appear portly",
        "size: Larger than a Golden-crowned Kinglet, smaller than a House Finch sparrow-sized or smaller",
        "color: Acanthis hornemannis are pale whitish birds with gray-brown streaks. Adults have a small red patch on the forecrown. They have darker gray tail and wings, with bold white wingbars. Some individuals have a rosy tint to the rump and underparts, or a buff tint to the face and back. Adult females are less strikingly white overall than males. Juveniles are brownish and streaky, often with buff tones in the face"
    ],
    "Coccothraustes vespertinus": [
        "shape: Coccothraustes vespertinuss are large, heavyset finches with very thick, powerful, conical bills. They have a thick neck, full chest, and relatively short tail",
        "size: About the size of a Northern Cardinal, but more compact and thicker bodied; smaller than a Stellers Jay or Blue Jay robin-sized",
        "color: Adult male Coccothraustes vespertinuss are yellow and black birds with a prominent white patch in the wings. They have dark heads with a bright-yellow stripe over the eye. Females and immatures are mostly gray, with white-and-black wings and a greenish-yellow tinge to the neck and flanks. The bill is pale ivory on adult males and greenish-yellow on females"
    ],
    "Haemorhous cassinii": [
        "shape: Haemorhous cassiniies are small songbirds with peaked heads and short-medium tails. Their heavy bills are fairly long and straight-sided, and their tails are obviously notched. Their wings are long and, when perched, the tips project farther down the tail than in other finches",
        "size: About the size of a House Finch but somewhat heftier; larger than a Pine Siskin sparrow-sized or smaller",
        "color: Adult males are rosy pink overall with the most intense red on the crown. Female and immature Haemorhous cassiniies are brown-and-white birds with crisp, dark streaks on the chest and underparts. Both males and females have streaked undertail coverts and often show a thin, white eyering"
    ],
    "Haemorhous mexicanus": [
        "shape: Haemorhous mexicanuses are small-bodied finches with fairly large beaks and somewhat long, flat heads. The wings are short, making the tail seem long by comparison. Many finches have distinctly notched tails, but the Haemorhous mexicanus has a relatively shallow notch in its tail",
        "size: Same size as a House Sparrow, but more slender overall sparrow-sized or smaller",
        "color: Adult males are rosy red around the face and upper breast, with streaky brown back, belly and tail. In flight, the red rump is conspicuous. Adult females aren’t red; they are plain grayish-brown with thick, blurry streaks and an indistinctly marked face"
    ],
    "Haemorhous purpureus": [
        "shape: Among the small forest birds like chickadees, kinglets, and nuthatches, Haemorhous purpureuses are large and chunky. Their powerful, conical beaks are larger than any sparrows. The tail seems short and is clearly notched at the tip",
        "size: About the same size as House Finch and House Sparrow sparrow-sized or smaller",
        "color: Male Haemorhous purpureuses are delicate pink-red on the head and breast, mixing with brown on the back and cloudy white on the belly. Female Haemorhous purpureuses have no red. They are coarsely streaked below, with strong facial markings including a whitish eyestripe and a dark line down the side of the throat"
    ],
    "Leucosticte tephrocotis": [
        "shape: A small songbird with a short, conical bill and a fairly short tail. Subspecies on the Aleutian and Pribilof Islands are considerably larger, shaped more like a grosbeak than a small finch",
        "size: Larger than an American Goldfinch, slightly smaller than a House Sparrow (except on Alaskan islands, where they are nearly as large as an Evening Grosbeak) sparrow-sized or smaller",
        "color: Adult males are rich brown suffused with pink on the body, with gray sides of the head and a black forecrown and throat. Adult females are similar but with less extensive pink. The bill is yellow. Juveniles are brownish overall with grayish wings and a dusky bill"
    ],
    "Loxia curvirostra": [
        "shape: A stocky, medium-sized songbird with short, notched tail and an unusual, twisted bill that crosses when closed",
        "size: Larger than a warbler, smaller than a Red-winged Blackbird, but theres much size variation: the smallest types are barely larger than a Black-capped Chickadee, while the largest are larger than a Brown-headed Cowbird sparrow-sized or smaller",
        "color: Adult males are brick red overall, with darker wings and tail. Females are mostly yellowish below, brownish or olive brown above. Immatures are brownish above, pale with brownish streaking below"
    ],
    "Loxia leucoptera": [
        "shape: A compact, medium-sized finch with slightly forked tail and heavy, crossed bill",
        "size: Larger than a Pine Siskin, smaller than a Pine Grosbeak sparrow-sized or smaller",
        "color: Adult males are rose-pink with black wings and tail and two white wingbars. Females and young males are yellowish but with the same wing and tail pattern. Immatures are brownish, streaked below, with whitish wingbars"
    ],
    "Pinicola enucleator": [
        "shape: The Pinicola enucleator is a large and plump, heavy-chested finch with a round head. Its bill is thick and conical, but much stubbier than in other finch species. The tail is long and slightly notched",
        "size: Larger than a Cassin's Finch, smaller than a Steller's Jay robin-sized",
        "color: Males are reddish pink and gray. Females and immatures are grayish with tints of reddish orange or yellow on the head and rump. They all have dark gray wings marked by 2 white wingbars. The amount of reddish pink on the bellies of males and the head and rump color on females is variable"
    ],
    "Spinus pinus": [
        "shape: Spinus pinuss are very small songbirds with sharp, pointed bills and short, notched tails. Their uniquely shaped bill is more slender than that of most finches. In flight, look for their forked tails and pointed wingtips",
        "size: Slightly smaller than an American Goldfinch sparrow-sized or smaller",
        "color: Pine siskins are brown and very streaky birds with subtle yellow edgings on wings and tails. Flashes of yellow can erupt as they take flight, flutter at branch tips, or display during mating"
    ],
    "Spinus psaltria": [
        "shape: Spinus psaltriaes are tiny, stub-billed songbirds with long, pointed wings, and short, notched tails",
        "size: Smaller than a Song Sparrow; about the size of an American Goldfinch sparrow-sized or smaller",
        "color: Males are bright yellow below with a glossy black cap and white patches in the wings; their backs can be glossy black or dull green (particularly on the West Coast). They have a black tail with large, white corners. Females and immatures have olive backs, dull yellow underparts, and black wings marked by two whitish wingbars"
    ],
    "Spinus tristis": [
        "shape: A small finch with a short, conical bill and a small, head, long wings, and short, notched tail",
        "size: Smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: Adult males in spring and early summer are bright yellow with black forehead, black wings with white markings, and white patches both above and beneath the tail. Adult females are duller yellow beneath, olive above. Winter birds are drab, unstreaked brown, with blackish wings and two pale wingbars"
    ],
    "Hirundo rustica": [
        "shape: When perched, the sparrow-sized Hirundo rustica appears cone shaped, with a slightly flattened head, no visible neck, and broad shoulders that taper to long, pointed wings. The tail extends well beyond the wingtips and the long outer feathers give the tail a deep fork",
        "size: Slightly smaller than a bluebird; slightly larger than a Tree Swallow sparrow-sized or smaller",
        "color: Hirundo rusticas have a steely blue back, wings, and tail, and rufous to tawny underparts. The blue crown and face contrast with the cinnamon-colored forehead and throat. White spots under the tail can be difficult to see except in flight. Males are more boldly colored than females"
    ],
    "Petrochelidon fulva": [
        "shape: Petrochelidon fulvas have a cylindrical body with long, pointed wings and a square-tipped tail that sometimes shows a slight notch. The bill is very short and the feet very small",
        "size: Slightly larger than a Bank Swallow, smaller than a Barn Swallow sparrow-sized or smaller",
        "color: Petrochelidon fulvas are dark above and pale below. The most notable features for ID include the chestnut rump, forehead, and cheeks, and the pale chestnut throat"
    ],
    "Petrochelidon pyrrhonota": [
        "shape: These compact swallows have rounded, broad-based wings, a small head, and a medium-length, squared tail",
        "size: Smaller than a Purple Martin; slightly larger than a Bank Swallow sparrow-sized or smaller",
        "color: In poor light, Petrochelidon pyrrhonotas look brownish with dark throats and white underparts. In good light you’ll see their metallic, dark-blue backs and pale, pumpkin-colored rumps. They have rich, brick-red faces and a bright buff-white forehead patch like a headlamp. Some juveniles show whitish throats in summer and fall"
    ],
    "Progne subis": [
        "shape: Progne subiss are very large, broad-chested swallows. They have stout, slightly hooked bills, short, forked tails, and long, tapered wings",
        "size: Smaller than an American Robin; larger than a Tree Swallow between sparrow and robin",
        "color: Adult males are iridescent, dark blue-purple overall with brown-black wings and tail. Females and immatures are duller, with variable amounts of gray on the head and chest and a whitish lower belly"
    ],
    "Riparia riparia": [
        "shape: A small swallow with a chunky body, large head, relatively short pointed wings, and a slightly forked tail",
        "size: The smallest of North Americas swallow species, similar in size to a Chimney Swift but with shorter, broader wings between sparrow and robin",
        "color: A warm brown swallow with white underparts and a thick brown band across the chest. The head is brown with a white chin. Underwings are dark"
    ],
    "Stelgidopteryx serripennis": [
        "shape: Small, long-bodied bird with a small head and bill. Flies on long and relatively broad, pointed wings. Note square tail",
        "size: Larger than Ruby-throated Hummingbird, smaller than a Purple Martin sparrow-sized or smaller",
        "color: Entirely brown above with a dingy throat and chest that fades to white. Sexes similar. Juveniles look like adults, but have cinnamon wingbars"
    ],
    "Tachycineta bicolor": [
        "shape: Tachycineta bicolors are streamlined small songbirds with long, pointed wings and a short, squared or slightly notched tail. Their bills are very short and flat",
        "size: Smaller than a Purple Martin; slightly larger than a Bank Swallow sparrow-sized or smaller",
        "color: Adult males are blue-green above and white below with blackish flight feathers and a thin black eye mask; females are duller with more brown in their upperparts, and juveniles are completely brown above. Juveniles and some females can show a weak, blurry gray-brown breast band"
    ],
    "Tachycineta thalassina": [
        "shape: Tachycineta thalassinas are small sleek birds with long pointed wings and slightly forked tails. Their wingtips extend beyond their short tail—especially noticeable when perched",
        "size: About the same size as a Bank Swallow, but smaller than a Barn Swallow sparrow-sized or smaller",
        "color: On first look, Tachycineta thalassinas appear dark above and crisp white below. In good light, the greenish-bronze back and iridescent violet rump come to life. All individuals have white bellies that wrap around to the upper side of the rump, creating \"saddlebags.\" Males have white cheek patches while females and juveniles have dusky cheeks. Juveniles have grayish-brown backs and crowns"
    ],
    "Agelaius phoeniceus": [
        "shape: A stocky, broad-shouldered blackbird with a slender, conical bill and a medium-length tail. Agelaius phoeniceuss often show a hump-backed silhouette while perched; males often sit with tail slightly flared",
        "size: About three-quarters the size of a Common Grackle robin-sized",
        "color: Male Agelaius phoeniceuss are hard to mistake. They're an even glossy black with red-and-yellow shoulder badges. Females are crisply streaked and dark brownish overall, paler on the breast and often show a whitish eyebrow"
    ],
    "Dolichonyx oryzivorus": [
        "shape: Dolichonyx oryzivoruss are small songbirds with large, somewhat flat heads, short necks, and short tails. They are related to blackbirds and orioles, and they have a similar shaped, sharply pointed bill",
        "size: Larger than a Field Sparrow; smaller than a Red-winged Blackbird robin-sized",
        "color: Breeding male Dolichonyx oryzivoruss are mostly black with a white back and rump, and a rich buffy nape. Females and nonbreeding males are warm buffy brown, streaked with dark brown on the back and flanks. They have bold brown stripes on the crown but are unstreaked on the nape of the neck. The bill is pinkish"
    ],
    "Euphagus carolinus": [
        "shape: Euphagus carolinus is a medium-sized blackbird with a slender bill and medium-length tail. The bill is slightly decurved. They are a bit larger and longer-tailed than Red-winged Blackbird with a more slender bill. Euphagus carolinus is thinner-billed and shorter-tailed than Common Grackle",
        "size: robin-sized",
        "color: In winter, male Euphagus carolinuss are recognized by their rusty feather edges, pale yellow eye and buffy eyebrow. Females are gray-brown; they also have rusty feather edges, pale eyes and a bold eyebrow, contrasting with darker feathers right around the eye. Breeding males are dark glossy black"
    ],
    "Euphagus cyanocephalus": [
        "shape: A small, fairly long-legged songbird with the well-proportioned look of many blackbirds: the fairly long tail is balanced by a full body, round head, and long, thick-based beak. In perching males, the tail appears widened and rounded toward the tip",
        "size: About the size of a Red-winged Blackbird robin-sized",
        "color: Males are glossy black all over with a staring yellow eye and a blue sheen on the head grading to greenish iridescence on the body. Females are plainer brown, darkest on the wings and tail, with a dark eye. Immature birds look like washed out, lighter-brown versions of the females"
    ],
    "Icterus bullockii": [
        "shape: Bullock's Orioles are medium-sized songbirds with slim but sturdy bodies and medium-long tails. Orioles are related to blackbirds and share their long, thick-based, sharply pointed bills",
        "size: Larger than a Yellow Warbler; about the same size but slimmer than a Brewer's Blackbird robin-sized",
        "color: Adult males are bright orange with a black back and large white wing patch. The face is orange with a black line through the eye and a black throat. Females and immatures are yellowish-orange on the head and tail, with grayish back and white-edged wing coverts. Immature males show a black throat patch"
    ],
    "Icterus cucullatus": [
        "shape: Icterus cucullatuss are fairly large songbirds with longer and more delicate bodies than other orioles. They also have long rounded tails and longish necks. The bill is curved slightly downward, more so than in most other orioles",
        "size: Larger than a House Finch, smaller than a Western Kingbird robin-sized",
        "color: Adult males are brilliant black and vary from brilliant yellow to flame orange. They have black tails, throats, and wings and yellow to orange rumps, hoods, and bellies. The black throat extends up the face creating a little mask around the eye and down the chest to make a bib. Adult males flash white wingbars. Females are olive-yellow overall with grayer backs and thin white wingbars. Juvenile males look like females, but with black throats"
    ],
    "Icterus galbula": [
        "shape: Smaller and more slender than an American Robin, Icterus galbulas are medium-sized, sturdy-bodied songbirds with thick necks and long legs. Look for their long, thick-based, pointed bills, a hallmark of the blackbird family they belong to",
        "size: About the size of a Red-winged Blackbird, but slimmer robin-sized",
        "color: Adult males are flame-orange and black, with a solid-black head and one white bar on their black wings. Females and immature males are yellow-orange on the breast, grayish on the head and back, with two bold white wing bars"
    ],
    "Icterus parisorum": [
        "shape: A medium-sized, sturdy-bodied songbird with a long tail, long, straight, spikelike bill, and strong legs and feet",
        "size: Slightly larger than a Bullocks Oriole, smaller than a Stellers Jay between sparrow and robin",
        "color: Adult males are vivid lemon yellow below, velvety black above, with black throat and chest. They have white wingbars, a yellow shoulder, and a black-and-yellow tail. Adult females are dull yellow below, olive-green above, with faint wingbars and some stippling on the head. Immature (year-old) males are intermediate between female and adult male, with a black face, throat, and upper breast. Juveniles and immature females are similar to adult females but duller"
    ],
    "Icterus spurius": [
        "shape: Icterus spuriuss are slim songbirds, larger than warblers and vireos. They have medium-length tails, rounded heads, and a straight, sharply pointed bill",
        "size: Larger than a Yellow Warbler; smaller than a Baltimore Oriole between sparrow and robin",
        "color: Adult males are black above and rich reddish-chestnut below. They have a black head and throat, with a reddish-chestnut patch at the bend of the wing. Females are greenish yellow with two white wing bars and no black. Immature males look like females, but have black around the bill and throat"
    ],
    "Molothrus aeneus": [
        "shape: A solidly built songbird with a thick-based, sharply pointed, slightly curved bill. Males have a thick neck, especially when they fluff out the feathers of the nape during displays",
        "size: Larger than a Brown-headed Cowbird, smaller than an Eastern or Western Meadowlark; similar in size to a Red-winged Blackbird robin-sized",
        "color: Adult males are blackish with a soft bronze sheen. The wings appear purplish blue at close range. Adult females and juveniles in the eastern part of the range are blackish; in the western part of the range they are grayish brown. Adults have vivid red eyes; juveniles have dark eyes"
    ],
    "Molothrus ater": [
        "shape: Molothrus aters are smallish blackbirds, with a shorter tail and thicker head than most other blackbirds. The bill has a distinctive shape: its much shorter and thicker-based than other blackbirds', almost finch-like at first glance. In flight, look for the shorter tail",
        "size: Slightly smaller than a Red-winged Blackbird between sparrow and robin",
        "color: Male Molothrus aters have glossy black plumage and a rich brown head that often looks black in poor lighting or at distance. Female Molothrus aters are plain brown birds, lightest on the head and underparts, with fine streaking on the belly and a dark eye"
    ],
    "Molothrus bonariensis": [
        "shape: A stout songbird with a short, thick-based, finely pointed bill and moderately long wings and tail",
        "size: Slightly larger than an Eastern Bluebird, smaller than a Red-winged Blackbird robin-sized",
        "color: Adult males appear blackish from a distance; in good light they are velvety purple. Adult females are brown overall with a pale eyebrow and throat. Juveniles are also brownish but heavily streaked below, similar to juvenile Brown-headed Cowbirds"
    ],
    "Quiscalus major": [
        "shape: Quiscalus majors are large, lanky songbirds with rounded crowns, long legs, and fairly long, pointed bills. Males have very long tails that make up almost half their body length and that they typically hold folded in a V-shape, like the keel of a boat",
        "size: Smaller than a Fish Crow; larger than a Common Grackle between robin and crow",
        "color: Males are glossy black all over. Females are dark brown above and russet below, with a subtle face pattern made up of a pale eyebrow, dark cheek, and pale “mustache” stripe. Eye color ranges from dull brown along the western Gulf Coast to bright yellow along the Atlantic Coast"
    ],
    "Quiscalus mexicanus": [
        "shape: Male Quiscalus mexicanuss are long-legged, slender blackbirds with a flat-headed profile and stout, straight bills. The males tapered tail is nearly as long as its body and folds into a distinctive V or keel shape. Females are about half the size of males with long, slender tails",
        "size: Exceptionally long-tailed and large songbird. Much smaller by weight than an American Crow, but about the same length between robin and crow",
        "color: Male Quiscalus mexicanuss are iridescent black with piercing yellow eyes, and black bills and legs. Females are dark brown above, paler below, with a buff-colored throat and stripe above the eye. Juveniles have the females dark brown plumage, with streaked underparts and a dark eye"
    ],
    "Quiscalus quiscula": [
        "shape: Quiscalus quisculas are large, lanky blackbirds with long legs and long tails. The head is flat and the bill is longer than in most blackbirds, with the hint of a downward curve. In flight, the wings appear short in comparison to the tail. Males are slightly larger than females",
        "size: Larger than a Red-winged Blackbird; about the same size as a Mourning Dove robin-sized",
        "color: Quiscalus quisculas appear black from a distance, but up close their glossy purple heads contrast with bronzy-iridescent bodies. A bright golden eye gives grackles an intent expression. Females are slightly less glossy than males. Young birds are dark brown with a dark eye"
    ],
    "Sturnella magna": [
        "shape: Sturnella magnas are chunky, medium-sized songbirds with short tails and long, spear-shaped bills. In flight, their rounded wings, short tails, and long bills help set them apart from other grassland songbirds",
        "size: Slightly larger but more compact than an American Robin; smaller than a Blue Jay robin-sized",
        "color: Sturnella magnas are pale brown marked with black, with bright-yellow underparts and a bold black V across the chest. Though most of the tail is brown with blackish barring, the outer feathers are white and conspicuous during flight"
    ],
    "Sturnella neglecta": [
        "shape: The Sturnella neglecta is the size of a robin but chunkier and shorter-tailed, with a flat head, long, slender bill, and a round-shouldered posture that nearly conceals its neck. The wings are rounded and short for the birds size and the tail is short, stiff, and spiky",
        "size: About the size of an American Robin, but with a shorter tail robin-sized",
        "color: Sturnella neglectas have yellow underparts with intricately patterned brown, black and buff upperparts. A black “V” crosses the bright yellow breast; it is gray in winter. Contrasting stripes of dark brown and light buff mark the head. The outer tail feathers flash white in flight"
    ],
    "Xanthocephalus xanthocephalus": [
        "shape: Xanthocephalus xanthocephaluss are fairly large blackbirds, with a stout body, a large head, and a long, conical bill",
        "size: Smaller than a Common Grackle; larger than a Red-winged Blackbird robin-sized",
        "color: Males are striking blackbirds with yellow heads and chests, and black bodies with prominent white patches at the bend of the wing. Females and immatures are brown instead of black, with duller yellow heads. Immature males show some white at the bend of the wing, while females don’t"
    ],
    "Icteria virens": [
        "shape: Chats are small songbirds but are larger and bulkier than warblers or vireos. They have a long tail, large head and a relatively thick, heavy bill",
        "size: Larger than a Yellow Warbler; smaller than an American Robin between sparrow and robin",
        "color: Chats are olive-green above with a bright yellow breast and bold face markings. The face is gray, with a white eyering that connects to the bill, forming “spectacles.” They also have a white malar or mustache stripe bordering the cheek. The lower belly is white"
    ],
    "Lanius borealis": [
        "shape: A fairly large songbird with a thick neck and a large, rounded head with a thick, hooked bill. It has short wings and a long, rounded tail",
        "size: Slightly larger than a Loggerhead Shrike, smaller than a Blue Jay robin-sized",
        "color: Adults are gray birds with black masks and black in the wings and tail. They are paler below, often with faint, fine gray barring. The black mask does not go across the top of the bill. The tail is edged in white and the wings have a white flash, especially noticeable in flight. Juveniles and immatures are brownish with a faint mask, and show more distinct barring below than adults"
    ],
    "Lanius ludovicianus": [
        "shape: Lanius ludovicianuss are thick-bodied songbirds. They have large, blocky heads and a thick bill with a small hook. The tail is fairly long and rounded",
        "size: Smaller and more slender than an American Robin; larger and longer-tailed than a Western Bluebird robin-sized",
        "color: The Lanius ludovicianus is a gray bird with a black mask and white flashes in the black wings. The gray head contrasts with the wide, black mask, black bill, and white throat. The tail is black with white corners; the wings are black with white at the base of the primaries that form a small “handkerchief” spot when the wing is closed and larger white patches in flight. Juveniles have darker barring above and below"
    ],
    "Dumetella carolinensis": [
        "shape: A medium-sized, slender songbird with a long, rounded, black tail and a narrow, straight bill. Catbirds are fairly long legged and have broad, rounded wings",
        "size: Slightly smaller than a Northern Mockingbird robin-sized",
        "color: Catbirds give the impression of being entirely slaty gray. With a closer look you’ll see a small black cap, blackish tail, and a rich rufous-brown patch under the tail"
    ],
    "Mimus polyglottos": [
        "shape: A medium-sized songbird, a bit more slender than a thrush and with a longer tail. Mockingbirds have small heads, a long, thin bill with a hint of a downward curve, and long legs. Their wings are short, rounded, and broad, making the tail seem particularly long in flight",
        "size: Slightly larger than a Gray Catbird robin-sized",
        "color: Mockingbirds are overall gray-brown, paler on the breast and belly, with two white wingbars on each wing. A white patch in each wing is often visible on perched birds, and in flight these become large white flashes. The white outer tail feathers are also flashy in flight"
    ],
    "Oreoscoptes montanus": [
        "shape: Oreoscoptes montanuss are fairly small songbirds with relatively long legs and tail. They are the smallest of the thrashers. The bill is much shorter and straighter than the bills of other thrashers. When perched, Oreoscoptes montanuss often stand erect with their wings slightly drooped, like a thrush",
        "size: Larger but more slender than a Western Bluebird; slightly smaller than a Northern Mockingbird robin-sized",
        "color: Oreoscoptes montanuss are drab gray above with spotted underparts. Black spotting on the breast turns to fine streaks along cinnamon-tinged flanks. In summer, these streaks can become less distinct from feather wear. Tips of the outer tail feathers are white, there are two whitish wingbars, and the eye is yellow"
    ],
    "Toxostoma curvirostre": [
        "shape: A lanky songbird with a long, curved bill, long tail, and thick legs, recalling a mockingbird but bulkier and with a different bill",
        "size: Slightly larger than an American Robin, smaller than a Woodhouses Scrub-Jay robin-sized",
        "color: Grayish brown above, paler off-white below mottled with indistinct gray-brown speckling. The eye is orange-yellow"
    ],
    "Toxostoma redivivum": [
        "shape: A large, lanky songbird with a very long tail and long legs. The bill is very long and strongly curved. It has wide wings",
        "size: Larger than a Northern Mockingbird, smaller than a Yellow-billed Magpie robin-sized",
        "color: Brown to grayish brown overall with a pale throat and a buffy or rusty patch under the tail"
    ],
    "Toxostoma rufum": [
        "shape: Toxostoma rufums are fairly large, slender songbirds with long proportions—the legs are long and sturdy, and the bill is long and slightly downcurved. The tail is long, too, and often cocked upward in the manner of wrens",
        "size: Slightly smaller than a Blue Jay; slightly larger than a Northern Mockingbird robin-sized",
        "color: Toxostoma rufums are foxy brown birds with heavy, dark streaking on their whitish underparts. The face is gray-brown and the wings show two black-and-white wingbars. They have bright-yellow eyes"
    ],
    "Anthus rubescens": [
        "shape: A small, slim songbird with a short, thin bill, and medium-length tail, recalling a lark (or a sparrow, but lacking a sparrows heavier bill)",
        "size: Larger than a Yellow-rumped Warbler, smaller than a White-crowned Sparrow sparrow-sized or smaller",
        "color: Brownish or grayish above, pale below, with most subspecies showing streaks in the breast and sides, especially in winter"
    ],
    "Baeolophus atricristatus": [
        "shape: A medium-sized songbird with a long tail, short bill, and distinctive crest",
        "size: Larger than a Carolina Chickadee, slightly smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Medium gray above, pale below, with grayish flanks and black crest; sides and forehead sometimes tinged buff"
    ],
    "Baeolophus bicolor": [
        "shape: Tufted Titmice look large among the small birds that come to feeders, an impression that comes from their large head and eye, thick neck, and full bodies. The pointed crest and stout bill help identify titmice even in silhouette",
        "size: Noticeably larger than a chickadee sparrow-sized or smaller",
        "color: Soft silvery gray above and white below, with a rusty or peach-colored wash down the flanks. A black patch just above the bill makes the bird look snub-nosed"
    ],
    "Baeolophus inornatus": [
        "shape: Oak Titmice are small songbirds with short, stubby bills, a short crest on the head, and a medium-long tail",
        "size: Smaller than a Western Bluebird; slightly larger than a Black-throated Gray Warbler sparrow-sized or smaller",
        "color: Oak Titmice are plain gray-brown birds. They are slightly darker above than below, and may show a slight buffy wash on the flanks"
    ],
    "Baeolophus ridgwayi": [
        "shape: The Baeolophus ridgwayi is a small songbird, but the long body, short neck, and medium-long tail makes it appear bigger than it is. A short crest gives the fairly large head a pointed silhouette. The short bill is fairly thick and round",
        "size: Larger than a Bushtit, smaller than a Dark-eyed Junco sparrow-sized or smaller",
        "color: The Baeolophus ridgwayi is gray overall with a slightly paler gray belly. The dark eye stands out on an otherwise plain gray bird. The bill is also dark"
    ],
    "Baeolophus wollweberi": [
        "shape: A small songbird with a short, pointy crest, a short, stubby bill, a moderately long tail, and rounded wings",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Western Bluebird sparrow-sized or smaller",
        "color: An ashy gray bird with a boldly striped black-on-white face made up of a sweeping black line on the crest, a line through the eye and bordering the cheek, and black patches on the nape and throat"
    ],
    "Poecile atricapillus": [
        "shape: This tiny bird has a short neck and large head, giving it a distinctive, rather spherical body shape. It also has a long, narrow tail and a short bill a bit thicker than a warblers but thinner than a finchs",
        "size: Smaller than a sparrow sparrow-sized or smaller",
        "color: The cap and bib are black, the cheeks white, the back soft gray, the wing feathers gray edged with white, and the underparts soft buffy on the sides grading to white beneath. The cap extends down just beyond the black eyes, making the small eyes tricky to see"
    ],
    "Poecile carolinensis": [
        "shape: This tiny, approachable bird has a short neck and large head, giving it a distinctive spherical body shape. Its tail is fairly long and narrow. Its bill is a bit thicker than a warblers but thinner than a finchs",
        "size: Smaller than a White-breasted Nuthatch sparrow-sized or smaller",
        "color: Poecile carolinensiss have a black cap and bib separated by stark white cheeks. The back, wings, and tail are soft gray"
    ],
    "Poecile gambeli": [
        "shape: Tiny, large-headed but small-billed, with a long, narrow tail and full, rounded wings",
        "size: Same size as Black-capped Chickadee sparrow-sized or smaller",
        "color: Like all chickadees, strikingly black-and-white on the head, gray elsewhere. The white stripe over the eye identifies Poecile gambelis from all other chickadees"
    ],
    "Poecile hudsonicus": [
        "shape: A small songbird with husky body and head, and a slim, rather long tail",
        "size: About the size of a Black-capped Chickadee sparrow-sized or smaller",
        "color: A grayish brown bird with a rich brown cap, a small black bib, and small white cheek (gray at the rear). Whitish below, with pinkish buff sides"
    ],
    "Poecile rufescens": [
        "shape: Tiny, large-headed but small-billed, with a rather long, narrow tail and short, rounded wings",
        "size: The smallest, shortest-tailed chickadee sparrow-sized or smaller",
        "color: The Poecile rufescens is boldly black and white on the head like other chickadees, but the back is a rich chestnut instead of the more typical slaty gray. The flanks can be either rich brown (north of San Francisco) or dull gray (central and southern California)"
    ],
    "Cardellina canadensis": [
        "shape: Cardellina canadensiss are small, well-proportioned birds with a straight, sharp bill. Compared to other warblers, they have a slightly longer tail with a fuller chest",
        "size: Larger than a Wilson's Warbler, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Cardellina canadensiss are steely blue-gray above and bright yellow below with an obvious whitish eyering. The most noticeable feature is the broken black necklace across the chest on adult males. Females also have a necklace, but it's not as bold"
    ],
    "Cardellina pusilla": [
        "shape: Cardellina pusillas are one of our smallest warblers. They have long, thin tails and small, thin bills. They appear rather round bodied and large headed for their size",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Common Yellowthroat sparrow-sized or smaller",
        "color: Cardellina pusillas are bright yellow below and yellowish olive above. Their black eyes stand out on their yellow cheeks. Males have a distinctive black cap. Adult females are similar in color but show variations in the amount of black on the top of the head, from a few blackish feathers to a small dark cap. Juvenile females have an olive crown and a yellow eyebrow"
    ],
    "Geothlypis formosa": [
        "shape: A sturdy songbird with a heavier bill, longer legs, and shorter tail than many other warbler species",
        "size: Larger than a Northern Parula, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: Males are olive above and yellow below, with a blackish crown and face broken by a yellow eyebrow that wraps around behind the eye. Females and immatures are similar, but the head pattern is less striking"
    ],
    "Geothlypis philadelphia": [
        "shape: A small but sturdy songbird with a fairly full body and thick neck. The bill is thin and straight, smaller than the bill of the similar-looking Connecticut Warbler. It has a moderately long tail and strong legs",
        "size: Larger than a Carolina Chickadee, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: Adult males are olive above, yellow below, with a gray hood and black chest patch. Adult females are more muted in colors and lack the chest patch. Immatures are brownish above, yellow below, including center of throat. Both sexes usually lack an eyering, although some adult males show thin white eye arcs (recalling the bolder marks of MacGillivrays Warbler)"
    ],
    "Geothlypis tolmiei": [
        "shape: A compact, small songbird with a full body for a warbler and a thick neck. The bill is straight and thin overall, although heavier than many other warblers’ bills. The tail is medium length and the legs are fairly long",
        "size: Slightly larger than a Common Yellowthroat, slightly smaller than a Pine Warbler sparrow-sized or smaller",
        "color: Adult males are rich golden-olive above, bright yellow below, with a dark gray hood extending down to the chest. The face has white crescents (arcs) above and below the eye and blackish lores (the area between eye and bill). Adult females are similar but duller in color. Immatures are mostly olive brown above, with whitish eye arcs and a grayish or brownish version of the hood, broken up by a pale throat"
    ],
    "Geothlypis trichas": [
        "shape: Geothlypis trichass are small songbirds with chunky, rounded heads and medium-length, slightly rounded tails",
        "size: Smaller than a Yellow-breasted Chat; larger than a Ruby-crowned Kinglet sparrow-sized or smaller",
        "color: Adult males are bright yellow below, with a sharp black face mask and olive upperparts. A thin whitish line sets off the black mask from the head and neck. Immature males show traces of the full mask of adult males. Females are a plain olive brown, usually with yellow brightening the throat and under the tail. They lack the black mask"
    ],
    "Helmitheros vermivorum": [
        "shape: A small songbird, shaped like many other warblers but with a rather long, spikelike bill and moderately long wings and tail",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: Brownish olive above with rich buff head and underparts, a black eyeline and crown stripes, and pinkish legs"
    ],
    "Leiothlypis celata": [
        "shape: Leiothlypis celatas are small songbirds. Compared with other warblers, they have noticeably thin, sharply pointed bills. They have short wings and short, square tails",
        "size: Slightly larger than a Ruby-crowned Kinglet; slightly smaller than a Yellow-rumped Warbler sparrow-sized or smaller",
        "color: Leiothlypis celatas are fairly plain yellowish or olive—they are more yellow on the Pacific coast and grayer, particularly on the head, farther east. They have a thin white or yellow stripe over the eye, a blackish line through the eye, and a pale partial eyering. The namesake orange crown patch is rarely seen, but may become visible when the bird raises its head feathers in excitement or agitation. The undertail coverts are bright yellow and are often the brightest part of the plumage"
    ],
    "Leiothlypis peregrina": [
        "shape: Small and stocky for a warbler, with a short tail and a thin and sharply pointed bill (markedly smaller and more pointed than a Red-eyed Vireo's bill)",
        "size: Larger than a Golden-crowned Kinglet, slightly smaller than a Yellow-rumped Warbler sparrow-sized or smaller",
        "color: Breeding males have a gray head with a white line over the eye, contrasting with a green back and no wingbars. The underparts are whitish all the way through the undertail coverts. Females and nonbreeding males are more greenish, with less contrast between head and back. Occasionally very olive-yellow all over except for white undertail coverts"
    ],
    "Leiothlypis ruficapilla": [
        "shape: A small songbird, compact with a round head, plump body and shortish tail. The bill is fine, straight, and pointed",
        "size: Smaller than a White-breasted Nuthatch, larger than a Blue-gray Gnatcatcher sparrow-sized or smaller",
        "color: A mostly yellow warbler with a green back, gray head, and white eyering. The lower belly is white, sandwiched in between yellow breast and yellow undertail coverts; this is a distinctive pattern helpful for identifying the species from below. Females and young birds are similar but the colors are more washed out and pale"
    ],
    "Mniotilta varia": [
        "shape: Mniotilta varias are medium-sized warblers (small songbirds). They have a fairly long, slightly downcurved bill. The head often appears somewhat flat and streamlined, with a short neck. The wings are long and the tail is short",
        "size: About the size of a Black-capped Chickadee; slightly smaller than a White-breasted Nuthatch sparrow-sized or smaller",
        "color: These birds are boldly striped in black and white. Their black wings are highlighted by two wide, white wing bars. Adult males have more obvious black streaking, particularly on the underparts and the cheek. Females (especially immatures) are paler, with less streaking and usually a wash of buff on the flanks. The undertail coverts have distinctive large black spots"
    ],
    "Parkesia motacilla": [
        "shape: A large, somewhat plump warbler, with a stout bill (bigger than Northern Waterthrushs), rather short tail, and long legs",
        "size: Larger than a Yellow Warbler, smaller than an Eastern Bluebird. Slightly larger than Northern Waterthrush sparrow-sized or smaller",
        "color: Brownish above, with a very prominent white eyebrow (supercilium); pale below, with dark streaks. The supercilium is thicker in Louisiana than in ​Northern, and tends to flare at the rear. The legs are bright pink"
    ],
    "Parkesia noveboracensis": [
        "shape: A large but trim warbler with a short, fine bill, a rather short tail, and long legs. The bill is smaller than Louisiana Waterthrushs",
        "size: Larger than a Yellow Warbler, smaller than an Eastern Bluebird sparrow-sized or smaller",
        "color: Brownish above, with a prominent pale eyebrow (supercilium); pale yellowish or buff below, with dark streaks. The legs are duskier and less pink than Louisiana Waterthrush. The supercilium stripe is thinner in Parkesia noveboracensis than in Louisiana, especially at rear, and is faintly yellowish"
    ],
    "Protonotaria citrea": [
        "shape: The Protonotaria citrea is a large, heavy-bodied warbler with a big head and bill. It has shorter legs and a shorter tail than other warblers. Its bill is heavier and longer than most warblers",
        "size: Larger than a Carolina Chickadee, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: The Protonotaria citrea is bright golden yellow with blue-gray wings and tail and a yellow-olive back. Its beady black eye stands out on its solid yellow face. Seen from below, it has white under the tail. Females are often paler yellow than males"
    ],
    "Seiurus aurocapilla": [
        "shape: The Seiurus aurocapilla is a chunky, larger-than-average warbler, but still smaller than a Song Sparrow. It has a round head, fairly thick bill for a warbler, and a jaunty tail often cocked upward",
        "size: Slightly larger than a Yellow Warbler; smaller than an Eastern Bluebird sparrow-sized or smaller",
        "color: Seiurus aurocapillas are olive-green above and spotted below, with bold black-and-orange crown stripes. A white eyering gives it a somewhat surprised expression. Like several other terrestrial, or near-terrestrial, warblers, Seiurus aurocapillas have pink legs"
    ],
    "Setophaga americana": [
        "shape: Setophaga americanas are small wood-warblers with a short tail and a thin, pointy bill. They are plump little warblers about the size of a kinglet",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Adult male Setophaga americanas are bluish gray overall with a yellow-green patch on the back and 2 white wingbars. A chestnut band separates the male's bright yellow throat and chest. Adult females are a bit paler and typically lack the male's breast band. Males and females have distinctive white eye crescents. Immature birds are paler than adults and lack the chestnut breast band"
    ],
    "Setophaga caerulescens": [
        "shape: Setophaga caerulescenss are small, well-proportioned birds with sharp, pointed bills. Compared with other warblers, they are fairly large and plump",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than a Hermit Thrush sparrow-sized or smaller",
        "color: Males are midnight blue above and white below with black on the throat, face, and sides. Females are plain grayish olive overall, although some individuals have blue tints on the wings and tail. Both sexes have a characteristic small white square on the wing, sometimes called a “pocket handkerchief.”"
    ],
    "Setophaga castanea": [
        "shape: A small songbird with a fine, pointed bill and rather long wings and tail",
        "size: Larger than a chickadee, smaller than a sparrow; similar in size to Yellow-rumped Warbler sparrow-sized or smaller",
        "color: Breeding males are grayish above with a reddish-brown crown, breast and flanks, black face, and creamy buff underparts and rear cheek. Breeding females are similar but lack black mask and have less bay color. In the nonbreeding plumage, yellow-green upperparts and whitish underparts, usually with a hint of pinkish brown on the flanks. All plumages have two strong white wingbars"
    ],
    "Setophaga cerulea": [
        "shape: A small, compact warbler that often perches horizontally. It has a small, round bill and a shorter tail than some other warblers such as Magnolia Warbler",
        "size: Slightly larger than a Blue-gray Gnatcatcher, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: Males are sky-blue above with 2 white wing bars, dark streaking on the back, a thin blue neck band, and blue streaking on the sides of their white belly. Females are bluish green above with a slight yellow wash below. They lack the streaked sides and neck band seen on males. Females also have a whitish eyebrow and 2 white wingbars"
    ],
    "Setophaga citrina": [
        "shape: Setophaga citrinas are small, well-proportioned birds with a straight, sharp bill. Compared to other warblers, they are fairly heavy-bodied and thick-necked",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Adult males are olive-green above and bright yellow below with a black hood and throat, a yellow forehead, and yellow cheeks. Females and immatures are also olive-green above and yellow below, but they don't have a black hood, although some adult females show an outline of a hood. Note the large black eye and white outer tail feathers that it often flashes"
    ],
    "Setophaga coronata": [
        "shape: Setophaga coronatas are fairly large, full-bodied warblers with a large head, sturdy bill, and long, narrow tail",
        "size: Large warbler; about the size of a Black-capped Chickadee sparrow-sized or smaller",
        "color: In summer, both sexes are a smart gray with flashes of white in the wings and yellow on the face, sides, and rump. Males are very strikingly shaded; females are duller and may show some brown. Winter birds are paler brown, with bright yellow rump and usually some yellow on the sides"
    ],
    "Setophaga discolor": [
        "shape: Small songbird with thin, straight bill. Slender, with a long tail and long legs relative to other warblers",
        "size: Larger than a Blue-gray Gnatcatcher, slightly smaller than a Yellow-rumped Warbler sparrow-sized or smaller",
        "color: Adult males are bright yellow below with heavy black streaks on the flanks. A black eyeline and a black semicircle under the eye mark the yellow face. Males often have a chestnut patch on the back and a dark spot on the side of the neck. Females and immatures are similar but paler, with a grayish head and broken white eyering"
    ],
    "Setophaga dominica": [
        "shape: Setophaga dominicas are small, well-proportioned birds with sharp and pointed bills. Compared to other warblers, they are a bit more heavy-bodied with a longer and thicker bill. From below, note the blunt, only slightly notched tail",
        "size: Slightly larger than a Brown Creeper, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: Setophaga dominicas are gray and white with a splash of yellow on the throat and black streaks down the sides. The yellow throat is offset by a black triangle below the eye and a white eyebrow. From above they have a gray back and 2 white wingbars. From below look for the white belly and white tail. Females and first-year males look similar, but are slightly paler"
    ],
    "Setophaga fusca": [
        "shape: A typical medium-sized warbler with a short, thin, pointed bill, trim body, and medium-length tail. The overall shape is similar to the widespread Yellow Warbler",
        "size: Larger than a Northern Parula, slightly smaller than a Yellow-rumped Warbler sparrow-sized or smaller",
        "color: The breeding male, with vivid orange in face and throat, is unmistakable; females and immatures show at least a hint of this coloration, but more important is the unique triangular facial pattern of black (or gray), also seen in all plumages"
    ],
    "Setophaga magnolia": [
        "shape: A small songbird with a small bill and a long, narrow tail",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Adult males have a black mask and distinctive black streaking that radiates from a black neck band creating a necklaced look. Males are gray and black above with a wide white wing patch, and a yellow throat and belly. Females and immatures have a gray head, a white eyering, a faint gray band across the neck, and 2 narrow white wingbars. From below on both sexes note the unique tail pattern; white at the base and black at the tip"
    ],
    "Setophaga nigrescens": [
        "shape: A compact warbler with a small round bill and a big head",
        "size: Larger than a Bushtit, smaller than a Juniper Titmouse sparrow-sized or smaller",
        "color: A mostly black, gray, and white bird with a yellow spot above and in front of the eye. They also have a sharp black-and-white striped face and crisp black streaks on their sides. Females are a tad paler and often have a patchy black throat. From below, note the all-white belly and undertail"
    ],
    "Setophaga occidentalis": [
        "shape: A small songbird with classic warbler proportions, including a moderately long tail and a rather short, slender, straight bill",
        "size: Larger than a Bushtit, smaller than a White-crowned Sparrow sparrow-sized or smaller",
        "color: Breeding males have a golden-yellow head and a black throat, with a dark gray back and two white wingbars. The upper breast is white with blackish streaking. Adult females and nonbreeding males have similar patterning but with subdued colors"
    ],
    "Setophaga palmarum": [
        "shape: Setophaga palmarums are small songbirds, but they are on the larger side for a warbler and have a fuller looking belly. Their posture is more upright than a typical warbler and more like a pipit—especially noticeable when they are on the ground. Their tails and legs are longer than most warblers contributing to the pipitlike shape",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Dark-eyed Junco sparrow-sized or smaller",
        "color: Setophaga palmarums are dull brownish-olive above with yellow under the tail and throat. The outside corners of their tails flash white in flight. In eastern birds the belly is yellow, while in western birds the belly is white. Sexes are similar, and during the breeding season they have a rusty cap and some rusty streaking on the belly. Nonbreeding birds have paler yellow undertails and a dull brown crown"
    ],
    "Setophaga pensylvanica": [
        "shape: An slim warbler with a relatively long tail that it often holds cocked, or raised above the body line, which makes the tail appear longer still",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: Breeding adults are crisp gray-and-white birds with a yellow crown, black face markings, and rich chestnut flanks. Males are more richly marked than females. In nonbreeding plumage, adults and immatures are bright lime-green above with a neat white eyering, two wingbars, and pale gray to white underparts"
    ],
    "Setophaga petechia": [
        "shape: Setophaga petechias are small, evenly proportioned songbirds with medium-length tails and rounded heads. For a warbler, the straight, thin bill is relatively large",
        "size: About the same size as a Yellow-rumped Warbler; slightly larger than an American Goldfinch sparrow-sized or smaller",
        "color: Setophaga petechias are uniformly yellow birds. Males are a bright, egg-yolk yellow with reddish streaks on the underparts. Both sexes flash yellow patches in the tail. The face is unmarked, accentuating the large black eye"
    ],
    "Setophaga pinus": [
        "shape: Setophaga pinuss are hefty, long-tailed warblers with stout bills. The tip of the tail usually appears to have a central notch",
        "size: Smaller than a White-throated Sparrow; larger than a Northern Parula sparrow-sized or smaller",
        "color: Setophaga pinuss are yellowish birds with olive backs, whitish bellies, and two prominent white wingbars on gray wings. Adult males are the brightest; females and immatures are more subdued and can even appear gray-brown. Overall, Setophaga pinuss don’t show the strong patterns of other warblers, but the face can look weakly “spectacled,” with a pale eyering connected to a pale stripe in front of the eye"
    ],
    "Setophaga ruticilla": [
        "shape: A medium-sized warbler with a relatively wide, flat bill and fairly long, expressive tail. In flight it has a deep chest, slim belly, and long, somewhat club-shaped tail",
        "size: About the size of a Black-capped Chickadee or Yellow Warbler sparrow-sized or smaller",
        "color: Adult male Setophaga ruticillas are mostly black with bright orange patches on the sides, wings, and tail. The belly is white. Females and immature males replace the orange with yellow or yellow-orange. They have gray head and underparts, with olive back and wings and dark-gray tail"
    ],
    "Setophaga striata": [
        "shape: Setophaga striatas are small songbirds with a short tail and a small thin bill. Compared to other warblers they have longer wings",
        "size: Larger than a Tennessee Warbler, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Breeding male Setophaga striatas are black-and-white with a distinctive black cap and white cheeks bordered by a black mustache stripe. Breeding females are streaky black, white, and gray, without the males black cap or white cheek. Both sexes have two white wingbars and orange-yellow legs. In late summer they molt into a very different plumage: greenish-yellow above with dark streaking down the back and faint streaking on white underparts. The face is pale yellow with a dark eyeline"
    ],
    "Setophaga tigrina": [
        "shape: A delicate, short-tailed warbler with a slender and distinctively decurved bill, unusual among warblers",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: Adult males are rich yellowish olive above, with rufous cheeks (auriculars) framed in yellow and dense rufous “tiger stripes” on the breast (present in all plumages, giving the species its scientific name, tigrina). The underparts are yellow, and the wing has a large white patch. Females and immatures are duller, lacking vivid yellow but with a yellowish green rump"
    ],
    "Setophaga townsendi": [
        "shape: A small songbird, slender-bodied like many other warblers, with a short, fine bill and moderately long tail",
        "size: Larger than a Golden-crowned Kinglet, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: Adult males have a black head and throat with a gleaming golden face and black cheek patch. They have gray wings with white wingbars, an olive-green back, and a yellow breast with bold black flank streaks. Females and immatures are similar but less strongly marked"
    ],
    "Setophaga virens": [
        "shape: The Setophaga virens is a medium-sized warbler similar in size and shape to many others in the Setophaga genus. Plump and seemingly large-headed, with a thick, straight bill and shortish tail",
        "size: Larger than a kinglet, smaller than a titmouse sparrow-sized or smaller",
        "color: These are olive-green birds, white below, with yellow faces and black on the front. Adult males are stunning, with a bright yellow face and extensive black on the throat turning to black streaks on the flanks. Two bright white wingbars. Females and young birds are patterned like males, but duller and lacking the extensive black on the throat"
    ],
    "Vermivora chrysoptera": [
        "shape: Vermivora chrysopteras are small songbirds with fairly slim bodies and short tails. They have a thin, straight bill that is sharply pointed",
        "size: Slightly smaller than a Black-capped Chickadee sparrow-sized or smaller",
        "color: Adult males are silvery gray with a strong black-and-white face pattern, yellow crown, and large yellow patches on the wings. Females are similar but lack the males black mask and bib. Hybrids with the Blue-winged Warbler can produce a mostly light gray form (“Brewsters”) or a mostly golden form (“Lawrences”)"
    ],
    "Vermivora cyanoptera": [
        "shape: Vermivora cyanopteras are small, well-proportioned birds with a sharp and pointed bill. Compared to other warblers, the rather heavy black bill and eyeline give them a pointy-headed look",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than a Field Sparrow sparrow-sized or smaller",
        "color: Adult males are bright yellow below, yellow-green above, and have two obvious wingbars on blue-gray wings, and a black eyeline. Adult females are paler with a less defined eyeline. The black bill and eyeline contribute to an almost angry-looking expression. From below look for the white undertail coverts on both sexes"
    ],
    "Aimophila ruficeps": [
        "shape: Aimophila ruficepss are relatively large sparrows with rounded heads and fairly long tails. The thick, pointed bill is fairly large",
        "size: Larger and bulkier than a Chipping Sparrow; smaller than a White-crowned Sparrow sparrow-sized or smaller",
        "color: These are grayish sparrows with streaky backs and and bright reddish-brown crowns. They have a white eyering and a white malar or whisker stripe thats bordered in black and contrasts with the gray face and underparts"
    ],
    "Ammodramus savannarum": [
        "shape: Ammodramus savannarum is on the small side for a sparrow, with a distinctive compact shape. The head is large and flat-crowned, with a conspicuous bill. Tail is very short",
        "size: Among the smallest birds in its habitat; slightly smaller than a Savannah Sparrow sparrow-sized or smaller",
        "color: Ammodramus savannarum is a brown and tan bird with light streaking. The belly is white but the entire breast is unstreaked and buffy. The back is mottled tan, black, and chestnut, and isn’t as streaky as other sparrows. The face is relatively plain with a conspicuous white eyering. They often show a yellow spot between the eye and bill (the lore), and on the bend of the wing"
    ],
    "Ammospiza leconteii": [
        "shape: A small and chunky sparrow with a large, flat head. It has a short tail and very short, rounded wings",
        "size: Smaller than a Song Sparrow. About the size of a Marsh Wren sparrow-sized or smaller",
        "color: Distinctively orange-buff all over, particularly on the head and upper breast. It has black streaks on the back and wings and a grayish-purple spot on the back of the neck. The belly is white. The bill is gray"
    ],
    "Ammospiza nelsoni": [
        "shape: A medium-sized sparrow with a short conical bill, plump body, and a rather short tail in which the individual feathers often appear spiky at the tips",
        "size: Larger than a Common Yellowthroat, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: A richly colored sparrow with a saffron-yellow eyebrow and whisker marks framing a grayish cheek. The interior-breeding form of Ammospiza nelsoni, this yellow color continues strongly onto the throat, breast, and sides, with streaking on the breast and flanks. The coastal-breeding “Atlantic” form is more muted, with pale gray in the upper back, pale buff below, and very limited, faint streaking on the breast"
    ],
    "Amphispiza bilineata": [
        "shape: A medium-sized sparrow with a large, round head, conical seed-eating bill, and a medium length tail",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than a Horned Lark sparrow-sized or smaller",
        "color: Most striking feature is the face pattern: neat gray bordered by 2 strong white stripes and a black triangular throat patch. Upperparts are grayish brown and the underparts are a paler mix of cream and white. The tail is dark with white spots on the corners. Juveniles look like adults but lack the black throat patch and have faint streaks above and below"
    ],
    "Calamospiza melanocorys": [
        "shape: A heavyset sparrow with a very large, conical bill, and a compact, robust body. The bill and overall shape are reminiscent of a grosbeak or bunting",
        "size: Larger than a Song Sparrow, slightly smaller than a Fox Sparrow sparrow-sized or smaller",
        "color: Breeding males are an unmistakable black with white wing patches. Nonbreeding males, as well as females and immatures, are brownish above, pale with brown streaking below, with extensive white in the upperwing coverts and small white tips to the inner tail feathers. The bill is a distinctive pale blue-gray"
    ],
    "Centronyx henslowii": [
        "shape: A small, squat sparrow with a large, flat head, a large bill, and a short, spiky tail",
        "size: Larger than a Prairie Warbler, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: Centronyx henslowiis are tan and buff marked with sharp black streaks. They have a distinctly greenish-olive wash on the cheek, with a yellow spot between eye and bill. The breast has neat black streaks and the belly is whitish"
    ],
    "Chondestes grammacus": [
        "shape: A large, long-tailed sparrow. When perched, it often looks long-bodied with a thin neck and a round head. The tail is long and rounded",
        "size: Larger than an American Goldfinch, smaller than a Western Meadowlark sparrow-sized or smaller",
        "color: Adults have a bold, blocky facial pattern that sets them apart from other sparrows. Chestnut and white stripes streak across the head, a black mustache runs down the sides of the throat, and the cheeks have chestnut spots. The outer tail feathers are tipped in white and a black spot marks the center of the chest. Juveniles have a ghosting of the adult's facial pattern and heavy streaking on the breast and flanks"
    ],
    "Junco hyemalis": [
        "shape: The Junco hyemalis is a medium-sized sparrow with a rounded head, a short, stout bill and a fairly long, conspicuous tail",
        "size: Slightly larger than a Chipping Sparrow sparrow-sized or smaller",
        "color: Juncos vary across the country (see Regional Differences), but in general they’re dark gray or brown birds brightened up by a pink bill and white outer tail feathers that periodically flash open, particularly in flight"
    ],
    "Melospiza georgiana": [
        "shape: A medium-sized sparrow with a short, conical bill, a compact, robust body, and a moderately long tail. The overall shape is quite similar to the widespread Song Sparrow",
        "size: Slightly larger than a Chipping Sparrow, slightly smaller than a White-throated Sparrow sparrow-sized or smaller",
        "color: Melospiza georgianas look quite dark overall, especially in dim or shadowy habitats, where they often remain concealed. Closer views reveal a bright rusty crown and wings (especially the coverts), grayish breast with whitish throat, and gray nape"
    ],
    "Melospiza lincolnii": [
        "shape: The Lincoln's Sparrow is a medium-sized sparrow with a dainty appearance. It has a rounded belly and head, but the back of its head often looks pointed or crested when it raises its crown feathers. Its tail is relatively short and its conical bill is a bit thinner compared to most other sparrows",
        "size: Larger than a Wilson's Warbler, smaller than a Song Sparrow sparrow-sized or smaller",
        "color: The Lincoln's Sparrow is streaky brown, buffy, and gray overall with rusty edges to its wings and tail. Its chest and sides are rich buff with fine black streaking that fades into a white belly. Its face is marked by a buffy mustache stripe that is bordered by thin brown lines. A buffy eyering, a thick gray eyebrow, and a dark eyeline mark the area around the eye. Its crown is striped brown and black with a gray central crown stripe"
    ],
    "Melospiza melodia": [
        "shape: Melospiza melodias are medium-sized and fairly bulky sparrows. For a sparrow, the bill is short and stout and the head fairly rounded. The tail is long and rounded, and the wings are broad",
        "size: Slightly smaller than a Dark-eyed Junco; slightly larger than a Chipping Sparrow sparrow-sized or smaller",
        "color: Melospiza melodias are streaky and brown with thick streaks on a white chest and flanks. On a closer look, the head is an attractive mix of warm red-brown and slaty gray, though these shades, as well as the amount of streaking, vary extensively across North America"
    ],
    "Melozone aberti": [
        "shape: A large sparrow with a short, conical bill, an elongated body for a sparrow, and a rather long tail. The overall shape is similar to Northern Cardinal (but with a smaller bill and without the crest)",
        "size: Slightly larger than a Northern Cardinal, smaller than a Woodhouses Scrub-Jay robin-sized",
        "color: Melozone aberti is grayish-brown above, pinkish brown below, with rusty undertail coverts and black plumage bordering a pale grayish bill"
    ],
    "Melozone crissalis": [
        "shape: Melozone crissaliss are essentially large sparrows, with a sparrows short, rounded wings, long tail, and thick, seed-cracking beak—but towhees are larger and bulkier. The long tail and short wings can give this bird an ungainly look in flight",
        "size: Slightly larger than a Spotted Towhee; slightly smaller than a robin between sparrow and robin",
        "color: Few birds are as uniformly matte brown as a Melozone crissalis, except for a rusty patch under the tail (called the crissum, giving the bird its scientific name) and around their bill. Males look the same as females"
    ],
    "Melozone fusca": [
        "shape: Melozone fuscas are large sparrows with fairly long tails, chunky bodies and short rounded wings. The bill is short and thick at the base, and the legs are long",
        "size: between sparrow and robin",
        "color: Overall, the Melozone fusca is about as plain brown as birds come. They have warm rusty undertail coverts, a buffy throat and a hint of a reddish crown"
    ],
    "Passerculus sandwichensis": [
        "shape: Passerculus sandwichensiss are medium-sized sparrows with short, notched tails. The head appears small for the plump body, and the crown feathers often flare up to give the birds head a small peak. The thick-based, seed-eating bill is small for a sparrow",
        "size: About the size of a Song Sparrow sparrow-sized or smaller",
        "color: Passerculus sandwichensiss are brown above and white below, with crisp streaks throughout. Their upperparts are brown with black streaks, and the underparts are white with thin brown or black streaks on the breast and flanks. Look for a small yellow patch on the face in front of the eye"
    ],
    "Passerella iliaca": [
        "shape: Passerella iliacas are large, round-bodied sparrows with stout bills and medium-length tails",
        "size: Smaller than a Spotted Towhee; larger than a Dark-eyed Junco sparrow-sized or smaller",
        "color: Though highly variable (see “Regional Differences”), Passerella iliacas are generally rust-brown above with a mix of rust and gray on the head, and heavy brownish splotches on the flanks and the center of the chest. The bill can range from yellowish to dark gray"
    ],
    "Pipilo chlorurus": [
        "shape: Pipilo chloruruss are small but chunky songbirds with a big head, stocky body and longish tail. The bill is thick and sparrowlike. They are larger than most sparrows and have shorter tails than most other towhees",
        "size: Larger than a Song Sparrow, smaller than an American Robin between sparrow and robin",
        "color: Pipilo chloruruss are grayish birds with olive-yellow wings, back and tail. The head is strongly marked with a bright rufous crown, white throat, and a dark “mustache” stripe"
    ],
    "Pipilo erythrophthalmus": [
        "shape: Towhees are a kind of large sparrow. Look for their thick, triangular, seed-cracking bill as a tip-off they’re in the sparrow family. Also notice the chunky body and long, rounded tail",
        "size: 30% bigger than a Song Sparrow and twice as heavy. Smaller than a robin robin-sized",
        "color: Males are striking: bold sooty black above and on the breast, with warm rufous sides and white on the belly. Females have the same pattern, but are rich brown where the males are black"
    ],
    "Pipilo maculatus": [
        "shape: A large sparrow with a thick, pointed bill, short neck, chunky body, and long, rounded tail",
        "size: About a third again bigger than a Song Sparrow and twice as heavy. Smaller than a robin robin-sized",
        "color: Male Pipilo maculatuss have jet-black upperparts and throat; their wings and back are spotted bright white. The flanks are warm rufous and the belly is white. Females have the same pattern but are grayish brown where males are black. In flight, look for white corners to the black tail"
    ],
    "Pooecetes gramineus": [
        "shape: Pooecetes gramineuss are fairly large sparrows with a chunky body, a fairly small conical bill, and a long, notched tail",
        "size: Larger than a Savannah Sparrow, smaller than a Western Meadowlark sparrow-sized or smaller",
        "color: Brown overall with crisp streaks. The most notable features include a thin white eyering, white outer tail feathers (seen in flight), and a pale cheek patch. Pooecetes gramineuss also have a distinctive, but difficult to see, chestnut patch on the shoulder"
    ],
    "Spizella breweri": [
        "shape: The Spizella breweri is typical of the Spizella group of sparrows: dainty and slim, with a long, notched tail, short rounded wings, and a small, sharply conical bill. Its size varies somewhat by region and sex, but overall it is North Americas smallest sparrow",
        "size: About the size of a Black-capped Chickadee; noticeably smaller and slimmer than a Song Sparrow sparrow-sized or smaller",
        "color: Spizella breweris are dusky gray-brown, with grayish underparts and a thin white eyering. The back and nape are streaked. A faint gray stripe over the eye contrasts with a darker eyeline. The throat is grayish white"
    ],
    "Spizella pallida": [
        "shape: Spizella pallidas are petite, trim sparrows with a small bill, slender body, and fairly long, notched tail. The small, slender shape of these and other Spizella sparrows is distinctive",
        "size: About the size of a Chipping Sparrow; slightly smaller than a Song Sparrow sparrow-sized or smaller",
        "color: These are mostly pale, tan-and-gray birds with a contrasting face pattern. Their pale gray collar is a helpful mark at all times of the year. The crown is finely streaked, with a pale stripe over the eye and darker cheek. The dark eyeline does not extend in front of the eye"
    ],
    "Spizella passerina": [
        "shape: The Spizella passerina is a slender, fairly long-tailed sparrow with a medium-sized bill that is a bit small for a sparrow. Learning the shape of this classic Spizella sparrow is a key step in mastering sparrow identification",
        "size: Smaller, trimmer, and shorter tailed than a Song Sparrow; slightly larger than a chickadee sparrow-sized or smaller",
        "color: Summer Spizella passerinas look clean and crisp, with frosty underparts, pale face, black line through the eye, topped off with a bright rusty crown. In winter, Spizella passerinas are subdued, buff brown, with darkly streaked upperparts. The black line through the eye is still visible, and the cap is a warm but more subdued reddish brown"
    ],
    "Spizella pusilla": [
        "shape: Spizella pusillas are small, slender sparrows with relatively short, conical bills, rounded heads, and somewhat long tails",
        "size: Smaller and more slender than a Song Sparrow; larger than a Black-capped or Carolina Chickadee sparrow-sized or smaller",
        "color: These are warm-colored birds with a distinct white eyering, a pink bill, and pale grayish underparts with soft orangey highlights. The head is pale gray with a bright rufous crown and a wide rufous line behind the eye. The whitish throat is bordered by soft orange-rufous lateral throat stripes. The back is brown with black streaks, all of which contrasts with the gray rump and tail. The wings have two weak wingbars"
    ],
    "Spizelloides arborea": [
        "shape: Spizelloides arboreas are small, round-headed birds that often fluff out their feathers, making their plump bodies look even chubbier. Among sparrows, they have fairly small bills and long, thin tails",
        "size: About the size of a House Sparrow sparrow-sized or smaller",
        "color: A rusty cap and rusty (not black) eyeline on a gray head, a streaked brown back, and a smooth gray to buff breast in both male and female Spizelloides arboreas give an overall impression of reddish-brown and gray. A dark smudge in the center of the unstreaked breast is common"
    ],
    "Zonotrichia albicollis": [
        "shape: The Zonotrichia albicollis is a large, full-bodied sparrow with a fairly prominent bill, rounded head, long legs, and long, narrow tail",
        "size: Slightly larger than a Song Sparrow sparrow-sized or smaller",
        "color: Zonotrichia albicolliss are brown above and gray below with a striking head pattern. The black-and-white-striped head is augmented by a bright white throat and yellow between the eye and the bill, which is gray. You’ll also see a less boldly marked form, known as “tan-striped,” with a buff-on-brown face pattern instead of white-on-black"
    ],
    "Zonotrichia atricapilla": [
        "shape: These are large, long-tailed sparrows with small heads and short but stout, seed-eating bills",
        "size: Smaller than an American Robin; larger than a Yellow-rumped Warbler sparrow-sized or smaller",
        "color: In summer, adult Zonotrichia atricapillas are streaked brown above and smooth gray to brown below, with a black crown and bright-yellow forehead. Winter and immature Zonotrichia atricapillas are duller, with brown replacing black on the head and less obvious yellow on the crown"
    ],
    "Zonotrichia leucophrys": [
        "shape: The Zonotrichia leucophrys is a large sparrow with a small bill and a long tail. The head can look distinctly peaked or smooth and flat, depending on the birds attitude",
        "size: Slightly larger than a Song Sparrow sparrow-sized or smaller",
        "color: First impressions of Zonotrichia leucophryss tend to be of a plain, pale-gray bird; next your eye is drawn to the very bold black-and-white stripes on the head and the pale pink or yellow bill. Learn this bird's size and shape so you're ready to identify young birds that have brown, not black, markings on the head"
    ],
    "Zonotrichia querula": [
        "shape: Harris's Sparrows are large and chunky sparrows. Their big barrel-shaped chest makes their round head look a little small for their body. They have a long tail and a medium-sized conical bill",
        "size: Larger than a Song Sparrow, smaller than an Eastern Towhee sparrow-sized or smaller",
        "color: Harris's Sparrows are streaky brown and black overall with a black bib, face, and crown. As they get older, the black areas around the face change from patchy black in juveniles to fully black in adults. Breeding adults have a gray cheek and nape while these areas are brown in nonbreeding birds. Juveniles and adults in all seasons have a pink bill, a white belly, and black streaks down the back"
    ],
    "Passer domesticus": [
        "shape: Passer domesticuss aren’t related to other North American sparrows, and they’re differently shaped. Passer domesticuss are chunkier, fuller in the chest, with a larger, rounded head, shorter tail, and stouter bill than most American sparrows",
        "size: About the size of a Song Sparrow or Dark-eyed Junco, but stockier sparrow-sized or smaller",
        "color: Male Passer domesticuss are brightly colored birds with gray heads, white cheeks, a black bib, and rufous neck – although in cities you may see some that are dull and grubby. Females are a plain buffy-brown overall with dingy gray-brown underparts. Their backs are noticeably striped with buff, black, and brown"
    ],
    "Polioptila caerulea": [
        "shape: Polioptila caeruleas are tiny, slim songbirds with long legs; a long tail; and a thin, straight bill",
        "size: Slightly larger than a Ruby-throated Hummingbird, Slightly smaller than a House Wren sparrow-sized or smaller",
        "color: Polioptila caeruleas are pale blue-gray birds with grayish-white underparts and a mostly black tail with white edges. The underside of the tail is mostly white. The face is highlighted by a thin but obvious white eyering. In summer, male Polioptila caeruleas sport a black ‘V’ on their foreheads extending above their eyes"
    ],
    "Polioptila melanura": [
        "shape: A tiny, slim songbird with a thin, straight bill, small body, and long tail",
        "size: Larger than a Costas Hummingbird; smaller than a Black-throated Sparrow sparrow-sized or smaller",
        "color: Polioptila melanuras are gray overall with a fine white eyering, and a black tail with white flashes on the underside. They are darker gray above, with paler gray underparts. Breeding males have a black cap"
    ],
    "Phainopepla nitens": [
        "shape: A slender, long-tailed songbird with a distinct crest",
        "size: Larger than a Juniper Titmouse, smaller than a Northern Cardinal between sparrow and robin",
        "color: Adult males are glossy black with red eyes and large white patches in the wings (visible in flight). Adult females are mousy grayish brown with red eyes; immatures are similar but with brownish eyes"
    ],
    "Regulus satrapa": [
        "shape: These are tiny songbirds with a rounded body, short wings, and skinny tail. They have relatively large heads, and their bills are short and thin, perfect for gleaning small insects",
        "size: Smaller than a chickadee; larger than a hummingbird sparrow-sized or smaller",
        "color: Regulus satrapas are pale olive above and gray below, with a black-and-white striped face and bright yellow-orange crown patch. They have a thin white wingbar and yellow edges to their black flight feathers"
    ],
    "Auriparus flaviceps": [
        "shape: A tiny, chickadee-like songbird with a slight body, moderately long tail, small head, and tiny pointed bill",
        "size: Larger than a Black-tailed Gnatcatcher, smaller than a Bridled Titmouse sparrow-sized or smaller",
        "color: Adults are grayish with a yellow head. They have a small chestnut patch at the bend of the wing (the lesser coverts). Juveniles are similar but lack the yellow and chestnut colors"
    ],
    "Sitta canadensis": [
        "shape: A small, compact bird with a sharp expression accentuated by its long, pointed bill. Sitta canadensises have very short tails and almost no neck; the body is plump or barrel-chested, and the short wings are very broad",
        "size: Noticeably smaller than a White-breasted Nuthatch sparrow-sized or smaller",
        "color: Sitta canadensises are blue-gray birds with strongly patterned heads: a black cap and stripe through the eye broken up by a white stripe over the eye. The underparts are rich rusty-cinnamon, paler in females"
    ],
    "Sitta carolinensis": [
        "shape: The largest nuthatch, this is still a small bird with a large head and almost no neck. The tail is very short, and the long, narrow bill is straight or slightly upturned",
        "size: Larger than a Red-breasted Nuthatch; smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: Sitta carolinensises are gray-blue on the back, with a frosty white face and underparts. The black or gray cap and neck frame the face and make it look like this bird is wearing a hood. The lower belly and under the tail are often chestnut"
    ],
    "Sitta pusilla": [
        "shape: The Sitta pusilla is a tiny, compact bird. It appears rather round thanks to its short tail, legs, and neck. It also has a chisel-like bill that looks a little too big for its body",
        "size: Larger than a Golden-crowned Kinglet, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: This bird is white below and gray above with a brown head. Finer inspection reveals a white spot on the back of the head and small white spots in the tail that are visible in flight. Males and females look similar"
    ],
    "Sitta pygmaea": [
        "shape: A tiny bird with a relatively large, rounded head, no discernible neck, and a straight, sharp bill. The legs are short, the wings are short and broad, and the tail is short and square",
        "size: Smaller than a White-breasted Nuthatch; slightly larger than a Golden-crowned Kinglet sparrow-sized or smaller",
        "color: Bluish-gray above with a sharply defined brown crown and pale nape spot. The throat is white and the underside creamy buff. Some subspecies show a blackish line through eye"
    ],
    "Sturnus vulgaris": [
        "shape: Starlings are chunky and blackbird-sized, but with short tails and long, slender beaks. In flight their wings are short and pointed, making them look rather like small, four-pointed stars (and giving them their name)",
        "size: Nearly twice the size of a House Sparrow; smaller than an American Robin robin-sized",
        "color: At a distance, starlings look black. In summer they are purplish-green iridescent with yellow beaks; in fresh winter plumage they are brown, covered in brilliant white spots"
    ],
    "Chamaea fasciata": [
        "shape: Chamaea fasciatas are small birds with fairly large, round heads and short rounded wings giving them an overall plump appearance. They have long legs and long tails, which they often hold up and away from their body at different angles. Their bills are short and slightly curved",
        "size: Larger than a Bushtit, smaller than a Spotted Towhee; about the size of a Song Sparrow sparrow-sized or smaller",
        "color: Chamaea fasciatas are plain brownish-gray with paler, slightly streaked, pale pinkish bellies. They have a distinctive pale eye"
    ],
    "Campylorhynchus brunneicapillus": [
        "shape: The Campylorhynchus brunneicapillus is a large chunky wren with a long heavy bill, a long, rounded tail, and short, rounded wings. The Campylorhynchus brunneicapillus is the largest wren in the United States and is similar in size to a Spotted Towhee",
        "size: Larger than a Bewicks Wren, smaller than a Northern Mockingbird between sparrow and robin",
        "color: The Campylorhynchus brunneicapillus is a speckled brown bird with bright white eyebrows that extend from the bill, across and above their red eyes, to the sides of the neck. They have pale cinnamon sides and a white chest with dark speckles. The back is brown with heavy white streaks, and the tail is barred white and black—especially noticeable from below. Males and females look alike, but juveniles are slightly paler and have a brown eye"
    ],
    "Catherpes mexicanus": [
        "shape: A distinctive pot-bellied wren with a long, slender, slightly curved bill, a fairly long tail, and strong, short legs. The wings are short and rounded",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than a Cactus Wren sparrow-sized or smaller",
        "color: Catherpes mexicanuss are rusty brown birds with a neat white throat. The head is a grayer brown than the body and speckled with white, while the tail is a brighter rusty brown than the back. The wings and tail are barred with black"
    ],
    "Cistothorus palustris": [
        "shape: The Cistothorus palustris is a small, plump, round-bodied wren with a short tail that it often holds up almost vertically above its back. It has a thin bill and short wings",
        "size: About the size of a House Wren, but smaller than a Song Sparrow sparrow-sized or smaller",
        "color: The Cistothorus palustris is a small, plump, round-bodied wren with a short tail that it often holds up almost vertically above its back. It has a thin bill and short wings"
    ],
    "Salpinctes obsoletus": [
        "shape: A small songbird with relatively short wings, moderately long tail, and a fine, long, sharp bill",
        "size: Slightly larger than a House Wren, smaller than a Western Bluebird sparrow-sized or smaller",
        "color: Brown with flecks of gray above; pale below with buffy flanks. Fine streaks below are often hard to see. Brown wings have fine, dark barring and there are small speckles on the back and wings. The russet tail has dark bars and a buffy tip"
    ],
    "Thryomanes bewickii": [
        "shape: Thryomanes bewickiis are medium-sized wrens with a slender body and a strikingly long tail often held upright. They have slender, long bills that are slightly downcurved",
        "size: Smaller than a House Sparrow; slightly larger than a House Wren sparrow-sized or smaller",
        "color: Thryomanes bewickiis are subdued brown-and-gray wrens with a long, brow-like white stripe over the eye. The back and wings are plain brown; underparts gray-white; and the long tail is barred with black and tipped with white spots. Males and females look the same"
    ],
    "Thryothorus ludovicianus": [
        "shape: The Thryothorus ludovicianus is a small but chunky bird with a round body and a long tail that it often cocks upward. The head is large with very little neck, and the distinctive bill marks it as a wren: long, slender, and downcurved",
        "size: slightly smaller than sparrows; slightly larger than a House Wren sparrow-sized or smaller",
        "color: Both males and females are a bright, unpatterned reddish-brown above and warm buffy-orange below, with a long white eyebrow stripe, dark bill, and white chin and throat"
    ],
    "Troglodytes aedon": [
        "shape: Small and compact, with a flat head and fairly long, curved beak. Short-winged, often keeping its longish tail either cocked above the line of the body or slightly drooped",
        "size: Smaller than a Carolina Wren; chickadee-sized sparrow-sized or smaller",
        "color: Subdued brown overall with darker barring on the wings and tail. The pale eyebrow that is characteristic of so many wren species is much fainter in Troglodytes aedons"
    ],
    "Troglodytes hiemalis": [
        "shape: The Troglodytes hiemalis is a plump round ball with a stubby tail that it usually holds straight up. Its bill is small and thin, in keeping with its diminutive appearance",
        "size: Larger than a Ruby-throated Hummingbird, smaller than a Carolina Wren sparrow-sized or smaller",
        "color: In the dark forest understory, the Troglodytes hiemalis appears brown overall. With a closer look, you’ll see darker brown barring on the wings, tail, and belly. It has a pale tan eyebrow stripe above the eye and a plain brown cap. Its unmarked throat and barred belly are pale tan, paler than the back"
    ],
    "Troglodytes pacificus": [
        "shape: One of the smallest wrens in the United States, the Troglodytes pacificus has a short, stubby tail which it usually holds upright. Their small size and short tail give them a round appearance. They have short wings and a thin bill",
        "size: Larger than a Rufous Hummingbird, smaller than a Chestnut-backed Chickadee sparrow-sized or smaller",
        "color: This wren is brown overall with darker brownish-black barring on the wings, tail, and belly. The face is also brown with a slight pale mark over the eyebrow"
    ],
    "Catharus fuscescens": [
        "shape: Veeries are medium-sized thrushes—smaller than an American Robin but similar in shape. They have a plump body, round head, a straight, narrow bill, and fairly long wings and legs",
        "size: Smaller than an American Robin; larger than a Song Sparrow between sparrow and robin",
        "color: Most Veeries are uniformly bright cinnamon-brown above with indistinct spotting on the chest and pale underparts (see Regional Differences for exceptions). The throat is white with a buffy-orange cast"
    ],
    "Catharus guttatus": [
        "shape: Catharus guttatuses have a chunky shape similar to an American Robin, but smaller. They stand upright, often with the slender, straight bill slightly raised. Like other thrushes, the head is round and the tail fairly long",
        "size: Smaller than an American Robin, larger than a Song Sparrow between sparrow and robin",
        "color: The Catharus guttatus is rich brown on the head and back, with a distinctly warm, reddish tail. The underparts are pale with distinct spots on the throat and smudged spots on the breast. With a close look you may see a thin pale eyering (not a bold one)"
    ],
    "Catharus ustulatus": [
        "shape: Catharus ustulatuses are medium-sized thrushes—slim songbirds with round heads and short, straight bills. Their fairly long wings and medium-length tail can make the back half of the bird appear long",
        "size: Smaller than an American Robin; larger than a White-throated Sparrow between sparrow and robin",
        "color: These medium-brown birds with pale underparts have spotted chests and large buffy eyerings that extend in front of the eye, creating “spectacles.” The whitish throat is bordered on each side with a dark brown stripe. Catharus ustulatuses breeding on the Pacific slope of the U.S. and Canada have warmer brown upperparts (see Regional Differences)"
    ],
    "Hylocichla mustelina": [
        "shape: The Hylocichla mustelina's pot-bellied body, short tail, straight bill, big head, and upright posture give it the profile of a scaled-down American Robin",
        "size: Smaller than an American Robin, larger than a Hermit Thrush between sparrow and robin",
        "color: Hylocichla mustelinaes are warm reddish-brown above and white with bold black spots on their underparts. Juveniles show a somewhat muted version of the same pattern. All have a bold, white eyering"
    ],
    "Ixoreus naevius": [
        "shape: Ixoreus naeviuses are stocky songbirds with large, rounded heads, straight bills, and long legs. Usually seen standing horizontally on the ground or in a tree, they often look plump-bellied with a relatively short tail",
        "size: About the size of an American Robin; smaller than a Stellers Jay robin-sized",
        "color: Male Ixoreus naeviuses are dark blue-gray on the back and rich burnt-orange below with a sooty-black breastband and orange line over the eye. The wings are blackish with two orange bars and orange edging to the flight feathers. Females have the same patterns, but are paler gray-brown than males"
    ],
    "Myadestes townsendi": [
        "shape: This thrush is a medium-sized songbird with a long tail, a short bill, and a small rounded head relative to its body size. Their upright posture and long tail gives them a long and slender appearance",
        "size: Larger than a Mountain Bluebird, smaller than an American Robin robin-sized",
        "color: Myadestes townsendis are gray birds with prominent white eyerings. Their buffy wing patches and white outer tail feathers are often prominent in flight. Juveniles are dark gray overall and heavily spotted with buff and white, giving them a scaly look"
    ],
    "Sialia currucoides": [
        "shape: Sialia currucoidess are fairly small thrushes with round heads and straight, thin bills. Compared with other bluebirds they are lanky and long-winged, with a long tail",
        "size: Slightly larger than a Cassins Finch, considerably smaller than an American Robin between sparrow and robin",
        "color: Male Sialia currucoidess are sky-blue, a bit darker on wings and tail and a bit paler below, with white under the tail. Females are mostly gray-brown with tinges of pale blue in the wings and tail. They occasionally show a suffusion of orange-brown on the chest. Sialia currucoidess’ bills are entirely black. Juveniles have fewer spots than the young of other bluebirds and lack spotting on the back"
    ],
    "Sialia mexicana": [
        "shape: Sialia mexicanas are small thrushes that usually perch upright. They are stocky with thin, straight bills and fairly short tails",
        "size: Larger than a sparrow; smaller than an American Robin sparrow-sized or smaller",
        "color: Male Sialia mexicanas are shiny blue above with rust-orange extending from a vest on the breast onto the upper back. Females are gray-buff with a pale orange wash on the breast and blue tints to the wings and tail. The throat is blue in males and gray-buff in females, and the lower belly is whitish"
    ],
    "Sialia sialis": [
        "shape: The Sialia sialis is a small thrush with a big, rounded head, large eye, plump body, and alert posture. The wings are long, but the tail and legs are fairly short. The bill is short and straight",
        "size: About two-thirds the size of an American Robin between sparrow and robin",
        "color: Male Sialia sialiss are vivid, deep blue above and rusty or brick-red on the throat and breast. Blue in birds always depends on the light, and males often look plain gray-brown from a distance. Females are grayish above with bluish wings and tail, and a subdued orange-brown breast"
    ],
    "Turdus migratorius": [
        "shape: Turdus migratoriuss are fairly large songbirds with a large, round body, long legs, and fairly long tail. Robins are the largest North American thrushes, and their profile offers a good chance to learn the basic shape of most thrushes. Robins make a good reference point for comparing the size and shape of other birds, too",
        "size: The largest North American thrush, almost half again as big as a bluebird robin-sized",
        "color: Turdus migratoriuss are gray-brown birds with warm orange underparts and dark heads. In flight, a white patch on the lower belly and under the tail can be conspicuous. Compared with males, females have paler heads that contrast less with the gray back"
    ],
    "Contopus cooperi": [
        "shape: A stocky, barrel-chested flycatcher, with a large head and a heavy, long bill for its size. It has rather long wings that can make the tail look short",
        "size: Larger than a Western Wood-Pewee, smaller than a Western Kingbird between sparrow and robin",
        "color: Sooty gray-brown above (with olive tones only in optimal light and fresh plumage), paler below. The dark gray sides of the breast contrast with white in the center, making it look as if the bird is wearing a vest. From the rear, large white tufts at the sides of the back are sometimes visible"
    ],
    "Contopus sordidulus": [
        "shape: Contopus sordiduluss are medium-sized flycatchers with a peaked crown that gives their head a triangular shape. These long and thin flycatchers perch upright in the canopy. They have long wings, a feature that helps separate them from similar looking Empidonax flycatchers",
        "size: Slightly larger than a Dusky Flycatcher, smaller than a Western Kingbird sparrow-sized or smaller",
        "color: Contopus sordiduluss are grayish brown overall with 2 pale wingbars. The underparts are whitish with smudgy gray on the breast and sides that can make them look like they are wearing a partially buttoned vest. The face is dark grayish brown with little to no eyering. The bill is mostly dark with yellow at the base of the lower mandible. Juveniles are similar to adults but have buffy wingbars"
    ],
    "Contopus virens": [
        "shape: Contopus virenss are medium-sized flycatchers with long wings and tails. Like other pewee species, they have short legs, upright posture, and a peaked crown that tends to give the head a triangular shape. Their long wings are an important clue to separate them from Empidonax flycatcher species",
        "size: A bit smaller than an Eastern Bluebird; larger than a chickadee sparrow-sized or smaller",
        "color: Contopus virenss are olive-gray birds with dark wings, and little to no yellow on the underparts. The sides of the breast are dark with an off-white throat and belly, giving a vested appearance typical of pewees. They show little or no eyering. Adults have thin, white wingbars; those of juveniles are buffy. The underside of the bill is mostly yellow-orange, except in some juveniles"
    ],
    "Empidonax difficilis": [
        "shape: A slim, small songbird with an upright posture, a large head that often looks peaked, and a straight, fairly wide bill. The tail is moderately long",
        "size: Slightly larger than a Chestnut-backed Chickadee, smaller than a Black Phoebe sparrow-sized or smaller",
        "color: In fresh plumage, pale greenish brown above, pale below with lemon wash and brownish breast. The wings and tail are dark with strongly contrasting pale wingbars. Worn birds can look brownish above, dingy pale gray below, with weak wingbars"
    ],
    "Empidonax flaviventris": [
        "shape: A compact, small flycatcher with a big-eyed look and a big head that sometimes shows a peak at the rear. It has a short tail and a small but wide bill",
        "size: Larger than a Ruby-crowned Kinglet, smaller than an Eastern Phoebe sparrow-sized or smaller",
        "color: Yellowish olive overall with a strong white eyering and two whitish wingbars. It has yellowish underparts all the way from its chin to its lower belly"
    ],
    "Empidonax minimus": [
        "shape: Empidonax minimuss are the smallest Empidonax flycatcher in the East. Like other flycatchers they tend to perch upright, but they appear a little more compact than most. The primary feathers on their wings are short, which makes their thin tail look longer. Their head is round and is not peaked at the back of the head like some other Empidonax ",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than an Eastern Wood-Pewee sparrow-sized or smaller",
        "color: Empidonax minimuss are grayish olive above with a dusky breast. Their head is grayish olive as well with a bold white eyering. They have a very faint yellow wash to the belly and 2 white wingbars"
    ],
    "Empidonax occidentalis": [
        "shape: A slim, small songbird with a large, often peaked head, a straight, flat, pointed bill, and a moderately long tail",
        "size: Slightly larger than a Mountain Chickadee, smaller than a Western Kingbird sparrow-sized or smaller",
        "color: In fresh plumage, greenish brown above (usually darker than Pacific-slope), pale below with strong lemon wash and olive-tinged breast (colors usually richer than in Pacific-slope); wings and tail dark with strongly contrasting pale wingbars. Worn birds can look brownish above, dingy pale gray below, with weak wingbars"
    ],
    "Empidonax virescens": [
        "shape: Small and long-tailed, with a large, peaked head and a broad, flat bill. Sits with a distinctly upright posture. Wings are long for a flycatcher",
        "size: Larger than a Yellow Warbler, smaller than a Great Crested Flycatcher sparrow-sized or smaller",
        "color: Empidonax virescenss are olive-green above with a whitish eyering and whitish underparts. The wings are dark with two distinct white wingbars. The bill is dark above and mostly orange-yellow below"
    ],
    "Myiarchus cinerascens": [
        "shape: This medium-sized flycatcher is long and slender with a long tail. Its head is slightly peaked at the back, making it look rather large headed for its size. It has a medium-sized bill that is thicker than phoebes and Empidonax flycatchers, but smaller than kingbirds",
        "size: Larger than a Western Bluebird, smaller than an American Robin robin-sized",
        "color: Myiarchus cinerascenss are grayish brown overall with a pale yellow belly and cinnamon edges on the primary feathers in the wing. The underside of the tail has a broad stroke of cinnamon down the center bordered by brownish gray. The cinnamon stripe does not reach the tip of the tail; the tip of the tail is brownish gray. Two whitish wingbars mark the wings. The head and face is uniformly ashy gray with a whitish throat. Males and females look similar"
    ],
    "Myiarchus crinitus": [
        "shape: Myiarchus crinituss are large flycatchers with fairly long and lean proportions. Like many flycatchers they have a powerful build with broad shoulders and a large head. Despite its name, this birds crest is not especially prominent. The bill is fairly wide at the base and straight; the tail is fairly long",
        "size: Larger than an Eastern Bluebird; smaller than an American Robin robin-sized",
        "color: Myiarchus crinituss are reddish-brown above, with a brownish-gray head, gray throat and breast, and bright lemon-yellow belly. The brown upperparts are highlighted by rufous-orange flashes in the primaries and in the tail feathers. The black bill sometimes shows a bit of pale color at the base"
    ],
    "Pyrocephalus rubinus": [
        "shape: A fairly small, stocky flycatcher with an upright posture. Fairly flat headed and barrel chested, with a slender tail and a broad, straight bill",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than an Ash-throated Flycatcher between sparrow and robin",
        "color: Adult males are brilliant orange-red with a dark brown mask through the eyes and brown back, wings, and tail. Females and immatures are gray-brown with faint streaks on the breast and a salmon-red blush on the underparts. The bill is black"
    ],
    "Sayornis nigricans": [
        "shape: Sayornis nigricanss are small, plump songbirds with large heads and medium-long, squared tails. They often show a slight peak at the rear of the crown. The bill is straight and thin",
        "size: Smaller than a Western Scrub-Jay; larger than an American Goldfinch sparrow-sized or smaller",
        "color: Sayornis nigricanss are mostly sooty gray on the upperparts and chest, with a slightly darker black head. The belly is clean white, and the wing feathers are edged with pale gray"
    ],
    "Sayornis phoebe": [
        "shape: The Sayornis phoebe is a plump songbird with a medium-length tail. It appears large-headed for a bird of its size. The head often appears flat on top, but phoebes sometimes raise the feathers up into a peak. Like most small flycatchers, they have short, thin bills used for catching insects",
        "size: Slightly larger than a Tufted Titmouse sparrow-sized or smaller",
        "color: The Sayornis phoebe is brownish-gray above and off-white below, with a dusky wash to the sides of the breast. The head is typically the darkest part of the upperparts. Birds in fresh fall plumage show faint yellow on the belly and whitish edging on the folded wing feathers"
    ],
    "Sayornis saya": [
        "shape: This slender, long-tailed flycatcher appears large-headed for a bird of its size. The head often looks flat on top, but phoebes sometimes raise their head feathers into a small peak at the back",
        "size: Larger than a Dark-eyed Junco, smaller than an American Robin between sparrow and robin",
        "color: Sayornis sayas are pale brownish gray above with a cinnamon belly, a blackish tail, and a gray breast. Male and female are similar. The immature is similar to the adult, but browner and may have a buffy wingbar"
    ],
    "Tyrannus dominicensis": [
        "shape: A large flycatcher with a big head, straight, heavy bill, and a rather long, notched tail",
        "size: Larger than an Eastern Bluebird, smaller than an American Robin robin-sized",
        "color: Adults are gray above, white below, with dark gray wings and tail, a dark gray mask, and a dark bill. Immatures are similar but with browner tones above"
    ],
    "Tyrannus forficatus": [
        "shape: Tyrannus forficatuss are slender, stout-billed kingbirds with very long, stiff, deeply forked tails. Males have longer tail feathers than females and immatures",
        "size: Smaller and more slender overall than an American Robin, but can seem larger because of the very long tail; larger than an Eastern Phoebe robin-sized",
        "color: These are pale gray birds with blackish wings and black tails with white edges. Adults have salmon-pink flanks that extend to underwing patches that are very conspicuous in flight. Males are more intensely colored than females"
    ],
    "Tyrannus melancholicus": [
        "shape: A powerfully built flycatcher with a big head and a heavy, long bill. It has pointed but broad wings, and its medium-length tail shows a shallow notch in the center",
        "size: Larger than a Western Kingbird, smaller than a Green Jay robin-sized",
        "color: A gray-headed bird with bright yellow underparts and a pale gray-green back. It has a whitish throat and dark gray-brown wings and tail"
    ],
    "Tyrannus tyrannus": [
        "shape: The Tyrannus tyrannus is a sturdy, medium-sized songbird with a large head, upright posture, square-tipped tail, and a relatively short, straight bill",
        "size: Smaller than an American Robin; larger than an Eastern Phoebe robin-sized",
        "color: Tyrannus tyrannuss are blackish above and white below. The head is a darker black than the wings and back, and the black tail has a conspicuous white tip"
    ],
    "Tyrannus verticalis": [
        "shape: Tyrannus verticaliss are fairly large flycatchers with large heads and broad shoulders. They have heavy, straight bills, long wings, and a medium-length, square-tipped tail",
        "size: Smaller than an American Robin; larger than a Black Phoebe robin-sized",
        "color: Tyrannus verticaliss are gray-headed birds with a yellow belly and a whitish chest and throat. The tail is black with white outer tail feathers that are especially conspicuous in flight"
    ],
    "Tyrannus vociferans": [
        "shape: A compact, powerfully built flycatcher with a heavy, straight bill, smallish head, and moderately long wings and tail",
        "size: Slightly larger than a Western Kingbird, smaller than a Northern Mockingbird robin-sized",
        "color: A gray-headed bird with a neat white throat and a lemon-yellow belly. The wings and tail are brownish; the tail does not have white outer feathers, but often shows a pale tip"
    ],
    "Vireo bellii": [
        "shape: A diminutive songbird with a slim build and a slender, somewhat long tail. Its bill is small for a vireo, but still thicker and more hooked than a warblers",
        "size: Larger than a kinglet, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Western birds, especially the tiny Least Vireo bellii, are grayish above, whitish below, with faint pale “spectacles” around the eyes and pale wingbars. Eastern birds have greenish tones above and a yellow wash on the sides, with stronger wingbars"
    ],
    "Vireo cassinii": [
        "shape: A small but sturdy songbird, with a fairly thick, short bill and relatively long wings and tail",
        "size: Larger than a Red-breasted Nuthatch, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Olive green above with a grayish head and a prominent white eyering and wingbars. White below, with yellow-olive wash on sides. Dark eye, bill, and legs"
    ],
    "Vireo flavifrons": [
        "shape: Vireo flavifronss are small songbirds, but they are chunky, with a big head, thick bill, and short tail",
        "size: Larger than a Black-capped Chickadee, smaller than an Eastern Wood-Pewee sparrow-sized or smaller",
        "color: Males and females look as if they are wearing bright yellow spectacles on their olive-green head. The throat and chest match their spectacles, but the lower belly is bright white. Two white bars mark the gray wings"
    ],
    "Vireo gilvus": [
        "shape: Vireo gilvuss are small, chunky songbirds with thick, straight, slightly hooked bills. They are medium-sized for vireos, with a fairly round head and medium-length bill and tail",
        "size: Slightly larger than a Black-capped Chickadee; smaller than a House Finch sparrow-sized or smaller",
        "color: Vireo gilvuss are gray-olive above and whitish below, washed on the sides and vent with yellow. They have a dark line through the eye and a white line over the eye. The lores (the area between the eye and bill) are white in most individuals. Typically, the brightest plumage on Vireo gilvuss is on vent or flanks. Worn midsummer birds can be nearly entirely gray above and whitish below"
    ],
    "Vireo griseus": [
        "shape: Small songbird with a thick, straight, and slightly hooked bill. It has a rather compact body and a thick neck",
        "size: Larger than a Blue-gray Gnatcatcher, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: This vireo wears yellow spectacles surrounding its white eye. It has yellow-washed sides, a gray head, a white chest and throat, and 2 white wingbars. Young birds have a dark eye that turns white in their first winter or spring"
    ],
    "Vireo huttoni": [
        "shape: A small vireo with a large head, short bill, rather short wings, and a moderately long tail",
        "size: Larger than a Ruby-crowned Kinglet, smaller than a Cassins Vireo sparrow-sized or smaller",
        "color: Grayish olive above, pale gray below (sometimes with pale olive tones to the flanks). The wings are darker with two wingbars. The face shows an incomplete eyering, thicker in front of and behind the eye (similar to the Ruby-crowned Kinglets face pattern)"
    ],
    "Vireo olivaceus": [
        "shape: Vireo olivaceuss are large, chunky vireos with a long, angular head, thick neck, and a strong, long bill with a small but noticeable hook at the tip. The body is stocky and the tail fairly short",
        "size: Slightly larger than a Yellow Warbler; slightly smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: Vireo olivaceuss are olive-green above and clean white below with a strong head pattern: a gray crown and white eyebrow stripe bordered above and below by blackish lines. The flanks and under the tail have a green-yellow wash. Adults have red eyes that appear dark from a distance; immatures have dark eyes"
    ],
    "Vireo philadelphicus": [
        "shape: A small songbird; small for a vireo but still chunkier than a warbler. The bill is small compared with other vireos",
        "size: Larger than a Ruby-crowned Kinglet, slightly smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Olive above and pale below, often with a yellow throat and underparts. Dark grayish crown, with a dark line all the way through the eye and a pale stripe over the eye"
    ],
    "Vireo plumbeus": [
        "shape: A small, sturdy songbird with a fairly thick, short, and slightly hooked bill",
        "size: Larger than a Red-breasted Nuthatch, smaller than a Red-eyed Vireo sparrow-sized or smaller",
        "color: Vireo plumbeuss are rich gray above, white below, with bold white “spectacles” (the eyering and lores). The grayish sides can show a hint of yellowish"
    ],
    "Vireo solitarius": [
        "shape: A stocky small songbird with medium-length tail and fairly heavy, hooked bill and thick legs (compared to warblers)",
        "size: Larger than a Carolina Chickadee, smaller than a Tufted Titmouse sparrow-sized or smaller",
        "color: A moss-green bird with a bluish-gray head and crisp white underparts. The face is set off by clean white “spectacles” and throat. Underparts white, sides greenish yellow. Tail and wings blackish, with two white wingbars"
    ],
    "Ardea alba": [
        "shape: Ardea albas are tall, long-legged wading birds with long, S-curved necks and long, dagger-like bills. In flight, the long neck is tucked in and the legs extend far beyond the tip of the short tail",
        "size: Smaller than a Great Blue Heron; larger than a Snowy Egret goose-sized or larger",
        "color: All feathers on Ardea albas are white. Their bills are yellowish-orange, and the legs black"
    ],
    "Ardea herodias": [
        "shape: Largest of the North American herons with long legs, a sinuous neck, and thick, daggerlike bill. Head, chest, and wing plumes give a shaggy appearance. In flight, the Ardea herodias curls its neck into a tight “S” shape; its wings are broad and rounded and its legs trail well beyond the tail",
        "size: Taller and much heavier than a Great Egret; smaller and much less bulky than a Sandhill Crane goose-sized or larger",
        "color: Ardea herodiass appear blue-gray from a distance, with a wide black stripe over the eye. In flight, the upper side of the wing is two-toned: pale on the forewing and darker on the flight feathers. A pure white subspecies occurs in coastal southern Florida"
    ],
    "Bubulcus ibis": [
        "shape: Compared with other herons, Bubulcus ibiss are noticeably small and compact. They have relatively short legs and a short thick neck. The straight, daggerlike bill is shorter and thicker than other herons. They have medium-length, broad, rounded wings",
        "size: Smaller and stockier than a Snowy Egret; larger than a Rock Pigeon between crow and goose",
        "color: Adult Bubulcus ibiss are all white with a yellow bill and legs. In breeding plumage they have golden plumes on their head, chest, and back. Juveniles have dark legs and bill"
    ],
    "Butorides virescens": [
        "shape: Compared with most herons, Butorides virescenss are short and stocky, with relatively short legs and thick necks that are often drawn up against their bodies. They have broad, rounded wings and a long, daggerlike bill. They sometimes raise their crown feathers into a short crest",
        "size: About the size of an American Crow; smaller than a Black-crowned Night-Heron crow-sized",
        "color: From a distance Butorides virescenss look all dark. In better light they are deep green on the back with a rich chestnut breast and neck. The wings are dark gray. Juveniles are browner, with pale streaking on the neck and spots on the wings"
    ],
    "Egretta caerulea": [
        "shape: This is a fairly small heron with a slight body, slender neck, and fairly long legs. It has rounded wings, and a long, straight, spearlike bill that is thick at the base",
        "size: Smaller than a Great Blue Heron; about the size of a Snowy Egret between crow and goose",
        "color: Adult Egretta caeruleas are very dark all over. At close range or in good light, they have a rich purple-maroon head and neck and dark slaty-blue body. They have yellow eyes, greenish legs, and a bill that is pale blue at the base, black at the tip. Juveniles are entirely white, except for vague dusky tips to the outer primaries. Immatures molting into adult plumage are a patchwork of white and blue"
    ],
    "Egretta rufescens": [
        "shape: A fairly large, powerfully built but elegant heron. Egretta rufescenss have long, sturdy legs, long necks, and thick, daggerlike bills. The feathers of the head and neck are often extended, giving a shaggy appearance",
        "size: Larger than a Snowy Egret, smaller than a Great Egret goose-sized or larger",
        "color: Dark morph adults are rich grayish blue bodies with vivid pinkish-cinnamon head and neck. White morph adults are snow white overall. Both morphs have two-toned bills: pink at the base and black at the tip. Legs are cobalt blue. Juveniles are an ashy copper color, unlike any other heron species; legs and bill mostly dusky"
    ],
    "Egretta thula": [
        "shape: These are medium-sized herons with long, thin legs and long, slender, bills. Their long, thin neck sets the small head well away from the body",
        "size: Smaller than a Great Egret; larger than a Cattle Egret between crow and goose",
        "color: Adult Egretta thulas are all white with a black bill, black legs, and yellow feet. They have a patch of yellow skin at the base of the bill. Immature Egretta thulas have duller, greenish legs"
    ],
    "Egretta tricolor": [
        "shape: A medium-sized, delicate and slim heron with a long, daggerlike bill. Its long thin neck curves up to its small head",
        "size: Larger than a Snowy Egret, smaller than a Great Blue Heron between crow and goose",
        "color: A colorful heron with a mix of blue-gray, lavender, and white. Unlike other dark herons, they have a white belly. Breeding birds have small white plumes extending from the back of the head, a bright blue patch of skin around the bill, and pink legs. Nonbreeding birds lack the flourishes of breeding birds and have yellowish legs. Juveniles have a rusty neck and rusty edged feathers"
    ],
    "Nyctanassa violacea": [
        "shape: Nyctanassa violaceas are fairly small herons with stocky bodies and short, thick necks, and short legs. They have large, blocky heads with thick, relatively short bills. In flight, the wings are broad and rounded",
        "size: Larger than a Cattle Egret; smaller and stockier than a Great Egret between crow and goose",
        "color: Adults are cloudy gray birds with a bold face pattern: a black head with large white cheek patch, and a creamy yellow crown and head plumes. Immatures are brown with fine white spots on the back and wings; the underparts are streaky. The legs are orange-yellow, brighter in adults"
    ],
    "Nycticorax nycticorax": [
        "shape: Nycticorax nycticoraxs are small herons with rather squat, thick proportions. They have thick necks, large, flat heads, and heavy, pointed bills. The legs are short and, in flight, barely reach the end of the tail. The wings are broad and rounded",
        "size: Larger than a Green Heron; smaller and thicker-bodied than a Great Egret between crow and goose",
        "color: Adults are light-gray birds with a neatly defined black back and black crown. Immatures are brown with large white spots on the wings and blurry streaks on the underparts. Adults have all-black bills; immatures have yellow-and-black bills"
    ],
    "Pelecanus erythrorhynchos": [
        "shape: A huge waterbird with very broad wings, a long neck, and a massive bill that gives the head a unique, long shape. They have thick bodies, short legs, and short, square tails. During the breeding season, adults grow an unusual projection or horn on the upper mandible near the tip of the bill",
        "size: One of our largest flying birds: considerably larger than a Bald Eagle; smaller than a California Condor goose-sized or larger",
        "color: Adult Pelecanus erythrorhynchoss are snowy white with black flight feathers visible only when the wings are spread. A small patch of ornamental feathers on the chest can become yellow in spring. The bill and legs are yellow-orange. Immatures are mostly white as well, but the head, neck, and back are variably dusky"
    ],
    "Pelecanus occidentalis": [
        "shape: Pelecanus occidentaliss are huge, stocky seabirds. They have thin necks and very long bills with a stretchy throat pouch used for capturing fish. Their wings are very long and broad and are often noticeably bowed when the birds are gliding",
        "size: Huge. Slightly smaller than an American White Pelican; much larger than a Herring Gull goose-sized or larger",
        "color: Adult Pelecanus occidentaliss are gray-brown birds with yellow heads and white necks. In breeding plumage, the back and sides of the neck turn a rich, dark reddish-brown. Immatures are gray-brown above (including the head and neck) with pale whitish belly and breast"
    ],
    "Eudocimus albus": [
        "shape: Eudocimus albuses are large wading birds with football-shaped bodies. They have long legs and a long neck that they hold out straight in flight. Their bill is long and curved",
        "size: Larger than a Cattle Egret, smaller than a Great Egret crow-sized",
        "color: This ibis is almost entirely white, save for the black-tipped wings and brilliant reddish pink legs and bill. The bare skin around their blue eyes is also reddish pink. Juveniles (fall through winter) are brown above and white below with a streaky brown neck. The legs and bill of juveniles are orange-pink. Immatures (first summer birds) are splotchy brown and white above as they molt into adult plumage"
    ],
    "Platalea ajaja": [
        "shape: Platalea ajajas are medium-sized waterbirds with a football-shaped body and long legs. The long bill that is flattened into a spoon at the end protrudes from their small head. They fly with their long necks outstretched and often rest with it curled into an S",
        "size: Larger than a White Ibis, smaller than a Great Blue Heron goose-sized or larger",
        "color: Platalea ajajas are pale pink birds with brighter pink shoulders and rump. They have a white neck and a partially feathered, yellowish green head from which their red eyes shine. Juveniles are paler pink and have a completely feathered head for 3 years until they attain adult breeding plumage"
    ],
    "Plegadis chihi": [
        "shape: A medium-sized, long-legged wading bird with a long, strongly curved bill. It has a thick, oval-shaped body and a long neck. The wings are broad and fairly rounded",
        "size: Larger than a Cattle Egret, smaller than a Great Egret crow-sized",
        "color: Plegadis chihies look dark, almost blackish, at a distance. Close up and in good light, breeding adults are glossy maroon with metallic green and bronze tones on the wing. They typically have red eyes with pink legs and facial skin. The face is highlighted by a narrow band of white, absent in Glossy Ibis. Immature and nonbreeding adults are more matte brown, without the white facial outline and with duller legs"
    ],
    "Plegadis falcinellus": [
        "shape: A medium-sized wading bird with compact body, long neck, long legs, and long, curved bill",
        "size: Larger than a Cattle Egret, slightly smaller than a night-heron between crow and goose",
        "color: The plumage appears dark, almost blackish, at a distance or in poor light. At close range, much of the body is maroon, with the wing coverts showing metallic green, bronze, and violet tones"
    ],
    "Colaptes auratus": [
        "shape: Flickers are fairly large woodpeckers with a slim, rounded head, slightly downcurved bill, and long, flared tail that tapers to a point",
        "size: About half again as big as a Hairy Woodpecker between robin and crow",
        "color: Flickers appear brownish overall with a white rump patch thats conspicuous in flight and often visible when perched. The undersides of the wing and tail feathers are bright yellow, for eastern birds, or red, in western birds. With a closer look you’ll see the brown plumage is richly patterned with black spots, bars, and crescents"
    ],
    "Dryobates borealis": [
        "shape: Dryobates borealiss are small woodpeckers with short, straight bills",
        "size: robin-sized",
        "color: Despite their name, they are largely black and white, with a large, bright-white cheek patch and a bold black malar stripe forming the lower border of the cheek. Males have a tiny, nearly invisible red streak (“cockade”) at the upper border of the cheek. The back has strong horizontal black-and-white bars"
    ],
    "Dryobates nuttallii": [
        "shape: The Nuttall's Woodpecker is a small woodpecker with a chisel-shaped bill. It has a small rounded head, a flat back, and an elongated appearance",
        "size: Slightly larger than a Downy Woodpecker, smaller than a Hairy Woodpecker between sparrow and robin",
        "color: Nuttall's Woodpeckers are black-and-white striped birds. Males have a red patch on the back of their heads and both sexes have 2 narrow white stripes across their cheeks. The back has narrow black-and-white horizontal bars with a solid black patch on the upper back. The underparts are whitish with spotting and barring on the flanks. Juveniles have more grayish or buffy underparts than adults, and juveniles of both sexes have some red on the crown"
    ],
    "Dryobates pubescens": [
        "shape: Dryobates pubescenss are small versions of the classic woodpecker body plan. They have a straight, chisel-like bill, blocky head, wide shoulders, and straight-backed posture as they lean away from tree limbs and onto their tail feathers. The bill tends to look smaller for the birds size than in other woodpeckers",
        "size: About two-thirds the size of a Hairy Woodpecker between sparrow and robin",
        "color: Dryobates pubescenss give a checkered black-and-white impression. The black upperparts are checked with white on the wings, the head is boldly striped, and the back has a broad white stripe down the center. Males have a small red patch on the back of the head. The outer tail feathers are typically white with a few black spots"
    ],
    "Dryobates scalaris": [
        "shape: Dryobates scalariss are small woodpeckers with a square head, short neck, and stiff tail that they lean against for support. The bill is rather small but straight and chisel-like",
        "size: Larger than a Downy Woodpecker, smaller than a Hairy Woodpecker between sparrow and robin",
        "color: Dryobates scalariss are black-and-white above, with neat stripes like ladder rungs on the back, and a more checkered pattern on the wings. The underparts are buffy white or grayish, stippled with black. The buffy white face is broken by black lines that extend from the bill and eye and join at the neck. Males have mostly red crowns; females have blackish crowns"
    ],
    "Dryobates villosus": [
        "shape: A medium-sized woodpecker with a fairly square head, a long, straight, chisel-like bill, and stiff, long tail feathers to lean against on tree trunks. The bill is nearly the same length as the head",
        "size: About a third again larger than a Downy Woodpecker robin-sized",
        "color: Dryobates villosuss are contrastingly black and white. The black wings are checkered with white; the head has two white stripes (and, in males, a flash of red toward the back of the head). A large white patch runs down the center of the black back"
    ],
    "Dryocopus pileatus": [
        "shape: The Dryocopus pileatus is a very large woodpecker with a long neck and a triangular crest that sweeps off the back of the head. The bill is long and chisel-like, about the length of the head. In flight, the wings are broad and the bird can seem crowlike",
        "size: Nearly the size of an American Crow crow-sized",
        "color: Dryocopus pileatuss are mostly black with white stripes on the face and neck and a flaming-red crest. Males have a red stripe on the cheek. In flight, the bird reveals extensive white underwings and small white crescents on the upper side, at the bases of the primaries"
    ],
    "Melanerpes aurifrons": [
        "shape: A robust, medium-sized woodpecker with a long, pointed bill",
        "size: Larger than a Downy Woodpecker, smaller than a Northern Flicker between robin and crow",
        "color: Melanerpes aurifronss have grayish brown heads and bodies, golden napes and nasal tufts, black-and-white barred wings, and black tails. Males have a red central crown. The yellow in the lower belly can be difficult to see"
    ],
    "Melanerpes carolinus": [
        "shape: A sleek, round-headed woodpecker, about the same size as a Hairy Woodpecker but without the blocky outlines",
        "size: Same size as Hairy Woodpecker; three-quarters the size of a Northern Flicker between robin and crow",
        "color: Often appears pale overall, even the boldly black-and-white striped back, with flashing red cap and nape. Look for white patches near the wingtips as this bird flies"
    ],
    "Melanerpes erythrocephalus": [
        "shape: Melanerpes erythrocephaluss are medium-sized woodpeckers with fairly large, rounded heads, short, stiff tails, and powerful, spike-like bills",
        "size: Smaller than a Northern Flicker; about the size of a Hairy Woodpecker between robin and crow",
        "color: Adults have bright-red heads, white underparts, and black backs with large white patches in the wings, making the lower back appear all white when perched. Immatures have gray-brown heads, and the white wing patches show rows of black spots near the trailing edge"
    ],
    "Melanerpes formicivorus": [
        "shape: Melanerpes formicivoruss are medium-sized woodpeckers with straight, spike-like bills and stiff, wedge-shaped tails used for support as the birds cling to tree trunks",
        "size: Smaller than a Northern Flicker; larger than a Downy Woodpecker robin-sized",
        "color: These striking birds are mostly black above with a red cap, creamy white face, and black patch around the bill. In flight, they show three patches of white: one in each wing and one on the rump. Females have less red on the crown than males"
    ],
    "Melanerpes uropygialis": [
        "shape: A medium-sized woodpecker with a long, pointed bill",
        "size: Larger than a Ladder-backed Woodpecker, smaller than a Gilded Flicker between robin and crow",
        "color: Melanerpes uropygialiss are grayish brown birds with brilliant black-and-white barring on the wings, back, and tail. In flight, the outer wings are black with a crescent-shaped white patch at the base of the primary feathers. Males have a red patch in the center of the crown"
    ],
    "Picoides dorsalis": [
        "shape: A small woodpecker with a stout body and a fairly short but strong, chisel-like bill",
        "size: Larger than a Downy Woodpecker, smaller than a Hairy Woodpecker robin-sized",
        "color: A black-and-white woodpecker with (in males) a yellow patch on the forehead. The back is black with messy white barring and white spots in the wings. The underparts are white with fine blackish barring on the flanks. The face is black with a white line behind the eye and a thin white line below the cheek. The outer tail feathers are white, usually with a few black bars. Juveniles of both sexes have a small yellow crown patch"
    ],
    "Sphyrapicus nuchalis": [
        "shape: The Sphyrapicus nuchalis is a medium-sized woodpecker with a slight peak to the back of the head. It clings vertically to trees giving it an elongated appearance. The bill is stout and sharply pointed",
        "size: Larger than a Downy Woodpecker, smaller than a Northern Flicker robin-sized",
        "color: Sphyrapicus nuchaliss are black and white overall with a red cap, nape, and throat. They have a long white bar on the folded wing. A black stripe through the eye is bordered by white stripes. The belly is mottled black and white, with a dingy or yellowish cast. Female Sphyrapicus nuchaliss have a white patch on the chin while males have entirely red chins. Juveniles have a brown cap and an overall brown wash on their belly and head"
    ],
    "Sphyrapicus ruber": [
        "shape: A medium-sized woodpecker with a long body, large, rounded head, and a chisel-like bill",
        "size: A medium-sized woodpecker. Larger than a Downy Woodpecker, smaller than a Northern Flicker robin-sized",
        "color: Both male and female Sphyrapicus rubers have a red head and breast with a white spot between the eye and the bill. The back is mottled black and white and the wings are black with a large vertical white patch. Underparts are mostly white, with dark streaks on the side and a yellowish wash on the belly"
    ],
    "Sphyrapicus varius": [
        "shape: Sphyrapicus variuss are fairly small woodpeckers with stout, straight bills. The long wings extend about halfway to the tip of the stiff, pointed tail at rest. Often, sapsuckers hold their crown feathers up to form a peak at the back of the head",
        "size: Larger than a Downy Woodpecker; slightly smaller than a Hairy Woodpecker robin-sized",
        "color: Sphyrapicus variuss are mostly black and white with boldly patterned faces. Both sexes have red foreheads, and males also have red throats. Look for a long white stripe along the folded wing. Bold black-and-white stripes curve from the face toward a black chest shield and white or yellowish underparts"
    ],
    "Aechmophorus clarkii": [
        "shape: A large waterbird with a very long, slender neck, a fine, straight bill, and a relatively small body",
        "size: Larger and more slender than a Mallard, much smaller and slighter than a Common Loon crow-sized",
        "color: A neat combination of blackish above and white below. The face is white up to and around the eye, where it meets the black cap. The bill is vivid orange or orange-yellow, and at close range the eye is red"
    ],
    "Aechmophorus occidentalis": [
        "shape: A large, slender waterbird with a very long neck, a large head that may show a peak, and a long, slender, pointed bill",
        "size: Larger than a Mallard, smaller than a Common Loon crow-sized",
        "color: Aechmophorus occidentaliss are crisp black and white, with a sharp transition between black and white extending down the neck. The head and most of the face are black, with white below the eye. The bill is yellowish or greenish yellow and the eye is red at close range"
    ],
    "Podiceps auritus": [
        "shape: A small, compact waterbird with a compact body, relatively short neck, blocky head (sometimes peaked), and straight, narrow bill, very unlike a duck's bill",
        "size: Slightly larger than an Eared Grebe, smaller than a Red-necked Grebe between robin and crow",
        "color: Breeding adults are dark gray-black on the back with rich rusty-cinnamon sides and neck. The head is gray-black with long yellow tufts behind the eye. Nonbreeding birds are monochromatic: grayish above with white underparts. The head is capped in black with a sharp transition to white on the cheek"
    ],
    "Podiceps grisegena": [
        "shape: A thickset waterbird, similar in size to many ducks, but with a longer neck and a heavy, pointed bill",
        "size: Almost as large as a Mallard; intermediate between Horned Grebe and Western Grebe crow-sized",
        "color: Nonbreeding birds are mostly dark gray above, paler below, with pale cheeks and sides of neck. Breeding adults have a rusty red breast and foreneck, with a smart black cap and sharply defined white cheek. Immatures are similar to nonbreeding adults but head pattern is less distinct"
    ],
    "Podiceps nigricollis": [
        "shape: A small waterbird with an even smaller head, a thin neck, and a thin bill. It has a sleek oval back and a tailless, fluffy rear. Breeding birds have a crested or peaked head",
        "size: Larger than a Wilson's Phalarope, smaller than a Mallard between robin and crow",
        "color: Breeding birds are mostly black with chestnut flanks and golden plumes fanning out from behind the bright red eye. Nonbreeding birds are grayish black overall. The cheeks are smudgy gray and the dark crown extends down past the red eye. The neck is whitish"
    ],
    "Podilymbus podiceps": [
        "shape: Podilymbus podicepss are small, chunky swimming birds. They have compact bodies and slender necks, with relatively large, blocky heads and short, thick bills. They have virtually no tail",
        "size: Smaller than an American Coot; about the size of a Green-winged Teal between robin and crow",
        "color: These are brown birds, slightly darker above and more tawny-brown on the underparts. During spring and summer, the crown and nape are dark and the throat is black. While breeding, the bill is whitish with a black band (“pied’), but otherwise is yellow-brown. Juveniles have striped faces"
    ],
    "Phoebastria immutabilis": [
        "shape: Phoebastria immutabilises are very large seabirds (though they are among the smaller albatrosses). They have very long, very narrow wings. The neck is thick and the head is large",
        "size: Slightly smaller, more slender, and narrower-winged than a Brown Pelican; much larger than a Western Gull goose-sized or larger",
        "color: Phoebastria immutabilises are white-headed birds with dark gray-brown upperwings and mostly white underwings (with variable dark markings). The underparts are clean white. They have a dark patch around the eye. In flight, note the dark back, white rump, and dark tail"
    ],
    "Phoebastria nigripes": [
        "shape: A very large seabird with long, narrow wings, a heavy head and neck, and a long, hooked bill",
        "size: Much larger than a Western Gull, slightly smaller than a Short-tailed Albatross goose-sized or larger",
        "color: Dark brown overall, sometimes with whitish plumage in uppertail and undertail coverts or on the face. Feet and bill blackish"
    ],
    "Fulmarus glacialis": [
        "shape: Looks superficially like a gull. A heavyset, medium-sized seabird with a short neck, stout body, large head, and long wings. The bill is stout and hooked, with two nasal tubes on the top edge",
        "size: Larger than a Ring-billed Gull, smaller than a Herring Gull crow-sized",
        "color: Most fulmars are \"light morph\": gray above and white below, a pattern similar to large gulls. Some \"dark morphs\" occur in the North Pacific and are pale to dark gray all over"
    ],
    "Myiopsitta monachus": [
        "shape: A fairly small parakeet with a long, pointed tail and fairly narrow, pointed wings. Like other parakeets, they have large heads and large, hooked bills",
        "size: Larger than a European Starling; smaller than a Rock Pigeon between robin and crow",
        "color: Myiopsitta monachuss are green with a gray face and breast. The bill is pale pink. In flight, the primary and outer secondary flight feathers are blue"
    ],
    "Aegolius acadicus": [
        "shape: These are very small owls with large, rounded heads that lack ear tufts",
        "size: Slightly heavier (but more compact) than a Hairy Woodpecker; smaller than an Eastern Screech-Owl robin-sized",
        "color: Aegolius acadicuss are mottled brown birds with a whitish facial disk and white-spotted head. Their eyes are yellow. Juveniles are dark brown with creamy yellow breast and belly"
    ],
    "Athene cunicularia": [
        "shape: Athene cunicularias are small owls with long legs and short tails. The head is rounded and does not have ear tufts",
        "size: About the same length/height as an American Robin but much bulkier; slightly smaller than a Western Screech-Owl between robin and crow",
        "color: Adults are brown birds mottled with sandy-pale spots on the upperparts. The breast is spotted, grading to dark brown bars on the belly. They have a bold white throat and eyebrows, and yellow eyes. The brown juveniles are less mottled than adults, with buffy-yellow underparts and wing patch"
    ],
    "Bubo scandiacus": [
        "shape: Bubo scandiacuss are very large owls with smoothly rounded heads that rarely show ear tufts. The body is bulky, with dense feathering on the legs that makes the bird look wide at the base when sitting on the ground",
        "size: About the size of a Great Horned Owl crow-sized",
        "color: Bubo scandiacuss are white birds with varying amounts of black or brown markings on the body and wings. On females this can be quite dense, giving the bird a salt-and-pepper look. Males tend to be paler and become whiter as they age. The eyes are yellow"
    ],
    "Bubo virginianus": [
        "shape: These are large, thick-bodied owls with two prominent feathered tufts on the head. The wings are broad and rounded. In flight, the rounded head and short bill combine to create a blunt-headed silhouette",
        "size: Slightly larger than a Red-tailed Hawk between crow and goose",
        "color: Bubo virginianuss are mottled gray-brown, with reddish brown faces and a neat white patch on the throat. Their overall color tone varies regionally from sooty to pale"
    ],
    "Glaucidium gnoma": [
        "shape: The Glaucidium gnoma is small and compact, with a large, circular head that lacks ear tufts. The tail is long and the wings are fairly short and rounded",
        "size: Smaller but plumper than a Mountain Bluebird; larger than an Elf Owl robin-sized",
        "color: Glaucidium gnomas are brown with fine white speckles on the head and white spots on the back. The back of the neck features two dark patches that look like eyespots. The eyes and bill are yellow"
    ],
    "Megascops asio": [
        "shape: The Megascops asio is a short, stocky bird, with a large head and almost no neck. Its wings are rounded; its tail is short and square. Pointed ear tufts are often raised, lending its head a distinctive silhouette",
        "size: A small owl, slightly larger and considerably bulkier than a European Starling robin-sized",
        "color: Megascops asios can be either mostly gray or mostly reddish-brown (rufous). Whatever the overall color, they are patterned with complex bands and spots that give the bird excellent camouflage against tree bark. Eyes are yellow"
    ],
    "Megascops kennicottii": [
        "shape: Megascops kennicottiis are small owls with stocky bodies. They have somewhat square heads, almost no neck, and conspicuous ear tufts. The tail is short",
        "size: robin-sized",
        "color: They are superbly camouflaged birds with a base color that can be grayish, brownish, or reddish-brown (rufous). The upperparts are flecked with white; the breast and belly are pale with dark, spidery streaks. The face is pale, outlined with dark arcs. The eyes are yellow"
    ],
    "Strix varia": [
        "shape: Strix varias are large, stocky owls with rounded heads, no ear tufts, and medium length, rounded tails",
        "size: Smaller than a Great Horned Owl; larger than a Barn Owl between crow and goose",
        "color: Strix varias are mottled brown and white overall, with dark brown, almost black, eyes. The underparts are mostly marked with vertical brown bars on a white background, while the upper breast is crossed with horizontal brown bars. The wings and tail are barred brown and white"
    ],
    "Tyto alba": [
        "shape: These medium-sized owls have long, rounded wings and short tails, which combine with a buoyant, loping flight to give them a distinctive flight style. The legs are long and the head is smoothly rounded, without ear tufts",
        "size: Larger than a screech-owl, but smaller than a Great Horned Owl crow-sized",
        "color: Tyto albas are pale overall with dark eyes. They have a mix of buff and gray on the head, back, and upperwings, and are white on the face, body, and underwings. When seen at night they can appear all white"
    ],
    "Anhinga anhinga": [
        "shape: Anhinga anhingas are large and slender waterbirds with long fanlike tails that resemble a turkey's tail. They have a long S-shaped neck and a daggerlike bill. In flight, Anhinga anhingas look like a flying cross; the wings are held out flat and the neck and tail stick straight out. They have slim bodies and look rather flattened in flight",
        "size: Larger than an American Coot, smaller than a Double-crested Cormorant between crow and goose",
        "color: Adult male Anhinga anhingas are black with silvery to white streaks on the back and wings. Females and immatures have a pale tan head, neck, and breast. The bill, legs, and feet are yellowish orange"
    ],
    "Fregata magnificens": [
        "shape: Fregata magnificenss are large seabirds with long, angular wings. They have a deeply forked tail that is often held closed in a point. The bill is long and sturdy with a prominently hooked tip",
        "size: Larger than a Brown Pelican, smaller than an American White Pelican goose-sized or larger",
        "color: Fregata magnificenss are mostly black, but females and young birds have varying amounts of white on the head, chest, and belly. Females have a white chest and a dark head. Juveniles start with a white head and belly and gradually obtain darker heads. Young birds also have a pale tan streak on the upper wing. Breeding males are entirely black save for the bright red throat pouch, which is not always visible"
    ],
    "Phalacrocorax carbo": [
        "shape: A heavyset seabird with a long, thick neck, blocky head, and heavy hooked bill. The legs are short, the tail fairly long, and the wings broad",
        "size: Larger than a Double-crested Cormorant, smaller than a Brown Pelican between crow and goose",
        "color: Adults are blackish overall with white throat and yellowish skin around the bill. When breeding, adults have a square patch of white on the thigh and white neck feathers. Juveniles are brownish with a whitish throat and belly, with some brownish streaking at the edges"
    ],
    "Morus bassanus": [
        "shape: A nearly albatross-sized, heavy-bodied seabird, with long, pointed wings, tail, and bill",
        "size: Larger than a Great Black-backed Gull, smaller than a Brown Pelican goose-sized or larger",
        "color: Adults are snow white with black wingtips and yellow heads; juveniles are uniformly sooty brown; and subadults are intermediate between these plumages, often appearing a patchwork of dark and light feathering"
    ]
}